{"retcode":0,"message":"OK","data":{"post":{"post":{"game_id":2,"post_id":"32547672","f_forum_id":0,"uid":"1015537","subject":"\"Flowers Resplendent on the Sun-Scorched Sojourn\" Version 5.0 Update Details","content":"\u003cdiv class=\"ql-image img-center af15883a-9a43-4269-b4fd-43742c083f8e\" data-uuid=\"af15883a-9a43-4269-b4fd-43742c083f8e\"\u003e\u003cdiv class=\"ql-image-wrp\"\u003e\u003cdiv class=\"ql-image-mask-wrapper\"\u003e\u003cimg src=\"https://hoyolab-upload-private.hoyolab.com/upload/2024/08/27/0/e830be0201055afbb30397cf1d3c7c13_1701305022315369968.jpeg?x-oss-process=image%2Fresize%2Cs_1000%2Fauto-orient%2C0%2Finterlace%2C1%2Fformat%2Cwebp%2Fquality%2Cq_70\" alt=\"\" align=\"img-center\" data-uuid=\"af15883a-9a43-4269-b4fd-43742c083f8e\"\u003e\u003c/div\u003e\u003cdiv class=\"ql-image-desc-wrp\"\u003e\u003cp contenteditable=\"false\" class=\"ql-image-desc\" data-placeholder=\"Click to enter image description (up to 90 characters)\"\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\u003cp\u003eDear Traveler,\u003c/p\u003e\u003cp\u003eBelow are the details of the Version 5.0 update \"Flowers Resplendent on the Sun-Scorched Sojourn\" and the update compensation.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e〓Compensation Details〓\u003c/p\u003e\u003cp\u003eMaintenance Compensation: Primogems ×300 (60 Primogems for every hour the servers are down.)\u003c/p\u003e\u003cp\u003eIssue Fix Compensation: Primogems ×300 (Please refer to the relevant compensation mail for more details)\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e〓Scope of Compensation〓\u003c/p\u003e\u003cp\u003eMaintenance Compensation: Travelers who have reached Adventure Rank 5 or above by 2024/08/28 06:00 (UTC+8).\u003c/p\u003e\u003cp\u003eCompensation must be claimed before the end of Version 5.0.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003eIssue Fix Compensation: Travelers who have reached Adventure Rank 5 or above by 2024/08/28 06:00 (UTC+8).\u003c/p\u003e\u003cp\u003ePlease log in and claim your compensation before 2024/08/31 06:00 (UTC+8).\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003eOur developers will distribute compensation to Travelers via in-game mail within 5 hours after the update maintenance is finished. The mail will expire after 30 days, so don't forget to claim the attached compensation in time.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e〓Update Schedule〓\u003c/p\u003e\u003cp\u003eUpdate maintenance begins 2024/08/28 06:00 (UTC+8) and is estimated to take 5 hours.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e〓How to Update Game Client〓\u003c/p\u003e\u003cp\u003ePC: Close the game, open the Genshin Impact Launcher, and click Update.\u003c/p\u003e\u003cp\u003eiOS: Open the App Store and tap Update.\u003c/p\u003e\u003cp\u003eAndroid: Open the game and follow the directions on-screen.\u003c/p\u003e\u003cp\u003ePS5™ and PS4™: Highlight Genshin Impact from the Home Screen, press the OPTIONS button and select \"Check for Update.\"\u003c/p\u003e\u003cp\u003ePlease do not hesitate to contact Customer Service if you encounter any issues installing the new version. We will do our very best to resolve the issue.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e〓Update Details〓\u003c/p\u003e\u003cp\u003eI. New Region\u003c/p\u003e\u003cp\u003eNew Region - Natlan\u003c/p\u003e\u003cp\u003eThe warriors of the mountains lead the path unto flowers splendorous, and the swimming Saurians of the springs bring news all night. On the far shore from sand and sea, the blazing epic hymn echoes through the land where the Sacred Flame blazes eternal.\u003c/p\u003e\u003cp\u003eBeyond the fiery altars and the mysterious realm of night, an unprecedented adventure is about to unfold in the land where humans and Saurians dwell together.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e◇ New Areas: In Version 5.0, the following areas in Natlan will become available: Tequemecan Valley, Coatepec Mountain, Toyac Springs, and Basin of Unnumbered Flames.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e※ Completing Archon Quest Prologue: Act III \"Song of the Dragon and Freedom\" will automatically unlock a Teleport Waypoint to the right of Tequemecan Valley in Natlan (If you have already completed this Archon Quest, the Teleport Waypoint will be unlocked after the update). You can use this Teleport Waypoint to head over to Natlan. You'll also receive the Primogem reward for this Teleport Waypoint when it unlocks automatically.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e▌New Mechanic in Natlan\u003c/p\u003e\u003cp\u003e\"Saurian Indwelling\"\u003c/p\u003e\u003cp\u003eNatlan's Saurians are unique life forms that can enter a \"Spiritsconce\" state under specific circumstances.\u003c/p\u003e\u003cp\u003eIndwell your spirit onto Spiritsconces to activate their power, transforming into and controlling the Saurian's original form.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e▌New System in Natlan\u003c/p\u003e\u003cp\u003e\"Tona's Flame\"\u003c/p\u003e\u003cp\u003eYou can obtain Pyro Sigils during your adventures in Natlan. Offer them up to the Tablet of Tona at the Temple of Pax to increase its level and obtain valuable rewards.\u003c/p\u003e\u003cp\u003eSatisfy any one of the criteria below to unlock \"Tona's Flame\":\u003c/p\u003e\u003cp\u003e• Enter within a certain radius of the Tablet of Tona\u003c/p\u003e\u003cp\u003e• Complete Archon Quest Chapter V: Act I \"Flowers Resplendent on the Sun-Scorched Sojourn\"\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003eReputation System in Natlan\u003c/p\u003e\u003cp\u003e◇ Natlan Reputation Unlock Criteria:\u003c/p\u003e\u003cp\u003e• Complete \"Pilgrimage of the Return of the Sacred Flame\" in Archon Quest Chapter V: Act I \"Flowers Resplendent on the Sun-Scorched Sojourn\"\u003c/p\u003e\u003cp\u003eEach tribe in Natlan has its own Reputation System. Visit each tribe's \"Obsidian Totem Pole\" to undertake the quests and earn Reputation EXP. Upon increasing Reputation Levels, you can claim corresponding rewards. Once a tribe's Reputation Level is maxed out, you can also receive additional rewards from the \"Speaker's Chamber.\"\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003eExpeditions, Daily Commissions, and other new content will also be added in Natlan. In Natlan's new commissions, if related achievements of a Commission Quest are not unlocked yet, the probability of that Commission Quest appearing will increase.\u003c/p\u003e\u003cp\u003e◇ Natlan Daily Commissions Unlock Criteria:\u003c/p\u003e\u003cp\u003e• Complete Archon Quest Chapter V: Act I \"Flowers Resplendent on the Sun-Scorched Sojourn\"\u003c/p\u003e\u003cp\u003e• Complete the World Quest \"Toward Red-Hot Adventure!\"\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003eIn addition, there will be new \"Radiant Spincrystals\" in Natlan.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003eII. New Characters\u003c/p\u003e\u003cp\u003e5-Star Character \"Splish-Splash Wavechaser\" Mualani (Hydro)\u003c/p\u003e\u003cp\u003e◇ Vision: Hydro\u003c/p\u003e\u003cp\u003e◇ Weapon: Catalyst\u003c/p\u003e\u003cp\u003e◇ A well-known guide in Natlan who owns a watersports shop, and expert in all forms of wave-chasing.\u003c/p\u003e\u003cp\u003e◆ Elemental Skill: Surfshark Wavebreaker\u003c/p\u003e\u003cp\u003e◆ Mualani enters a surfing stance, and can move on land, water and liquid Phlogiston swiftly. While in this state, Mualani applies \"Marked as Prey\" to opponents upon coming into contact with them and gains Wave Momentum. In this state, Mualani's Normal Attacks will be converted to Sharky's Bites, and consumes Wave Momentum to increase the DMG dealt by Sharky's Bites. When she has 3 stacks of Wave Momentum, when Sharky's Bite hits an opponent, she will fire Shark Missiles at nearby opponents Marked as Prey.\u003c/p\u003e\u003cp\u003e◆ Elemental Burst: Boomsharka-laka\u003c/p\u003e\u003cp\u003e◆ Fires a Super Shark Missile that can deal AoE Hydro DMG.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e5-Star Character \"Turnfire Hunt\" Kinich (Dendro)\u003c/p\u003e\u003cp\u003e◇ Vision: Dendro\u003c/p\u003e\u003cp\u003e◇ Weapon: Claymore\u003c/p\u003e\u003cp\u003e◇ A Huitztlan Saurian Hunter skilled at counting costs.\u003c/p\u003e\u003cp\u003e◆ Elemental Skill: Canopy Hunter: Riding High\u003c/p\u003e\u003cp\u003e◆ Kinich can swing in mid-air using a grappling hook. When the grappling hook hits an enemy, it attaches to enemies and Kinich will fire Loop Shots. When Nightsoul points are at max, he can use the Elemental Skill to fire a powerful \"Scalespiker Cannon\" and deal Dendro DMG to enemies.\u003c/p\u003e\u003cp\u003e◆ Elemental Burst: Hail to the Almighty Dragonlord\u003c/p\u003e\u003cp\u003e◆ Unleashes the power of the Almighty Dragonlord, K'uhul Ajaw. Ajaw will unleash his Dragon Breath at intervals, dealing AoE Dendro DMG.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e4-Star Character \"Mottled Gold Yet Unsmelted\" Kachina (Geo)\u003c/p\u003e\u003cp\u003e◇ Vision: Geo\u003c/p\u003e\u003cp\u003e◇ Weapon: Polearm\u003c/p\u003e\u003cp\u003e◇ A young warrior of the Nanatzcayan, given the Ancient Name of \"Uthabiti.\" Kind-hearted and insatiably persistent, she grows stronger and more capable with each setback she faces.\u003c/p\u003e\u003cp\u003e◆ Elemental Skill: Go, Go Turbo Twirly!\u003c/p\u003e\u003cp\u003e◆ Fight alongside Turbo Twirly. Kachina can ride Turbo Twirly to move swiftly, climb, and slam enemies, and also summon it independently to deal continuous DMG.\u003c/p\u003e\u003cp\u003e◆ Elemental Burst: Time to Get Serious!\u003c/p\u003e\u003cp\u003e◆ Creates a Turbo Drill Field that increases Turbo Twirly's attack AoE and its Movement SPD when Kachina is riding it.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003eIII. New Domain\u003c/p\u003e\u003cp\u003eDomain of Forgery: Ancient Watchtower\u003c/p\u003e\u003cp\u003e◇ Legend has it that in ancient times, the colossal beasts that roamed the land had a civilization of their own. After exploring the entirety of the land and surrounding sea, they built these structures in an attempt to cast their gaze upon the even wider world beyond. But these wise beasts have long since vanished, and in the present, no one now knows the true purpose of this place.\u003c/p\u003e\u003cp\u003e◇ Unlock Criteria (satisfy any one of the criteria below to unlock):\u003c/p\u003e\u003cp\u003e• Adventure Rank 10 or above\u003c/p\u003e\u003cp\u003e• Complete \"Knights of Favonius\" in Archon Quest Prologue: Act I \"The Outlander Who Caught the Wind\"\u003c/p\u003e\u003cp\u003e◆ Challenge the Domain to obtain Weapon Ascension Materials.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003eDomain of Mastery: Blazing Ruins\u003c/p\u003e\u003cp\u003e◇ In that era, when people had yet to attain true mastery of the flames, there were sages in all corners of the world who pondered the fire and sought to fathom its mysteries. It is said that these ruins are all that is left of what was once a ring-shaped ceremonial site. Here, these sages attempted to perfect the rituals required to transform phlogiston. Among the heroes who later followed the mighty one into the belly of the volcano, there were several who once trained in this place.\u003c/p\u003e\u003cp\u003e◇ Unlock Criteria (satisfy any one of the criteria below to unlock):\u003c/p\u003e\u003cp\u003e• Adventure Rank 10 or above\u003c/p\u003e\u003cp\u003e• Complete \"Knights of Favonius\" in Archon Quest Prologue: Act I \"The Outlander Who Caught the Wind\"\u003c/p\u003e\u003cp\u003e◆ Challenge the Domain to obtain Character Talent Materials.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003eDomain of Blessing: Sanctum of Rainbow Spirits\u003c/p\u003e\u003cp\u003e◇ It is said that the first sage to learn how to use phlogiston created a place of great purity, and that within this place, warriors were taught to wield the power of prismatic flames and flowing light. Later, even before they were used to resist common enemies, these powers were employed as weapons in conflicts between the tribes. Disheartened by this state of affairs, the Sage of the Stolen Flame withdrew from the world, vanishing from the pages of many tales. Devoid of their original purpose, these empty trial grounds were left behind, along with all those stories that came to be forgotten...\u003c/p\u003e\u003cp\u003e◇ Unlock Criteria (satisfy any one of the criteria below to unlock):\u003c/p\u003e\u003cp\u003e• Adventure Rank 10 or above\u003c/p\u003e\u003cp\u003e• Complete \"Knights of Favonius\" in Archon Quest Prologue: Act I \"The Outlander Who Caught the Wind\"\u003c/p\u003e\u003cp\u003e◆ Challenge the Domain to obtain Artifacts in the \"Scroll of the Hero of Cinder City\" and \"Obsidian Codex\" sets.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003eIV. New Equipment\u003c/p\u003e\u003cp\u003e1. New Weapons (Examples based on Refinement Rank 1)\u003c/p\u003e\u003cp\u003eSurf's Up (5-Star Catalyst)\u003c/p\u003e\u003cp\u003eMax HP increased by 20%. Once every 15s, for the 14s after using an Elemental Skill: Gain 4 Scorching Summer stacks. Each stack increases Normal Attack DMG by 12%. For the duration of the effect, once every 1.5s, lose 1 stack after a Normal Attack hits an opponent; once every 1.5s, gain 1 stack after triggering a Vaporize reaction on an opponent. Max 4 Scorching Summer stacks.\u003c/p\u003e\u003cp\u003e◆ During the event wish \"Epitome Invocation,\" the event-exclusive 5-star weapon Surf's Up (Catalyst) will receive a huge drop-rate boost!\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003eFang of the Mountain King (5-Star Claymore)\u003c/p\u003e\u003cp\u003eGain 1 stack of Canopy's Favor after hitting an opponent with an Elemental Skill. This can be triggered once every 0.5s. After a nearby party member triggers a Burning or Burgeon reaction, the equipping character will gain 3 stacks. This effect can be triggered once every 2s and can be triggered even when the triggering party member is off-field. Canopy's Favor: Elemental Skill and Burst DMG is increased by 10% for 6s. Max 6 stacks. Each stack is counted independently.\u003c/p\u003e\u003cp\u003e◆ During the event wish \"Epitome Invocation,\" the event-exclusive 5-star weapon Fang of the Mountain King (Claymore) will receive a huge drop-rate boost!\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003eAsh-Graven Drinking Horn (4-Star Catalyst)\u003c/p\u003e\u003cp\u003eWhen an attack hits an opponent, deal AoE DMG equal to 40% of Max HP at the target location. This effect can be triggered once every 15s.\u003c/p\u003e\u003cp\u003e◆ Ash-Graven Drinking Horn (Catalyst) and its refinement materials can be redeemed in the \"Traces of Artistry\" event.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e▌Forgeable Weapons\u003c/p\u003e\u003cp\u003eFlute of Ezpitzal (4-Star Sword)\u003c/p\u003e\u003cp\u003eUsing an Elemental Skill increases DEF by 16% for 15s.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003eEarth Shaker (4-Star Claymore)\u003c/p\u003e\u003cp\u003eAfter a party member triggers a Pyro-related reaction, the equipping character's Elemental Skill DMG is increased by 16% for 8s. This effect can be triggered even when the triggering party member is not on the field.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003eFootprint of the Rainbow (4-Star Polearm)\u003c/p\u003e\u003cp\u003eUsing an Elemental Skill increases DEF by 16% for 15s.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003eRing of Yaxche (4-Star Catalyst)\u003c/p\u003e\u003cp\u003eUsing an Elemental Skill grants the Jade-Forged Crown effect: Every 1,000 Max HP will increase the Normal Attack DMG dealt by the equipping character by 0.6% for 10s. Normal Attack DMG can be increased this way by a maximum of 16%.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003eChain Breaker (4-Star Bow)\u003c/p\u003e\u003cp\u003eFor every party member from Natlan or who has a different Elemental Type from the equipping character, the equipping character gains 4.8% increased ATK. When there are no less than 3 of the aforementioned characters, the equipping character gains 24 Elemental Mastery.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e◆ You can exchange for Weapon Forging Blueprints from Alom in the Stadium of the Sacred Flame: Temple of Pax by consuming certain amounts and types of materials.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e2. New Artifacts\u003c/p\u003e\u003cp\u003eScroll of the Hero of Cinder City (4–5 Stars)\u003c/p\u003e\u003cp\u003e◇ 2-Piece Set: When a nearby party member triggers a \"Nightsoul Burst,\" the equipping character regenerates 6 Energy.\u003c/p\u003e\u003cp\u003e◇ 4-Piece Set: After the equipping character triggers a reaction related to their Elemental Type, all nearby party members gain a 12% Elemental DMG Bonus for the Elemental Types involved in the elemental reaction for 15s. If the equipping character is in the Nightsoul's Blessing state when triggering this effect, all nearby party members gain an additional 28% Elemental DMG Bonus for the Elemental Types involved in the elemental reaction for 20s. The equipping character can trigger this effect while off-field, and the DMG bonus from Artifact Sets with the same name do not stack.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003eObsidian Codex (4–5 Stars)\u003c/p\u003e\u003cp\u003e◇ 2-Piece Set: While the equipping character is in Nightsoul's Blessing and is on the field, their DMG dealt is increased by 15%.\u003c/p\u003e\u003cp\u003e◇ 4-Piece Set: After the equipping character consumes 1 Nightsoul point while on the field, CRIT Rate increases by 40% for 6s. This effect can trigger once every second.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003eV. New Main Story\u003c/p\u003e\u003cp\u003e1. New Archon Quests\u003c/p\u003e\u003cp\u003eArchon Quest Chapter V: Act I \"Flowers Resplendent on the Sun-Scorched Sojourn\"\u003c/p\u003e\u003cp\u003ePermanently available after the Version 5.0 update\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e◆ Quest Unlock Criteria:\u003c/p\u003e\u003cp\u003e• Adventure Rank 40 or above\u003c/p\u003e\u003cp\u003e• Complete Archon Quest Chapter IV: Act VI \"Bedtime Story\"\u003c/p\u003e\u003cp\u003e• The \"Focused Experience Mode\" function is available for this quest.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003eAdds the \"Quick Start\" function:\u003c/p\u003e\u003cp\u003e(1) Once unlocked, you can maintain your current Archon Quest progress, while accepting and progressing through Archon Quest Chapter V: Act I \"Flowers Resplendent on the Sun-Scorched Sojourn.\" This function will be available until the Version 6.0 update.\u003c/p\u003e\u003cp\u003e(2) Unlock Criteria: Reach Adventure Rank 28 or above, and complete Archon Quest Chapter I: Act III \"A New Star Approaches.\"\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003eArchon Quest Chapter V: Act II \"Black Stone Under a White Stone\"\u003c/p\u003e\u003cp\u003ePermanently available after the Version 5.0 update\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e◆ Quest Unlock Criteria:\u003c/p\u003e\u003cp\u003e• Adventure Rank 40 or above\u003c/p\u003e\u003cp\u003e• Complete Archon Quest Chapter V: Act I \"Flowers Resplendent on the Sun-Scorched Sojourn\"\u003c/p\u003e\u003cp\u003e• The \"Focused Experience Mode\" function is available for this quest.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e2. New Tribal Chronicles\u003c/p\u003e\u003cp\u003e\"Where the Springs Return\"\u003c/p\u003e\u003cp\u003eAct I – Act III of \"Where the Springs Return\" will be permanently available after the Version 5.0 update\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e◆ Act I and Act II Quest Unlock Criteria:\u003c/p\u003e\u003cp\u003e• Adventure Rank 40 or above\u003c/p\u003e\u003cp\u003e• Complete \"Pilgrimage of the Return of the Sacred Flame\" in Archon Quest Chapter V: Act I \"Flowers Resplendent on the Sun-Scorched Sojourn\"\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e◆ Act III Quest Unlock Criteria:\u003c/p\u003e\u003cp\u003e• Adventure Rank 40 or above\u003c/p\u003e\u003cp\u003e• Complete \"Into Eternal Night\" in Archon Quest Chapter V: Act II \"Black Stone Under a White Stone\"\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003eThe three acts must be experienced in sequence. You can only unlock the next act after completing the previous one and meeting the corresponding unlock criteria.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e\"Yupanqui's Turnfire\"\u003c/p\u003e\u003cp\u003eAct I and Act II of \"Yupanqui's Turnfire\" will be permanently available after the Version 5.0 update\u003c/p\u003e\u003cp\u003eAct III of \"Yupanqui's Turnfire\" will be permanently available after 2024/09/17 18:00\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e◆ Act I – Act III Quest Unlock Criteria:\u003c/p\u003e\u003cp\u003e• Adventure Rank 40 or above\u003c/p\u003e\u003cp\u003e• Complete \"Pilgrimage of the Return of the Sacred Flame\" in Archon Quest Chapter V: Act I \"Flowers Resplendent on the Sun-Scorched Sojourn\"\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003eThe three acts must be experienced in sequence. You can only unlock the next act after completing the previous one and meeting the corresponding unlock criteria.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e\"A Prayer for Blessings, Told to Crested Peaks\"\u003c/p\u003e\u003cp\u003eAct I and Act II of \"A Prayer for Blessings, Told to Crested Peaks\" will be permanently available after the Version 5.0 update\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e◆ Act I and Act II Quest Unlock Criteria:\u003c/p\u003e\u003cp\u003e• Adventure Rank 40 or above\u003c/p\u003e\u003cp\u003e• Complete \"Pilgrimage of the Return of the Sacred Flame\" in Archon Quest Chapter V: Act I \"Flowers Resplendent on the Sun-Scorched Sojourn\"\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003eThe two acts must be experienced in sequence. You can only unlock the next act after completing the previous one and meeting the corresponding unlock criteria.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003eIf you use the \"Quick Start\" function to experience Archon Quest Chapter V: Act I \"Flowers Resplendent on the Sun-Scorched Sojourn,\" you can accept the Tribal Chronicles once you meet the criteria for completing the corresponding Archon Quest (you are not restricted by the Adventure Rank 40 or above requirement).\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e3. New World Quests\u003c/p\u003e\u003cp\u003eNew World Quests\u003c/p\u003e\u003cp\u003e\"In the Footsteps of the Chosen of Dragons\" Quest Chain, \"Shadows of the Mountains\" Quest Chain, \"Tale of Dreams Plucked From Fire\" Quest Chain, \"Between Pledge and Forgettance\" Quest Chain, \"To the Night, What is the Night's,\" \"Ripe For Trouble,\" \"To Wish Upon a Star,\" \"Stride on Rainbows, Split the Waves,\" \"The Case of the Crafting Bench,\" \"The Call of Mystical Martial Arts,\" etc.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003eVI. New Enemies\u003c/p\u003e\u003cp\u003eGoldflame Qucusaur Tyrant\u003c/p\u003e\u003cp\u003e◇ A Qucusaurus whose extraordinary form is a result of being unable to withstand the great power it has been granted.\u003c/p\u003e\u003cp\u003eIt will fly into the air during combat and enter the \"Golden Flame\" energy-gathering form, creating a shield around itself and launching a Flamewind Feather towards the ground that summons a flamewind. If you cannot destroy the Flamewind Feather before the Qucusaurus dives down into it, the creature will use a Phlogiston Current to return to the skies. This will persist until it is exhausted and returns to its original form.\u003c/p\u003e\u003cp\u003eLocated at Basin of Unnumbered Flames\u003c/p\u003e\u003cp\u003eGluttonous Yumkasaur Mountain King\u003c/p\u003e\u003cp\u003e◇ A powerful Yumkasaurus that has experienced numerous impressive battles.\u003c/p\u003e\u003cp\u003eIt will collect Flamegranates during combat and spit them out as bombs. However, if you can use Pyro to ignite the Flamegranates before the Gluttonous Yumkasaur Mountain King can swallow them, who knows what might happen...\u003c/p\u003e\u003cp\u003eLocated at Tequemecan Valley\u003c/p\u003e\u003cp\u003eWayob Manifestation\u003c/p\u003e\u003cp\u003e\"Rock-Cavernous Wayob Manifestation,\" \"Flow-Inverted Wayob Manifestation,\" and \"Foliar-Swift Wayob Manifestation\"\u003c/p\u003e\u003cp\u003e◇ The Wayob worshipped by the various tribes of Natlan manifest themselves in the form of these obsidian totems.\u003c/p\u003e\u003cp\u003eIn battle, the Wayob Manifestation will deploy its Arena: Moment of Trial, creating a shield for itself and absorbing the Elemental Energy of all characters in the Arena. Characters in the Arena deal greatly increased DMG. If the shield is broken before the Arena expires, they will also regain a large amount of Energy. However, if they fail to break the shield, the Manifestation will generate a barrier based on the value of the remaining Elemental Shield.\u003c/p\u003e\u003cp\u003eSecret Source Automaton: Hunter-Seeker\u003c/p\u003e\u003cp\u003e\"Secret Source Automaton: Hunter-Seeker\"\u003c/p\u003e\u003cp\u003e◇ An ancient mechanical creation that wanders Natlan to this day, though its function is not known.\u003c/p\u003e\u003cp\u003eWhen characters enter and maintain the Nightsoul's Blessing state, the Secret Source Automaton: Hunter-Seeker will start progressing through its Adaptive Countermeasures. Once those are complete, the Hunter-Seeker will unleash its special cluster laser. Still, risk and opportunity go hand-in-hand, so perhaps you might take this opportunity to deal immense damage to it...\u003c/p\u003e\u003cp\u003eAvatars of Lava\u003c/p\u003e\u003cp\u003e\"Fluid Avatar of Lava\" and \"Eroding Avatar of Lava\"\u003c/p\u003e\u003cp\u003e◇ A strange monster that must continually absorb heat to stay in an active state.\u003c/p\u003e\u003cp\u003eHowever, it seems to damage itself should it absorb too much. After you use Pyro attacks to cause it to fully enter an Overburn state, it will rapidly disintegrate.\u003c/p\u003e\u003cp\u003eNatlan Saurians\u003c/p\u003e\u003cp\u003e\"Koholasaurus,\" \"Tepetlisaurus,\" \"Yumkasaurus,\" \"Koholasaur Whelp,\" \"Tepetlisaur Whelp,\" and \"Yumkasaur Whelp.\"\u003c/p\u003e\u003cp\u003e◇ The Saurians that inhabit the land of Natlan.\u003c/p\u003e\u003cp\u003eSpecial dragons that were better able to adapt to their environments, taking on different shapes and forms based on their surroundings.\u003c/p\u003e\u003cp\u003eSauroform Tribal Warriors\u003c/p\u003e\u003cp\u003e\"Flowing Blade Skirmisher,\" \"Flowing Blade Grease-Saw,\" \"Flowing Blade Harpoon-Thrower,\" \"Koholasaurus Warrior: Waveshuttler,\" \"Koholasaurus Warrior: Reefsplitter,\" \"Forged Sand Interrogator,\" \"Forged Sand Shieldbreaker,\" \"Forged Sand Javelineer,\" \"Tepetlisaurus Warrior: Shard Striker,\" \"Tepetlisaurus Warrior: Rockbreaker Blade,\" \"Swiftstep Seeker,\" \"Swiftstep Storm Scout,\" \"Swiftstep Armed Courier,\" \"Yumkasaurus Warrior: Whirling Leaves,\" and \"Yumkasaurus Warrior: Flowing Skyfire\"\u003c/p\u003e\u003cp\u003e◇ The warriors of Natlan's great tribes who fight for the honor and glory of their people.\u003c/p\u003e\u003cp\u003eOver long years of living and fighting alongside their Saurian companions, these tribal warriors have gradually acquired their traits and learned how to apply them on the field of battle.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003eVII. Other Update Details\u003c/p\u003e\u003cp\u003eNew Recipes:\u003c/p\u003e\u003cp\u003e○ Monstadt \"Good Hunter\": Meatnado and Apple Roly Poly\u003c/p\u003e\u003cp\u003e○ Cipac (NPC): Grainfruit Chips and Grilled Fish in Mint Sauce\u003c/p\u003e\u003cp\u003e○ Chanca (NPC): Grainfruit Meat Soup and Cup O' Grainfruit\u003c/p\u003e\u003cp\u003e○ Obtained from talking to Chanca (NPC): Tatacos\u003c/p\u003e\u003cp\u003e○ Exploration Rewards: Saurus Crackers, Stuffed N' Mashed Potatoes, Chocolate, Blazed Meat Stew, and Fried Shrimp Beanballs\u003c/p\u003e\u003cp\u003e○ World Quest Rewards: Sour Sauce Kipper and Forest of Color\u003c/p\u003e\u003cp\u003e○ Natlan Reputation System Rewards: Glittering Gemstones, Hot Spring O'Clock, and Puff Pops\u003c/p\u003e\u003cp\u003e○ Event Reward: Delights of Wondrous Wonderings\u003c/p\u003e\u003cp\u003eNew Character Specialty Dishes:\u003c/p\u003e\u003cp\u003e○ Mualani's specialty: Pass the Luck\u003c/p\u003e\u003cp\u003e○ Kinich's specialty: Saurian Hunter's Reward\u003c/p\u003e\u003cp\u003e○ Kachina's specialty: Impeccably Organized\u003c/p\u003e\u003cp\u003eAdds new \"Meetings in Outrealm: Series V,\" \"Imaginarium Theater: The Second Folio,\" \"Natlan: The Land of Fire and Competition (I),\" and \"Duelist: Series I\" Achievement categories, and adds new Achievements to the \"Wonders of the World\" category.\u003c/p\u003e\u003cp\u003eAdds Set 34 of \"Paimon's Paintings\" chat emojis.\u003c/p\u003e\u003cp\u003eAdds some prompts for loading screens.\u003c/p\u003e\u003cp\u003eNew Namecards:\u003c/p\u003e\u003cp\u003e\"Mualani: Sharky\": Reward for reaching Friendship Lv. 10 with Mualani\u003c/p\u003e\u003cp\u003e\"Kinich: Ajaw\": Reward for reaching Friendship Lv. 10 with Kinich\u003c/p\u003e\u003cp\u003e\"Kachina: Twirly\": Reward for reaching Friendship Lv. 10 with Kachina\u003c/p\u003e\u003cp\u003e\"Natlan: Divine Army\": Reward for reaching the highest Reputation Level with 1 tribe\u003c/p\u003e\u003cp\u003e\"Natlan: Fiery Dragon\": Reward for reaching the highest Reputation Level with 4 tribes\u003c/p\u003e\u003cp\u003e\"Achievement: Endpoint\": Reward for completing all achievements under \"Meetings in Outrealm: Series V\"\u003c/p\u003e\u003cp\u003e\"Achievement: Feline Fortune\": Reward for completing all achievements under \"Imaginarium Theater: The Second Folio\"\u003c/p\u003e\u003cp\u003e\"Natlan: Return of the Flame\": Reward for completing all achievements under \"Natlan: The Land of Fire and Competition (I)\"\u003c/p\u003e\u003cp\u003e\"Achievement: Lord of the Night\": Reward for completing all achievements under \"Duelist: Series I\"\u003c/p\u003e\u003cp\u003e\"Travel Notes: Primal Fire\": Reward obtained via the BP system\u003c/p\u003e\u003cp\u003eAdds new Character Event Wish mechanic \"Capturing Radiance.\" For more information, please visit the \"Wish\" interface in the game.\u003c/p\u003e\u003cp\u003eReduces the maximum amount of Fate Points required from 2 to 1 in the Weapon Event Wish \"Epitomized Path.\"\u003c/p\u003e\u003cp\u003eAdds new Artifact Salvage function. Artifacts that have not been enhanced and leveled up can be salvaged into Sanctifying Unction and Sanctifying Essence in Inventory \u0026gt; Artifacts.\u003c/p\u003e\u003cp\u003eAdds some new adjustments to the Artifacts system:\u003c/p\u003e\u003cp\u003e(1) Adds the gadget \"Artifact Transmuter,\" which can be obtained by completing the quests in \"Adventurer Handbook \u0026gt; Experience\" and can be used to extract and redeem Artifacts.\u003c/p\u003e\u003cp\u003e(2) Adds new Consumable \"Sanctifying Elixir\": Use the \"Artifact Transmuter\" to extract a certain number of 5-star Artifacts that have been enhanced to \"+4\" or above, and convert them into \"Sanctifying Elixir\" (You can convert Artifacts into 1 \"Sanctifying Elixir\" per version). You can also obtain \"Sanctifying Elixir\" by exploring the open world.\u003c/p\u003e\u003cp\u003e(3) You can exchange for certain components of certain Artifact sets by using the \"Sanctifying Elixir\" in the \"Artifact Transmuter.\" Apart from that, you can also determine the Main Affix and two Minor Affixes (Different Artifact components require different amounts of \"Sanctifying Elixir.\" The same set of Artifacts can only be exchanged once in each version).\u003c/p\u003e\u003cp\u003eAdds new event \"Turbo Twirly!\": Progress through Archon Quest Chapter V: Act I \"Flowers Resplendent on the Sun-Scorched Sojourn\" and invite the character \"Mottled Gold Yet Unsmelted\" Kachina (Geo).\u003c/p\u003e\u003cp\u003eAdds World Level 9. Upon reaching Adventure Rank 58, Travelers can complete corresponding World Level Ascension Quests to increase their World Level. After the World Level increases, the levels of monsters and bosses will increase, the challenge difficulty and the rewards dropped will also be increased (Travelers who have reached Adventure Rank 58 before the version update can complete Ascension Quests to increase their World Level after the version update).\u003c/p\u003e\u003cp\u003eAdds the Borderland Billet series.\u003c/p\u003e\u003cp\u003eAdds Borderland Billet Conversion for various Weapon types in \"Crafting Bench \u0026gt; Conversion\": Use Dream Solvent to convert Billets of other types to Borderland Billets for the same Weapon type, or change Borderland Billets to Billets of other types for the same Weapon type.\u003c/p\u003e\u003cp\u003eAdds another 8 sets of Artifacts available to exchange in the Mystic Offering system: Artifact Strongbox: Deepwood Memories, Artifact Strongbox: Gilded Dreams, Artifact Strongbox: Desert Pavilion Chronicle, Artifact Strongbox: Flower of Paradise Lost, Artifact Strongbox: Nymph's Dream, Artifact Strongbox: Vourukasha's Glow, Artifact Strongbox: Marechaussee Hunter, and Artifact Strongbox: Golden Troupe.\u003c/p\u003e\u003cp\u003eAdds new Gadgets: Firstborn Firesprite and Kaboom Box.\u003c/p\u003e\u003cp\u003eAdds new Natlan Reward Gadgets: Pyroculus Resonance Stone and Pyro Treasure Compass.\u003c/p\u003e\u003cp\u003eAdds some of the Harvestable seeds from Natlan to the Seed Dispensary.\u003c/p\u003e\u003cp\u003eAdds new Wildlife: Red Flamingo, Halberd-Crest Bird, Thick-Feathered Ruffed Pheasant, Flowcurrent Bird, Alpaca, Brown Deer, Flying Squirrel, Capybara, Pyro Crystalfly, Blue Mountain Spoonbill, Flowfire Bird, Phlogiston Aphid, Crystal Beetle, and Long-Necked Rhino. You can use the Omni-Ubiquity Net to capture certain Natlan creatures.\u003c/p\u003e\u003cp\u003e\"Genius Invokation TCG\" Gameplay Update:\u003c/p\u003e\u003cp\u003eNew Character Cards: Xianyun, Freminet, and their corresponding Talent cards. Corresponding invitation duels and guest challenges have been added to the Player List.\u003c/p\u003e\u003cp\u003eNew Character Card: Hydro Hilichurl Rogue and the corresponding Talent card. The Tavern Challenge has also been added.\u003c/p\u003e\u003cp\u003eNew Action Cards: \"Xenochromatic Hunter's Ray,\" \"Yumkasaurus,\" \"Koholasaurus,\" \"Stadium of the Sacred Flame,\" \"Atea,\" \"Edict of Absolution,\" and \"Saurian Dining Buddies\" can be purchased from Prince at The Cat's Tail.\u003c/p\u003e\u003cp\u003eThe Forge Realm's Temper is once again available. The theme of this edition is \"The Forge Realm's Temper: Game of Wits\":\u003c/p\u003e\u003cp\u003e(1) During The Forge Realm's Temper: Game of Wits, some stages will have special victory and defeat conditions. Adeptly adapt your tactics to complete the challenge and avoid the conditions for defeat!\u003c/p\u003e\u003cp\u003e(2) Within The Forge Realm's Temper: Game of Wits event stages, there will also be special rules that can easily exert influence on the tempo of the match. Fully utilizing these special rules will contribute greatly to your success.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003eImaginarium Theater\u003c/p\u003e\u003cp\u003eAfter the Version 5.0 update, the two Imaginarium Theater seasons will be as follows:\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003eThe first season of \"Imaginarium Theater\" will be available on 2024/09/01 04:00.\u003c/p\u003e\u003cp\u003eRequired Elemental Types: Pyro, Hydro, and Dendro\u003c/p\u003e\u003cp\u003eOpening Characters: Dehya, Xiangling, Mualani, Candace, Emilie, and Yaoyao\u003c/p\u003e\u003cp\u003eWhen Imaginarium Theater is open, the corresponding Opening Characters will obtain Fantastical Blessings.\u003c/p\u003e\u003cp\u003eSpecial Guest Stars: Kaedehara Kazuha, Kachina, Clorinde, and Raiden Shogun\u003c/p\u003e\u003cp\u003eAfter the first season of Imaginarium Theater begins, the characters Collei, Cyno, Neuvillette, and Amber will each gain a new \"Thespian Trick\" that can be exchanged from the NPC Wolfy.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003eThe second season of \"Imaginarium Theater\" will be available on 2024/10/01 04:00.\u003c/p\u003e\u003cp\u003eRequired Elemental Types: Pyro, Electro, and Geo\u003c/p\u003e\u003cp\u003eOpening Characters: Dehya, Chevreuse, Keqing, Fischl, Chiori, and Ningguang\u003c/p\u003e\u003cp\u003eWhen Imaginarium Theater is open, the corresponding Opening Characters will obtain Fantastical Blessings.\u003c/p\u003e\u003cp\u003eSpecial Guest Stars: Kinich, Yelan, Venti, and Sucrose\u003c/p\u003e\u003cp\u003eAfter the second season of Imaginarium Theater begins, the characters Venti, Thoma, Mika, and Navia will each gain a new \"Thespian Trick\" that can be exchanged from the NPC Wolfy.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003eAfter the first season of Imaginarium Theater begins, the following adjustments will be made:\u003c/p\u003e\u003cp\u003e(1) In the new gameplay phase, Wondrous Boons will be updated to \"Brilliant Blessings\" focused on the current season's three-element reactions. You can continuously upgrade the Blessing level to enhance the effects of the corresponding Elemental Reactions. Based on the new Brilliant Blessings, the refresh mechanic of Performance Events has also been adjusted.\u003c/p\u003e\u003cp\u003e(2) Reduces the number of characters required for each difficulty level, and additional characters included can receive buffs:\u003c/p\u003e\u003cp\u003ea. The number of characters required for Easy mode has been reduced to 8, and you can include an additional 2 characters.\u003c/p\u003e\u003cp\u003eb. The number of characters required for Normal mode has been reduced to 12, and you can include an additional 2 characters.\u003c/p\u003e\u003cp\u003ec. The number of characters required for Hard mode has been reduced to 16, and you can include an additional 4 characters.\u003c/p\u003e\u003cp\u003eEach extra Alternate Cast included will receive additional Fantasia Flowers and increase the Blessing Level (the Blessing Level provides attribute buffs to characters) when the performance begins. Making full use of the special rules can help you better complete the challenge.\u003c/p\u003e\u003cp\u003e(3) Visionary Mode is now available, which can be unlocked after clearing Hard Mode previously. The required number of characters for participation is 22 and 4 additional characters can be added. Both the Debut Performance Gift and Performance Tour Rewards will be increased to 10 acts. Additionally, by completing 10 acts of combat performances in each season of \"Imaginarium Theater,\" you can receive 1 Key of Echoes in the \"Envisaged Echoes\" gameplay.\u003c/p\u003e\u003cp\u003e(4) The number of \"Fantasia Flowers\" obtained from completing \"Battle: Normal\" and \"Battle: Defense Sequence\" in performances has been increased to 90, and the additional challenges in \"Combat Events\" have been removed.\u003c/p\u003e\u003cp\u003e(5) The usage limit for the Rewind function has been increased to 2 (on any difficulty mode except Easy mode).\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003eIn future updates, the development team will continue to optimize \"Imaginarium Theater\" based on your feedback and actual data from the gameplay.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003eSpiral Abyss\u003c/p\u003e\u003cp\u003eThe \"Fragment of Harmonic Whimsy\" and \"Unfinished Reverie\" Artifact set rewards in \"Domain Reliquary: Tier I\" and \"Domain Reliquary: Tier II\" for Spiral Abyss Floors 9–12 will be replaced with the \"Scroll of the Hero of Cinder City\" and the \"Obsidian Codex\" sets.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003eFloor 9 Ley Line Disorder changed to:\u003c/p\u003e\u003cp\u003e• All party members gain a 50% Pyro DMG Bonus.\u003c/p\u003e\u003cp\u003eFloor 10 Ley Line Disorder changed to:\u003c/p\u003e\u003cp\u003e• DMG dealt by characters is increased by 50% when in Nightsoul's Blessing.\u003c/p\u003e\u003cp\u003eFloor 11 Ley Line Disorder changed to:\u003c/p\u003e\u003cp\u003e• All party members gain a 60% Dendro DMG Bonus.\u003c/p\u003e\u003cp\u003e• All party members receive a 60% Hydro DMG Bonus.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003eUpdated the monster lineup on Floors 9 – 12 of the Spiral Abyss.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003eStarting from the first time that the Lunar Phase refreshes after updating to Version 5.0, the Lunar Phases will be as follows:\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003eContending Moon\u003c/p\u003e\u003cp\u003eAfter the active character uses an Elemental Skill, Normal Attack and Elemental Skill DMG is increased by 40% for 12s. For characters in Nightsoul's Blessing, this effect is enhanced: Normal Attack and Elemental Skill DMG is increased by 80%.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e※ The above updates to Spiral Abyss will take effect after the Spiral Abyss update on September 16.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e〓Adjustments \u0026amp; Optimizations〓\u003c/p\u003e\u003cp\u003e● Quests\u003c/p\u003e\u003cp\u003eAdds pop-up notifications for some newly-added quests before long quest sequences or before battles.\u003c/p\u003e\u003cp\u003eAdjusts the placement of some enemies in the Archon Quest \"We Will Be Reunited\" to reduce the difficulty of combat.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e● Enemies\u003c/p\u003e\u003cp\u003eReduces the damage dealt by the enemy \"Fatui Skirmisher - Cryogunner Legionnaire\" when multiple hits of Frost Blast continuously hit a character.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e● Serenitea Pot\u003c/p\u003e\u003cp\u003eIncreases the load limits for both indoor and outdoor areas in the Serenitea Pot due to stricter performance optimization strategies.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e● Exploration\u003c/p\u003e\u003cp\u003eClicking \"Go to collect\" under the \"Source\" of regional specialties now directs to the open world map and displays the areas where you can collect the corresponding specialty.\u003c/p\u003e\u003cp\u003eNow, before reaching the maximum Stamina limit, Travelers can increase Stamina by leveling up any region's Statue of The Seven (meaning Travelers no longer need to fully level up the Statues of The Seven in Mondstadt and Liyue to reach the maximum Stamina limit). After the version update, if a Traveler has already leveled up the Statues of The Seven in regions other than Mondstadt and Liyue, they will receive the corresponding Stamina increase.\u003c/p\u003e\u003cp\u003eAdjusts the difficulty of battling \"Ruin Hunters\" in the World Quest \"Nine Pillars of Peace,\" and significantly reduces the difficulty at World Levels 1 and 2.\u003c/p\u003e\u003cp\u003eIncreases the material drop rates of enemies \"Nobushi,\" \"Kairagi,\" \"Specters,\" \"Abyss Mages,\" \"Ruin Guards,\" \"Ruin Hunters,\" and \"Ruin Graders.\"\u003c/p\u003e\u003cp\u003eIncreases the total pin limit on the map from 200 to 250.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e● Food\u003c/p\u003e\u003cp\u003eAdds new icons to some foods with special effects.\u003c/p\u003e\u003cp\u003eWhen using certain specialty foods (such as character specialties), secondary confirmation pop-ups or prompts will appear.\u003c/p\u003e\u003cp\u003eAdds filtering and sorting functions on the Inventory \u0026gt; Food interface.\u003c/p\u003e\u003cp\u003eOptimizes the sorting rules on the \"Cook\" interface.\u003c/p\u003e\u003cp\u003eOptimizes the filter function on the \"Cook\" interface, adding filter options related to Proficiency.\u003c/p\u003e\u003cp\u003eAdjusts the order of using food to revive characters: Low-rarity basic food will appear first.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e● Shop\u003c/p\u003e\u003cp\u003eAdds the \"Crown of Insight\" as an exchangeable item in the \"Shop\" \u0026gt; \"Paimon's Bargains\" \u0026gt; \"Starglitter Exchange,\" priced at Starglitter ×50, with a monthly refresh.\u003c/p\u003e\u003cp\u003e\"Mystic Enhancement Ore\" is now available for unlimited exchange in the \"Shop\" \u0026gt; \"Paimon's Bargains\" \u0026gt; \"Stardust Exchange,\" and can be unlocked after exchanging existing \"Mystic Enhancement Ore.\"\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e● Crafting and Forging\u003c/p\u003e\u003cp\u003eIn the \"Forging\" interface, the number of items that can be forged in a single queue for Weapon Enhancement Materials has been doubled. For example, a single queue can now forge Mystic Enhancement Ore ×10 instead of ×5 (the daily crafting limit remains unchanged).\u003c/p\u003e\u003cp\u003eIn the \"Forging\" interface, when selecting Weapon Enhancement Materials to forge, the maximum quantity will be selected by default.\u003c/p\u003e\u003cp\u003eWhen crafting \"Condensed Resin\" at the Crafting Bench, the maximum number of crafting attempts will now be automatically selected based on the remaining amount of \"Original Resin\" and \"Condensed Resin,\" and the confirmation pop-up has been removed.\u003c/p\u003e\u003cp\u003eWhen selecting to craft \"Condensed Resin\" at the Crafting Bench, the number of \"Condensed Resin\" in the Inventory will now be displayed in the top-right corner of the interface.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e● Enhancement\u003c/p\u003e\u003cp\u003eReduces the frequency of the EXP overflow prompt during character leveling: when the EXP overflow is less than 1,000 (non-refundable), the prompt will no longer appear.\u003c/p\u003e\u003cp\u003eThe EXP overflow prompt during weapon enhancement has been changed to a text notification and will no longer appear as a pop-up.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e● Stellar Reunion\u003c/p\u003e\u003cp\u003eUpdates the \"Stellar Reunion\" interface.\u003c/p\u003e\u003cp\u003eDuring the \"Stellar Reunion\" event, Domain of Mastery and Domain of Forgery rewards from different days will be available at the same time, allowing Travelers to freely choose the material drops they need.\u003c/p\u003e\u003cp\u003eAdds new exploration-related quests.\u003c/p\u003e\u003cp\u003eAdds new character and weapon enhancement-related quests.\u003c/p\u003e\u003cp\u003eAdjusts the daily double drop opportunities in \"Reunion Blessing\" to 3 times.\u003c/p\u003e\u003cp\u003eAdds new version highlight videos, with rewards available after viewing: Primogems ×40.\u003c/p\u003e\u003cp\u003eReduces the number of quest objectives related to Archon Quests, and the related rewards have been transferred to that of other quests.\u003c/p\u003e\u003cp\u003eAdds \"Reunion Gifts\": Starting from Version 5.0, if returning Travelers activate the \"Stellar Reunion\" and meet the following criteria, \"Reunion Gifts\" will be unlocked, allowing them to obtain Intertwined Fate ×10 by completing the related quests:\u003c/p\u003e\u003cp\u003ea. Adventure Rank 30 or above\u003c/p\u003e\u003cp\u003eb. Haven't logged into the game for at least 45 consecutive days\u003c/p\u003e\u003cp\u003ec. At least 60 days since the last time they activated \"Reunion Gifts.\"\u003c/p\u003e\u003cp\u003eIf a Traveler logs into the game during the Version 4.8 \"Stellar Reunion\" maintenance period and meets the following conditions, both \"Stellar Reunion\" and \"Reunion Gifts\" will be unlocked with the Version 5.0 update:\u003c/p\u003e\u003cp\u003ea. Adventure Rank 30 or above\u003c/p\u003e\u003cp\u003eb. Over 45 days since last activating the \"Stellar Reunion\" event\u003c/p\u003e\u003cp\u003ec. Haven't logged into the game for at least 45 consecutive days\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e● Other Systems\u003c/p\u003e\u003cp\u003eAfter the version update, the characters that appear in the \"Theater Lobby\" will no longer have quest progress requirements.\u003c/p\u003e\u003cp\u003eUpdates the layout of the Account \"Profile\" interface, adding the number of characters in the Character Showcase and namecards displayed.\u003c/p\u003e\u003cp\u003eIn the \"Party Setup\" \u0026gt; \"Configure Team\" interface, Travelers can now hold and drag to adjust the party order.\u003c/p\u003e\u003cp\u003eIncreases the Inventory limit of Furnishings from 2,000 to 2,200.\u003c/p\u003e\u003cp\u003eWhen the Reputation Level of a certain region reaches the maximum, the weekly Reputation Quests for that region will no longer be available.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e● Battle Pass\u003c/p\u003e\u003cp\u003eStarting from Version 5.0, some Battle Pass missions will be adjusted.\u003c/p\u003e\u003cp\u003ea. In Daily Missions, the Battle Pass EXP for completing \"Claim Daily Commission Rewards 4 times\" will be increased from 150 to 200.\u003c/p\u003e\u003cp\u003eb. The Missions \"Complete 3 Requests\" and \"Complete 3 Bounties\" will be removed from Weekly Missions.\u003c/p\u003e\u003cp\u003ec. New missions will be added in Battle Pass \u0026gt; This BP Period: \"Enhance 5-star artifacts a total of 30 levels,\" \"Enhance 5-star artifacts a total of 60 levels,\" and \"Enhance 5-star artifacts a total of 100 levels.\" Completing these missions will grant Battle Pass EXP x3,600, Primogems x60, and Sanctifying Unction x60 each period.\u003c/p\u003e\u003cp\u003ed. A new mission will be added in Battle Pass \u0026gt; This BP Period: \"Complete the Act 8 Performance Challenge in Imaginarium Theater and finalize,\" which will grant Battle Pass EXP x2,250.\u003c/p\u003e\u003cp\u003eStarting from Version 5.0, Travelers can select 3 out of 4 types of Battle Pass rewards (Mora, Character EXP Materials, Mystic Enhancement Ore, and Artifact Enhancement Materials). Details can be viewed in the Battle Pass interface.\u003c/p\u003e\u003cp\u003eStarting from Version 5.0, the Talent Level-Up Material bundles \"Guide to the Original Current\" and \"Guidance of the Land of Verdure\" will be replaced by \"Guides of a Journey,\" and \"Philosophies of the Original Current\" and \"Philosophies of the Land of Verdure\" will be replaced by \"Philosophies of a Journey,\" allowing Travelers to choose any Talent Level-Up Material from all regions and types.\u003c/p\u003e\u003cp\u003eStarting from Version 5.0, Travelers will receive \"Sanctifying Elixir\" upon reaching BP Level 26 in the Gnostic Hymn (information about \"Sanctifying Elixir\" can be found in the \"Other Update Details\" section of this notice).\u003c/p\u003e\u003cp\u003eOptimizes the Battle Pass system interface.\u003c/p\u003e\u003cp\u003eUpdates the skip function for the Battle Pass animation. Viewing history will be recorded starting from Version 5.0, meaning that from Version 5.1 onwards, if Travelers have already watched the Battle Pass cutscene, it will not be replayed the first time the Battle Pass interface is opened after the version update.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e● Other\u003c/p\u003e\u003cp\u003eRegarding the adjustments to the Reputation System and Battle Pass Reputation quests, after the Version 5.0 update is completed, the development team will send the following rewards via in-game mail: Mora ×1,000,000. Travelers who reach Adventure Rank 5 or above before 2024/08/28 06:00 (UTC+8) will be eligible to claim this reward. Compensation must be claimed before the end of Version 5.0, so please remember to log into the game to claim it. The mail will be valid for 30 days.\u003c/p\u003e\u003cp\u003eAdjusts some of the terrain in the adjacent \"Desert of Hadramaveth\" area due to the release of a new area.\u003c/p\u003e\u003cp\u003eIn \"Envisaged Echoes,\" adjusts the collision size of some parts of the scenery in Jean's challenge stage to prevent enemies from being abnormally stuck in the walls when knocked back.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e〓Bug Fixes〓\u003c/p\u003e\u003cp\u003e● Enemies\u003c/p\u003e\u003cp\u003eFixes an issue whereby when challenging the enemy \"Hydro Tulpa,\" the character's attacks would incorrectly lock onto the \"Half-Tulpa\" that appear instead of the \"Hydro Tulpa\" itself under certain circumstances.\u003c/p\u003e\u003cp\u003eFixes an issue whereby the enemy \"Fatui Skirmisher\" would not re-enter combat for a long time after disengaging in certain circumstances.\u003c/p\u003e\u003cp\u003eFixes an issue whereby the combat difficulty of some enemies did not adjust dynamically at different World Levels. Once this issue is fixed, the DMG dealt by some enemies may change.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e● Character\u003c/p\u003e\u003cp\u003eFixes an issue on certain Android devices whereby Clorinde's Elemental Burst animation would be delayed when she casts her Elemental Burst.\u003c/p\u003e\u003cp\u003eFixes an issue on certain Android devices whereby the model of the character Gaming could not be displayed properly.\u003c/p\u003e\u003cp\u003eFixes an issue whereby the effect of Emilie's Lv. 6 Constellation would abnormally fail to take effect when revived at a \"Statue of The Seven\" after being defeated by certain enemies.\u003c/p\u003e\u003cp\u003eFixes an issue whereby the direction of the attack effects would be abnormal when Emilie performs a Plunging Attack under certain circumstances.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e● Genius Invokation TCG\u003c/p\u003e\u003cp\u003eFixes an issue whereby there were errors in the description or text display of some cards.\u003c/p\u003e\u003cp\u003eFixes an issue whereby some \"companion\" cards generated by \"Puca's Support\" had effects inconsistent with those played from the Hand and adjusts the list of possible \"companion\" cards that can be generated.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e● Audio\u003c/p\u003e\u003cp\u003eFixes an issue whereby the game music would be abnormal in the domain of Nahida's Story Quest \"Lingering Warmth.\"\u003c/p\u003e\u003cp\u003eFixes an issue whereby there is a chance that the sound effects of character movement would be missing when Sigewinne moves in the water.\u003c/p\u003e\u003cp\u003eFixes an issue whereby in the \"Character\" \u0026gt; \"Profile\" \u0026gt; \"Voice-Over\" interface, there was an error in Arlecchino's Chinese voice line for \"When the Wind Is Blowing.\"\u003c/p\u003e\u003cp\u003eFixes an issue in the \"Genius Invokation TCG\" gameplay mode whereby some of the voice lines for Navia did not match the actual in-game actions. After the fix, the corresponding relationship between certain voice lines and in-game actions will be adjusted.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e● Other\u003c/p\u003e\u003cp\u003eIn the Simplified Chinese \"Tutorial\" and other interfaces, some descriptions incorrectly refer to the effect as \"Shield,\" and has been adjusted to \"Ward\" (this issue also exists in other language interfaces and will be fixed in a future update).\u003c/p\u003e\u003cp\u003eFixes an issue whereby the book model of the Furnishing \"Hardcover Storybook: 'Simulanka'\" would disappear abnormally under certain circumstances.\u003c/p\u003e\u003cp\u003eFixes an issue whereby after completing a performance in \"Imaginarium Theater,\" the \"Performance Cast\" would display abnormally during the finalization screen if all characters in the team were defeated.\u003c/p\u003e\u003cp\u003eFixes an issue whereby the game would not pause on the finalization screen after failing a performance in \"Imaginarium Theater.\"\u003c/p\u003e\u003cp\u003eFixes an issue whereby there was an image error in the artwork background of Kirara's outfit \"Phantom in Boots.\"\u003c/p\u003e\u003cp\u003eFixes an issue whereby in certain situations, the character would incorrectly retain some expressions after exiting \"Photo Mode.\"\u003c/p\u003e\u003cp\u003eFixes an issue whereby there was a chance that the achievement \"Melting... Away...\" could not be completed.\u003c/p\u003e\u003cp\u003eFixes some text errors in certain languages and optimizes text. (Note: Related in-game functions have not changed. Travelers can view the changes in different languages by going to the Paimon Menu \u0026gt; Settings \u0026gt; Language and changing the Game Language.)\u003c/p\u003e\u003cp\u003e◆ Optimizes inconsistencies between certain voice-overs and the corresponding lines.\u003c/p\u003e\u003cp\u003e◆ Optimizes certain English translations.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e〓Genius Invokation TCG Balance Adjustment〓\u003c/p\u003e\u003cp\u003eAdjusts the effect of the Talent Card \"Featherfall Judgment\" of the Character Card \"Cyno\": Adjusts \"... uses Secret Rite: Chasmic Soulfarer while having at least 2 levels of Pactsworn Pathclearer's Indwelling effect, deal +2 DMG. (Once per Round)\" to \"... uses Secret Rite: Chasmic Soulfarer while having at least 2 levels of Pactsworn Pathclearer's Indwelling effect, DMG dealt by Secret Rite: Chasmic Soulfarer +1. (Max twice per Round).\"\u003c/p\u003e\u003cp\u003eAdjusts the effect of the Elemental Skill of the Character Card \"All-Devouring Narwhal\": The effect \"Deals 1 Hydro DMG. This character deals +1 DMG for every 3 extra max HP provided by Insatiable Appetite (Max +4)\" will be adjusted to \"(Max +3).\"\u003c/p\u003e\u003cp\u003eAdjusts the \"Deep Devourer's Domain\" effect of the Character Card \"All-Devouring Narwhal\": Adjusts the \"increases in Max HP\" effect from taking effect immediately to taking effect at the end of the Round.\u003c/p\u003e\u003cp\u003eAdjusts the number of times the damage negation effect triggered by \"When the character to which this is attached takes DMG\" occurs per Round for the Equipment Card \"Prospector's Drill\": Adjusted from \"Twice per Round\" to \"Once per Round.\"\u003c/p\u003e\u003cp\u003eAdjusts the effect of \"Bond of Life\" state: The Bond of Life can now negate healing effects associated to the \"increases in Max HP\" effect.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003eAfter the version update is completed, the rewards for the web event \"Off We Go to the Nation of Pyro!\" will be issued officially: \"Ring of Yaxche,\" \"Footprint of the Rainbow,\" and \"Earth Shaker,\" along with their corresponding Ascension Materials: Delirious Decadence of the Sacred Lord ×6, Blazing Sacrificial Heart's Terror ×3, Axis of the Secret Source ×3, Shard of a Shattered Will ×3, Ignited Stone ×3, Sentry's Wooden Whistle ×4, and Damaged Mask ×2. These rewards will be sent to Travelers via in-game mail.\u003c/p\u003e\u003cp\u003ea. Travelers who logged into the web event \"Off We Go to the Nation of Pyro!\" and cheered for the Sacred Flame Pilgrimage before the version update will receive an in-game mail approximately 2–12 hours after the update is complete. The mail will be valid for 30 days, so Travelers should log in to the game and claim the attachment within 30 days from receiving the mail.\u003c/p\u003e\u003cp\u003eb. Travelers who log into the web event \"Off We Go to the Nation of Pyro!\" and cheer for the Sacred Flame Pilgrimage after the version update will receive the reward mail within 5–10 minutes after completing the relevant reward objectives. The mail will be valid for 30 days, so Travelers should log in to the game and claim the attachment within 30 days from receiving the mail.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e*This is a work of fiction and is not related to any actual people, events, groups, or organizations.\u003c/p\u003e\u003cp\u003e\"PlayStation\", \"PS5\", \"PS4\", \"DualSense\", \"DUALSHOCK\" are registered trademarks or trademarks of Sony Interactive Entertainment Inc.\u003c/p\u003e","cover":"","view_type":1,"created_at":1724799612,"images":[],"post_status":{"is_top":false,"is_good":false,"is_official":false,"is_vote":false,"is_quiz_vote":false,"is_demoted":false,"is_hot":false},"topic_ids":[],"view_status":1,"max_floor":263,"is_original":1,"republish_authorization":2,"reply_time":"2024-10-29 13:28:54","is_deleted":0,"is_interactive":false,"structured_content":"[{\"insert\":{\"image\":\"https://upload-os-bbs.hoyolab.com/upload/2024/08/27/0/e830be0201055afbb30397cf1d3c7c13_6674403750866562171.jpeg\"},\"attributes\":{\"align\":\"img-center\",\"height\":390,\"width\":1080,\"size\":\"112590\"}},{\"insert\":\"Dear Traveler,\\nBelow are the details of the Version 5.0 update \\\"Flowers Resplendent on the Sun-Scorched Sojourn\\\" and the update compensation.\\n\\n〓Compensation Details〓\\nMaintenance Compensation: Primogems ×300 (60 Primogems for every hour the servers are down.)\\nIssue Fix Compensation: Primogems ×300 (Please refer to the relevant compensation mail for more details)\\n\\n〓Scope of Compensation〓\\nMaintenance Compensation: Travelers who have reached Adventure Rank 5 or above by 2024/08/28 06:00 (UTC+8).\\nCompensation must be claimed before the end of Version 5.0.\\n\\nIssue Fix Compensation: Travelers who have reached Adventure Rank 5 or above by 2024/08/28 06:00 (UTC+8).\\nPlease log in and claim your compensation before 2024/08/31 06:00 (UTC+8).\\n\\nOur developers will distribute compensation to Travelers via in-game mail within 5 hours after the update maintenance is finished. The mail will expire after 30 days, so don't forget to claim the attached compensation in time.\\n\\n〓Update Schedule〓\\nUpdate maintenance begins 2024/08/28 06:00 (UTC+8) and is estimated to take 5 hours.\\n\\n〓How to Update Game Client〓\\nPC: Close the game, open the Genshin Impact Launcher, and click Update.\\niOS: Open the App Store and tap Update.\\nAndroid: Open the game and follow the directions on-screen.\\nPS5™ and PS4™: Highlight Genshin Impact from the Home Screen, press the OPTIONS button and select \\\"Check for Update.\\\"\\nPlease do not hesitate to contact Customer Service if you encounter any issues installing the new version. We will do our very best to resolve the issue.\\n\\n〓Update Details〓\\nI. New Region\\nNew Region - Natlan\\nThe warriors of the mountains lead the path unto flowers splendorous, and the swimming Saurians of the springs bring news all night. On the far shore from sand and sea, the blazing epic hymn echoes through the land where the Sacred Flame blazes eternal.\\nBeyond the fiery altars and the mysterious realm of night, an unprecedented adventure is about to unfold in the land where humans and Saurians dwell together.\\n\\n◇ New Areas: In Version 5.0, the following areas in Natlan will become available: Tequemecan Valley, Coatepec Mountain, Toyac Springs, and Basin of Unnumbered Flames.\\n\\n※ Completing Archon Quest Prologue: Act III \\\"Song of the Dragon and Freedom\\\" will automatically unlock a Teleport Waypoint to the right of Tequemecan Valley in Natlan (If you have already completed this Archon Quest, the Teleport Waypoint will be unlocked after the update). You can use this Teleport Waypoint to head over to Natlan. You'll also receive the Primogem reward for this Teleport Waypoint when it unlocks automatically.\\n\\n▌New Mechanic in Natlan\\n\\\"Saurian Indwelling\\\"\\nNatlan's Saurians are unique life forms that can enter a \\\"Spiritsconce\\\" state under specific circumstances.\\nIndwell your spirit onto Spiritsconces to activate their power, transforming into and controlling the Saurian's original form.\\n\\n▌New System in Natlan\\n\\\"Tona's Flame\\\"\\nYou can obtain Pyro Sigils during your adventures in Natlan. Offer them up to the Tablet of Tona at the Temple of Pax to increase its level and obtain valuable rewards.\\nSatisfy any one of the criteria below to unlock \\\"Tona's Flame\\\":\\n• Enter within a certain radius of the Tablet of Tona\\n• Complete Archon Quest Chapter V: Act I \\\"Flowers Resplendent on the Sun-Scorched Sojourn\\\"\\n\\nReputation System in Natlan\\n◇ Natlan Reputation Unlock Criteria:\\n• Complete \\\"Pilgrimage of the Return of the Sacred Flame\\\" in Archon Quest Chapter V: Act I \\\"Flowers Resplendent on the Sun-Scorched Sojourn\\\"\\nEach tribe in Natlan has its own Reputation System. Visit each tribe's \\\"Obsidian Totem Pole\\\" to undertake the quests and earn Reputation EXP. Upon increasing Reputation Levels, you can claim corresponding rewards. Once a tribe's Reputation Level is maxed out, you can also receive additional rewards from the \\\"Speaker's Chamber.\\\"\\n\\nExpeditions, Daily Commissions, and other new content will also be added in Natlan. In Natlan's new commissions, if related achievements of a Commission Quest are not unlocked yet, the probability of that Commission Quest appearing will increase.\\n◇ Natlan Daily Commissions Unlock Criteria:\\n• Complete Archon Quest Chapter V: Act I \\\"Flowers Resplendent on the Sun-Scorched Sojourn\\\"\\n• Complete the World Quest \\\"Toward Red-Hot Adventure!\\\"\\n\\nIn addition, there will be new \\\"Radiant Spincrystals\\\" in Natlan.\\n\\nII. New Characters\\n5-Star Character \\\"Splish-Splash Wavechaser\\\" Mualani (Hydro)\\n◇ Vision: Hydro\\n◇ Weapon: Catalyst\\n◇ A well-known guide in Natlan who owns a watersports shop, and expert in all forms of wave-chasing.\\n◆ Elemental Skill: Surfshark Wavebreaker\\n◆ Mualani enters a surfing stance, and can move on land, water and liquid Phlogiston swiftly. While in this state, Mualani applies \\\"Marked as Prey\\\" to opponents upon coming into contact with them and gains Wave Momentum. In this state, Mualani's Normal Attacks will be converted to Sharky's Bites, and consumes Wave Momentum to increase the DMG dealt by Sharky's Bites. When she has 3 stacks of Wave Momentum, when Sharky's Bite hits an opponent, she will fire Shark Missiles at nearby opponents Marked as Prey.\\n◆ Elemental Burst: Boomsharka-laka\\n◆ Fires a Super Shark Missile that can deal AoE Hydro DMG.\\n\\n5-Star Character \\\"Turnfire Hunt\\\" Kinich (Dendro)\\n◇ Vision: Dendro\\n◇ Weapon: Claymore\\n◇ A Huitztlan Saurian Hunter skilled at counting costs.\\n◆ Elemental Skill: Canopy Hunter: Riding High\\n◆ Kinich can swing in mid-air using a grappling hook. When the grappling hook hits an enemy, it attaches to enemies and Kinich will fire Loop Shots. When Nightsoul points are at max, he can use the Elemental Skill to fire a powerful \\\"Scalespiker Cannon\\\" and deal Dendro DMG to enemies.\\n◆ Elemental Burst: Hail to the Almighty Dragonlord\\n◆ Unleashes the power of the Almighty Dragonlord, K'uhul Ajaw. Ajaw will unleash his Dragon Breath at intervals, dealing AoE Dendro DMG.\\n\\n4-Star Character \\\"Mottled Gold Yet Unsmelted\\\" Kachina (Geo)\\n◇ Vision: Geo\\n◇ Weapon: Polearm\\n◇ A young warrior of the Nanatzcayan, given the Ancient Name of \\\"Uthabiti.\\\" Kind-hearted and insatiably persistent, she grows stronger and more capable with each setback she faces.\\n◆ Elemental Skill: Go, Go Turbo Twirly!\\n◆ Fight alongside Turbo Twirly. Kachina can ride Turbo Twirly to move swiftly, climb, and slam enemies, and also summon it independently to deal continuous DMG.\\n◆ Elemental Burst: Time to Get Serious!\\n◆ Creates a Turbo Drill Field that increases Turbo Twirly's attack AoE and its Movement SPD when Kachina is riding it.\\n\\nIII. New Domain\\nDomain of Forgery: Ancient Watchtower\\n◇ Legend has it that in ancient times, the colossal beasts that roamed the land had a civilization of their own. After exploring the entirety of the land and surrounding sea, they built these structures in an attempt to cast their gaze upon the even wider world beyond. But these wise beasts have long since vanished, and in the present, no one now knows the true purpose of this place.\\n◇ Unlock Criteria (satisfy any one of the criteria below to unlock):\\n• Adventure Rank 10 or above\\n• Complete \\\"Knights of Favonius\\\" in Archon Quest Prologue: Act I \\\"The Outlander Who Caught the Wind\\\"\\n◆ Challenge the Domain to obtain Weapon Ascension Materials.\\n\\nDomain of Mastery: Blazing Ruins\\n◇ In that era, when people had yet to attain true mastery of the flames, there were sages in all corners of the world who pondered the fire and sought to fathom its mysteries. It is said that these ruins are all that is left of what was once a ring-shaped ceremonial site. Here, these sages attempted to perfect the rituals required to transform phlogiston. Among the heroes who later followed the mighty one into the belly of the volcano, there were several who once trained in this place.\\n◇ Unlock Criteria (satisfy any one of the criteria below to unlock):\\n• Adventure Rank 10 or above\\n• Complete \\\"Knights of Favonius\\\" in Archon Quest Prologue: Act I \\\"The Outlander Who Caught the Wind\\\"\\n◆ Challenge the Domain to obtain Character Talent Materials.\\n\\nDomain of Blessing: Sanctum of Rainbow Spirits\\n◇ It is said that the first sage to learn how to use phlogiston created a place of great purity, and that within this place, warriors were taught to wield the power of prismatic flames and flowing light. Later, even before they were used to resist common enemies, these powers were employed as weapons in conflicts between the tribes. Disheartened by this state of affairs, the Sage of the Stolen Flame withdrew from the world, vanishing from the pages of many tales. Devoid of their original purpose, these empty trial grounds were left behind, along with all those stories that came to be forgotten...\\n◇ Unlock Criteria (satisfy any one of the criteria below to unlock):\\n• Adventure Rank 10 or above\\n• Complete \\\"Knights of Favonius\\\" in Archon Quest Prologue: Act I \\\"The Outlander Who Caught the Wind\\\"\\n◆ Challenge the Domain to obtain Artifacts in the \\\"Scroll of the Hero of Cinder City\\\" and \\\"Obsidian Codex\\\" sets.\\n\\nIV. New Equipment\\n1. New Weapons (Examples based on Refinement Rank 1)\\nSurf's Up (5-Star Catalyst)\\nMax HP increased by 20%. Once every 15s, for the 14s after using an Elemental Skill: Gain 4 Scorching Summer stacks. Each stack increases Normal Attack DMG by 12%. For the duration of the effect, once every 1.5s, lose 1 stack after a Normal Attack hits an opponent; once every 1.5s, gain 1 stack after triggering a Vaporize reaction on an opponent. Max 4 Scorching Summer stacks.\\n◆ During the event wish \\\"Epitome Invocation,\\\" the event-exclusive 5-star weapon Surf's Up (Catalyst) will receive a huge drop-rate boost!\\n\\nFang of the Mountain King (5-Star Claymore)\\nGain 1 stack of Canopy's Favor after hitting an opponent with an Elemental Skill. This can be triggered once every 0.5s. After a nearby party member triggers a Burning or Burgeon reaction, the equipping character will gain 3 stacks. This effect can be triggered once every 2s and can be triggered even when the triggering party member is off-field. Canopy's Favor: Elemental Skill and Burst DMG is increased by 10% for 6s. Max 6 stacks. Each stack is counted independently.\\n◆ During the event wish \\\"Epitome Invocation,\\\" the event-exclusive 5-star weapon Fang of the Mountain King (Claymore) will receive a huge drop-rate boost!\\n\\nAsh-Graven Drinking Horn (4-Star Catalyst)\\nWhen an attack hits an opponent, deal AoE DMG equal to 40% of Max HP at the target location. This effect can be triggered once every 15s.\\n◆ Ash-Graven Drinking Horn (Catalyst) and its refinement materials can be redeemed in the \\\"Traces of Artistry\\\" event.\\n\\n▌Forgeable Weapons\\nFlute of Ezpitzal (4-Star Sword)\\nUsing an Elemental Skill increases DEF by 16% for 15s.\\n\\nEarth Shaker (4-Star Claymore)\\nAfter a party member triggers a Pyro-related reaction, the equipping character's Elemental Skill DMG is increased by 16% for 8s. This effect can be triggered even when the triggering party member is not on the field.\\n\\nFootprint of the Rainbow (4-Star Polearm)\\nUsing an Elemental Skill increases DEF by 16% for 15s.\\n\\nRing of Yaxche (4-Star Catalyst)\\nUsing an Elemental Skill grants the Jade-Forged Crown effect: Every 1,000 Max HP will increase the Normal Attack DMG dealt by the equipping character by 0.6% for 10s. Normal Attack DMG can be increased this way by a maximum of 16%.\\n\\nChain Breaker (4-Star Bow)\\nFor every party member from Natlan or who has a different Elemental Type from the equipping character, the equipping character gains 4.8% increased ATK. When there are no less than 3 of the aforementioned characters, the equipping character gains 24 Elemental Mastery.\\n\\n◆ You can exchange for Weapon Forging Blueprints from Alom in the Stadium of the Sacred Flame: Temple of Pax by consuming certain amounts and types of materials.\\n\\n2. New Artifacts\\nScroll of the Hero of Cinder City (4–5 Stars)\\n◇ 2-Piece Set: When a nearby party member triggers a \\\"Nightsoul Burst,\\\" the equipping character regenerates 6 Energy.\\n◇ 4-Piece Set: After the equipping character triggers a reaction related to their Elemental Type, all nearby party members gain a 12% Elemental DMG Bonus for the Elemental Types involved in the elemental reaction for 15s. If the equipping character is in the Nightsoul's Blessing state when triggering this effect, all nearby party members gain an additional 28% Elemental DMG Bonus for the Elemental Types involved in the elemental reaction for 20s. The equipping character can trigger this effect while off-field, and the DMG bonus from Artifact Sets with the same name do not stack.\\n\\nObsidian Codex (4–5 Stars)\\n◇ 2-Piece Set: While the equipping character is in Nightsoul's Blessing and is on the field, their DMG dealt is increased by 15%.\\n◇ 4-Piece Set: After the equipping character consumes 1 Nightsoul point while on the field, CRIT Rate increases by 40% for 6s. This effect can trigger once every second.\\n\\nV. New Main Story\\n1. New Archon Quests\\nArchon Quest Chapter V: Act I \\\"Flowers Resplendent on the Sun-Scorched Sojourn\\\"\\nPermanently available after the Version 5.0 update\\n\\n◆ Quest Unlock Criteria:\\n• Adventure Rank 40 or above\\n• Complete Archon Quest Chapter IV: Act VI \\\"Bedtime Story\\\"\\n• The \\\"Focused Experience Mode\\\" function is available for this quest.\\n\\nAdds the \\\"Quick Start\\\" function:\\n(1) Once unlocked, you can maintain your current Archon Quest progress, while accepting and progressing through Archon Quest Chapter V: Act I \\\"Flowers Resplendent on the Sun-Scorched Sojourn.\\\" This function will be available until the Version 6.0 update.\\n(2) Unlock Criteria: Reach Adventure Rank 28 or above, and complete Archon Quest Chapter I: Act III \\\"A New Star Approaches.\\\"\\n\\nArchon Quest Chapter V: Act II \\\"Black Stone Under a White Stone\\\"\\nPermanently available after the Version 5.0 update\\n\\n◆ Quest Unlock Criteria:\\n• Adventure Rank 40 or above\\n• Complete Archon Quest Chapter V: Act I \\\"Flowers Resplendent on the Sun-Scorched Sojourn\\\"\\n• The \\\"Focused Experience Mode\\\" function is available for this quest.\\n\\n2. New Tribal Chronicles\\n\\\"Where the Springs Return\\\"\\nAct I – Act III of \\\"Where the Springs Return\\\" will be permanently available after the Version 5.0 update\\n\\n◆ Act I and Act II Quest Unlock Criteria:\\n• Adventure Rank 40 or above\\n• Complete \\\"Pilgrimage of the Return of the Sacred Flame\\\" in Archon Quest Chapter V: Act I \\\"Flowers Resplendent on the Sun-Scorched Sojourn\\\"\\n\\n◆ Act III Quest Unlock Criteria:\\n• Adventure Rank 40 or above\\n• Complete \\\"Into Eternal Night\\\" in Archon Quest Chapter V: Act II \\\"Black Stone Under a White Stone\\\"\\n\\nThe three acts must be experienced in sequence. You can only unlock the next act after completing the previous one and meeting the corresponding unlock criteria.\\n\\n\\\"Yupanqui's Turnfire\\\"\\nAct I and Act II of \\\"Yupanqui's Turnfire\\\" will be permanently available after the Version 5.0 update\\nAct III of \\\"Yupanqui's Turnfire\\\" will be permanently available after 2024/09/17 18:00\\n\\n◆ Act I – Act III Quest Unlock Criteria:\\n• Adventure Rank 40 or above\\n• Complete \\\"Pilgrimage of the Return of the Sacred Flame\\\" in Archon Quest Chapter V: Act I \\\"Flowers Resplendent on the Sun-Scorched Sojourn\\\"\\n\\nThe three acts must be experienced in sequence. You can only unlock the next act after completing the previous one and meeting the corresponding unlock criteria.\\n\\n\\\"A Prayer for Blessings, Told to Crested Peaks\\\"\\nAct I and Act II of \\\"A Prayer for Blessings, Told to Crested Peaks\\\" will be permanently available after the Version 5.0 update\\n\\n◆ Act I and Act II Quest Unlock Criteria:\\n• Adventure Rank 40 or above\\n• Complete \\\"Pilgrimage of the Return of the Sacred Flame\\\" in Archon Quest Chapter V: Act I \\\"Flowers Resplendent on the Sun-Scorched Sojourn\\\"\\n\\nThe two acts must be experienced in sequence. You can only unlock the next act after completing the previous one and meeting the corresponding unlock criteria.\\n\\nIf you use the \\\"Quick Start\\\" function to experience Archon Quest Chapter V: Act I \\\"Flowers Resplendent on the Sun-Scorched Sojourn,\\\" you can accept the Tribal Chronicles once you meet the criteria for completing the corresponding Archon Quest (you are not restricted by the Adventure Rank 40 or above requirement).\\n\\n3. New World Quests\\nNew World Quests\\n\\\"In the Footsteps of the Chosen of Dragons\\\" Quest Chain, \\\"Shadows of the Mountains\\\" Quest Chain, \\\"Tale of Dreams Plucked From Fire\\\" Quest Chain, \\\"Between Pledge and Forgettance\\\" Quest Chain, \\\"To the Night, What is the Night's,\\\" \\\"Ripe For Trouble,\\\" \\\"To Wish Upon a Star,\\\" \\\"Stride on Rainbows, Split the Waves,\\\" \\\"The Case of the Crafting Bench,\\\" \\\"The Call of Mystical Martial Arts,\\\" etc.\\n\\nVI. New Enemies\\nGoldflame Qucusaur Tyrant\\n◇ A Qucusaurus whose extraordinary form is a result of being unable to withstand the great power it has been granted.\\nIt will fly into the air during combat and enter the \\\"Golden Flame\\\" energy-gathering form, creating a shield around itself and launching a Flamewind Feather towards the ground that summons a flamewind. If you cannot destroy the Flamewind Feather before the Qucusaurus dives down into it, the creature will use a Phlogiston Current to return to the skies. This will persist until it is exhausted and returns to its original form.\\nLocated at Basin of Unnumbered Flames\\nGluttonous Yumkasaur Mountain King\\n◇ A powerful Yumkasaurus that has experienced numerous impressive battles.\\nIt will collect Flamegranates during combat and spit them out as bombs. However, if you can use Pyro to ignite the Flamegranates before the Gluttonous Yumkasaur Mountain King can swallow them, who knows what might happen...\\nLocated at Tequemecan Valley\\nWayob Manifestation\\n\\\"Rock-Cavernous Wayob Manifestation,\\\" \\\"Flow-Inverted Wayob Manifestation,\\\" and \\\"Foliar-Swift Wayob Manifestation\\\"\\n◇ The Wayob worshipped by the various tribes of Natlan manifest themselves in the form of these obsidian totems.\\nIn battle, the Wayob Manifestation will deploy its Arena: Moment of Trial, creating a shield for itself and absorbing the Elemental Energy of all characters in the Arena. Characters in the Arena deal greatly increased DMG. If the shield is broken before the Arena expires, they will also regain a large amount of Energy. However, if they fail to break the shield, the Manifestation will generate a barrier based on the value of the remaining Elemental Shield.\\nSecret Source Automaton: Hunter-Seeker\\n\\\"Secret Source Automaton: Hunter-Seeker\\\"\\n◇ An ancient mechanical creation that wanders Natlan to this day, though its function is not known.\\nWhen characters enter and maintain the Nightsoul's Blessing state, the Secret Source Automaton: Hunter-Seeker will start progressing through its Adaptive Countermeasures. Once those are complete, the Hunter-Seeker will unleash its special cluster laser. Still, risk and opportunity go hand-in-hand, so perhaps you might take this opportunity to deal immense damage to it...\\nAvatars of Lava\\n\\\"Fluid Avatar of Lava\\\" and \\\"Eroding Avatar of Lava\\\"\\n◇ A strange monster that must continually absorb heat to stay in an active state.\\nHowever, it seems to damage itself should it absorb too much. After you use Pyro attacks to cause it to fully enter an Overburn state, it will rapidly disintegrate.\\nNatlan Saurians\\n\\\"Koholasaurus,\\\" \\\"Tepetlisaurus,\\\" \\\"Yumkasaurus,\\\" \\\"Koholasaur Whelp,\\\" \\\"Tepetlisaur Whelp,\\\" and \\\"Yumkasaur Whelp.\\\"\\n◇ The Saurians that inhabit the land of Natlan.\\nSpecial dragons that were better able to adapt to their environments, taking on different shapes and forms based on their surroundings.\\nSauroform Tribal Warriors\\n\\\"Flowing Blade Skirmisher,\\\" \\\"Flowing Blade Grease-Saw,\\\" \\\"Flowing Blade Harpoon-Thrower,\\\" \\\"Koholasaurus Warrior: Waveshuttler,\\\" \\\"Koholasaurus Warrior: Reefsplitter,\\\" \\\"Forged Sand Interrogator,\\\" \\\"Forged Sand Shieldbreaker,\\\" \\\"Forged Sand Javelineer,\\\" \\\"Tepetlisaurus Warrior: Shard Striker,\\\" \\\"Tepetlisaurus Warrior: Rockbreaker Blade,\\\" \\\"Swiftstep Seeker,\\\" \\\"Swiftstep Storm Scout,\\\" \\\"Swiftstep Armed Courier,\\\" \\\"Yumkasaurus Warrior: Whirling Leaves,\\\" and \\\"Yumkasaurus Warrior: Flowing Skyfire\\\"\\n◇ The warriors of Natlan's great tribes who fight for the honor and glory of their people.\\nOver long years of living and fighting alongside their Saurian companions, these tribal warriors have gradually acquired their traits and learned how to apply them on the field of battle.\\n\\nVII. Other Update Details\\nNew Recipes:\\n○ Monstadt \\\"Good Hunter\\\": Meatnado and Apple Roly Poly\\n○ Cipac (NPC): Grainfruit Chips and Grilled Fish in Mint Sauce\\n○ Chanca (NPC): Grainfruit Meat Soup and Cup O' Grainfruit\\n○ Obtained from talking to Chanca (NPC): Tatacos\\n○ Exploration Rewards: Saurus Crackers, Stuffed N' Mashed Potatoes, Chocolate, Blazed Meat Stew, and Fried Shrimp Beanballs\\n○ World Quest Rewards: Sour Sauce Kipper and Forest of Color\\n○ Natlan Reputation System Rewards: Glittering Gemstones, Hot Spring O'Clock, and Puff Pops\\n○ Event Reward: Delights of Wondrous Wonderings\\nNew Character Specialty Dishes:\\n○ Mualani's specialty: Pass the Luck\\n○ Kinich's specialty: Saurian Hunter's Reward\\n○ Kachina's specialty: Impeccably Organized\\nAdds new \\\"Meetings in Outrealm: Series V,\\\" \\\"Imaginarium Theater: The Second Folio,\\\" \\\"Natlan: The Land of Fire and Competition (I),\\\" and \\\"Duelist: Series I\\\" Achievement categories, and adds new Achievements to the \\\"Wonders of the World\\\" category.\\nAdds Set 34 of \\\"Paimon's Paintings\\\" chat emojis.\\nAdds some prompts for loading screens.\\nNew Namecards:\\n\\\"Mualani: Sharky\\\": Reward for reaching Friendship Lv. 10 with Mualani\\n\\\"Kinich: Ajaw\\\": Reward for reaching Friendship Lv. 10 with Kinich\\n\\\"Kachina: Twirly\\\": Reward for reaching Friendship Lv. 10 with Kachina\\n\\\"Natlan: Divine Army\\\": Reward for reaching the highest Reputation Level with 1 tribe\\n\\\"Natlan: Fiery Dragon\\\": Reward for reaching the highest Reputation Level with 4 tribes\\n\\\"Achievement: Endpoint\\\": Reward for completing all achievements under \\\"Meetings in Outrealm: Series V\\\"\\n\\\"Achievement: Feline Fortune\\\": Reward for completing all achievements under \\\"Imaginarium Theater: The Second Folio\\\"\\n\\\"Natlan: Return of the Flame\\\": Reward for completing all achievements under \\\"Natlan: The Land of Fire and Competition (I)\\\"\\n\\\"Achievement: Lord of the Night\\\": Reward for completing all achievements under \\\"Duelist: Series I\\\"\\n\\\"Travel Notes: Primal Fire\\\": Reward obtained via the BP system\\nAdds new Character Event Wish mechanic \\\"Capturing Radiance.\\\" For more information, please visit the \\\"Wish\\\" interface in the game.\\nReduces the maximum amount of Fate Points required from 2 to 1 in the Weapon Event Wish \\\"Epitomized Path.\\\"\\nAdds new Artifact Salvage function. Artifacts that have not been enhanced and leveled up can be salvaged into Sanctifying Unction and Sanctifying Essence in Inventory \u003e Artifacts.\\nAdds some new adjustments to the Artifacts system:\\n(1) Adds the gadget \\\"Artifact Transmuter,\\\" which can be obtained by completing the quests in \\\"Adventurer Handbook \u003e Experience\\\" and can be used to extract and redeem Artifacts.\\n(2) Adds new Consumable \\\"Sanctifying Elixir\\\": Use the \\\"Artifact Transmuter\\\" to extract a certain number of 5-star Artifacts that have been enhanced to \\\"+4\\\" or above, and convert them into \\\"Sanctifying Elixir\\\" (You can convert Artifacts into 1 \\\"Sanctifying Elixir\\\" per version). You can also obtain \\\"Sanctifying Elixir\\\" by exploring the open world.\\n(3) You can exchange for certain components of certain Artifact sets by using the \\\"Sanctifying Elixir\\\" in the \\\"Artifact Transmuter.\\\" Apart from that, you can also determine the Main Affix and two Minor Affixes (Different Artifact components require different amounts of \\\"Sanctifying Elixir.\\\" The same set of Artifacts can only be exchanged once in each version).\\nAdds new event \\\"Turbo Twirly!\\\": Progress through Archon Quest Chapter V: Act I \\\"Flowers Resplendent on the Sun-Scorched Sojourn\\\" and invite the character \\\"Mottled Gold Yet Unsmelted\\\" Kachina (Geo).\\nAdds World Level 9. Upon reaching Adventure Rank 58, Travelers can complete corresponding World Level Ascension Quests to increase their World Level. After the World Level increases, the levels of monsters and bosses will increase, the challenge difficulty and the rewards dropped will also be increased (Travelers who have reached Adventure Rank 58 before the version update can complete Ascension Quests to increase their World Level after the version update).\\nAdds the Borderland Billet series.\\nAdds Borderland Billet Conversion for various Weapon types in \\\"Crafting Bench \u003e Conversion\\\": Use Dream Solvent to convert Billets of other types to Borderland Billets for the same Weapon type, or change Borderland Billets to Billets of other types for the same Weapon type.\\nAdds another 8 sets of Artifacts available to exchange in the Mystic Offering system: Artifact Strongbox: Deepwood Memories, Artifact Strongbox: Gilded Dreams, Artifact Strongbox: Desert Pavilion Chronicle, Artifact Strongbox: Flower of Paradise Lost, Artifact Strongbox: Nymph's Dream, Artifact Strongbox: Vourukasha's Glow, Artifact Strongbox: Marechaussee Hunter, and Artifact Strongbox: Golden Troupe.\\nAdds new Gadgets: Firstborn Firesprite and Kaboom Box.\\nAdds new Natlan Reward Gadgets: Pyroculus Resonance Stone and Pyro Treasure Compass.\\nAdds some of the Harvestable seeds from Natlan to the Seed Dispensary.\\nAdds new Wildlife: Red Flamingo, Halberd-Crest Bird, Thick-Feathered Ruffed Pheasant, Flowcurrent Bird, Alpaca, Brown Deer, Flying Squirrel, Capybara, Pyro Crystalfly, Blue Mountain Spoonbill, Flowfire Bird, Phlogiston Aphid, Crystal Beetle, and Long-Necked Rhino. You can use the Omni-Ubiquity Net to capture certain Natlan creatures.\\n\\\"Genius Invokation TCG\\\" Gameplay Update:\\nNew Character Cards: Xianyun, Freminet, and their corresponding Talent cards. Corresponding invitation duels and guest challenges have been added to the Player List.\\nNew Character Card: Hydro Hilichurl Rogue and the corresponding Talent card. The Tavern Challenge has also been added.\\nNew Action Cards: \\\"Xenochromatic Hunter's Ray,\\\" \\\"Yumkasaurus,\\\" \\\"Koholasaurus,\\\" \\\"Stadium of the Sacred Flame,\\\" \\\"Atea,\\\" \\\"Edict of Absolution,\\\" and \\\"Saurian Dining Buddies\\\" can be purchased from Prince at The Cat's Tail.\\nThe Forge Realm's Temper is once again available. The theme of this edition is \\\"The Forge Realm's Temper: Game of Wits\\\":\\n(1) During The Forge Realm's Temper: Game of Wits, some stages will have special victory and defeat conditions. Adeptly adapt your tactics to complete the challenge and avoid the conditions for defeat!\\n(2) Within The Forge Realm's Temper: Game of Wits event stages, there will also be special rules that can easily exert influence on the tempo of the match. Fully utilizing these special rules will contribute greatly to your success.\\n\\nImaginarium Theater\\nAfter the Version 5.0 update, the two Imaginarium Theater seasons will be as follows:\\n\\nThe first season of \\\"Imaginarium Theater\\\" will be available on 2024/09/01 04:00.\\nRequired Elemental Types: Pyro, Hydro, and Dendro\\nOpening Characters: Dehya, Xiangling, Mualani, Candace, Emilie, and Yaoyao\\nWhen Imaginarium Theater is open, the corresponding Opening Characters will obtain Fantastical Blessings.\\nSpecial Guest Stars: Kaedehara Kazuha, Kachina, Clorinde, and Raiden Shogun\\nAfter the first season of Imaginarium Theater begins, the characters Collei, Cyno, Neuvillette, and Amber will each gain a new \\\"Thespian Trick\\\" that can be exchanged from the NPC Wolfy.\\n\\nThe second season of \\\"Imaginarium Theater\\\" will be available on 2024/10/01 04:00.\\nRequired Elemental Types: Pyro, Electro, and Geo\\nOpening Characters: Dehya, Chevreuse, Keqing, Fischl, Chiori, and Ningguang\\nWhen Imaginarium Theater is open, the corresponding Opening Characters will obtain Fantastical Blessings.\\nSpecial Guest Stars: Kinich, Yelan, Venti, and Sucrose\\nAfter the second season of Imaginarium Theater begins, the characters Venti, Thoma, Mika, and Navia will each gain a new \\\"Thespian Trick\\\" that can be exchanged from the NPC Wolfy.\\n\\nAfter the first season of Imaginarium Theater begins, the following adjustments will be made:\\n(1) In the new gameplay phase, Wondrous Boons will be updated to \\\"Brilliant Blessings\\\" focused on the current season's three-element reactions. You can continuously upgrade the Blessing level to enhance the effects of the corresponding Elemental Reactions. Based on the new Brilliant Blessings, the refresh mechanic of Performance Events has also been adjusted.\\n(2) Reduces the number of characters required for each difficulty level, and additional characters included can receive buffs:\\na. The number of characters required for Easy mode has been reduced to 8, and you can include an additional 2 characters.\\nb. The number of characters required for Normal mode has been reduced to 12, and you can include an additional 2 characters.\\nc. The number of characters required for Hard mode has been reduced to 16, and you can include an additional 4 characters.\\nEach extra Alternate Cast included will receive additional Fantasia Flowers and increase the Blessing Level (the Blessing Level provides attribute buffs to characters) when the performance begins. Making full use of the special rules can help you better complete the challenge.\\n(3) Visionary Mode is now available, which can be unlocked after clearing Hard Mode previously. The required number of characters for participation is 22 and 4 additional characters can be added. Both the Debut Performance Gift and Performance Tour Rewards will be increased to 10 acts. Additionally, by completing 10 acts of combat performances in each season of \\\"Imaginarium Theater,\\\" you can receive 1 Key of Echoes in the \\\"Envisaged Echoes\\\" gameplay.\\n(4) The number of \\\"Fantasia Flowers\\\" obtained from completing \\\"Battle: Normal\\\" and \\\"Battle: Defense Sequence\\\" in performances has been increased to 90, and the additional challenges in \\\"Combat Events\\\" have been removed.\\n(5) The usage limit for the Rewind function has been increased to 2 (on any difficulty mode except Easy mode).\\n\\nIn future updates, the development team will continue to optimize \\\"Imaginarium Theater\\\" based on your feedback and actual data from the gameplay.\\n\\nSpiral Abyss\\nThe \\\"Fragment of Harmonic Whimsy\\\" and \\\"Unfinished Reverie\\\" Artifact set rewards in \\\"Domain Reliquary: Tier I\\\" and \\\"Domain Reliquary: Tier II\\\" for Spiral Abyss Floors 9–12 will be replaced with the \\\"Scroll of the Hero of Cinder City\\\" and the \\\"Obsidian Codex\\\" sets.\\n\\nFloor 9 Ley Line Disorder changed to:\\n• All party members gain a 50% Pyro DMG Bonus.\\nFloor 10 Ley Line Disorder changed to:\\n• DMG dealt by characters is increased by 50% when in Nightsoul's Blessing.\\nFloor 11 Ley Line Disorder changed to:\\n• All party members gain a 60% Dendro DMG Bonus.\\n• All party members receive a 60% Hydro DMG Bonus.\\n\\nUpdated the monster lineup on Floors 9 – 12 of the Spiral Abyss.\\n\\nStarting from the first time that the Lunar Phase refreshes after updating to Version 5.0, the Lunar Phases will be as follows:\\n\\nContending Moon\\nAfter the active character uses an Elemental Skill, Normal Attack and Elemental Skill DMG is increased by 40% for 12s. For characters in Nightsoul's Blessing, this effect is enhanced: Normal Attack and Elemental Skill DMG is increased by 80%.\\n\\n※ The above updates to Spiral Abyss will take effect after the Spiral Abyss update on September 16.\\n\\n〓Adjustments \u0026 Optimizations〓\\n● Quests\\nAdds pop-up notifications for some newly-added quests before long quest sequences or before battles.\\nAdjusts the placement of some enemies in the Archon Quest \\\"We Will Be Reunited\\\" to reduce the difficulty of combat.\\n\\n● Enemies\\nReduces the damage dealt by the enemy \\\"Fatui Skirmisher - Cryogunner Legionnaire\\\" when multiple hits of Frost Blast continuously hit a character.\\n\\n● Serenitea Pot\\nIncreases the load limits for both indoor and outdoor areas in the Serenitea Pot due to stricter performance optimization strategies.\\n\\n● Exploration\\nClicking \\\"Go to collect\\\" under the \\\"Source\\\" of regional specialties now directs to the open world map and displays the areas where you can collect the corresponding specialty.\\nNow, before reaching the maximum Stamina limit, Travelers can increase Stamina by leveling up any region's Statue of The Seven (meaning Travelers no longer need to fully level up the Statues of The Seven in Mondstadt and Liyue to reach the maximum Stamina limit). After the version update, if a Traveler has already leveled up the Statues of The Seven in regions other than Mondstadt and Liyue, they will receive the corresponding Stamina increase.\\nAdjusts the difficulty of battling \\\"Ruin Hunters\\\" in the World Quest \\\"Nine Pillars of Peace,\\\" and significantly reduces the difficulty at World Levels 1 and 2.\\nIncreases the material drop rates of enemies \\\"Nobushi,\\\" \\\"Kairagi,\\\" \\\"Specters,\\\" \\\"Abyss Mages,\\\" \\\"Ruin Guards,\\\" \\\"Ruin Hunters,\\\" and \\\"Ruin Graders.\\\"\\nIncreases the total pin limit on the map from 200 to 250.\\n\\n● Food\\nAdds new icons to some foods with special effects.\\nWhen using certain specialty foods (such as character specialties), secondary confirmation pop-ups or prompts will appear.\\nAdds filtering and sorting functions on the Inventory \u003e Food interface.\\nOptimizes the sorting rules on the \\\"Cook\\\" interface.\\nOptimizes the filter function on the \\\"Cook\\\" interface, adding filter options related to Proficiency.\\nAdjusts the order of using food to revive characters: Low-rarity basic food will appear first.\\n\\n● Shop\\nAdds the \\\"Crown of Insight\\\" as an exchangeable item in the \\\"Shop\\\" \u003e \\\"Paimon's Bargains\\\" \u003e \\\"Starglitter Exchange,\\\" priced at Starglitter ×50, with a monthly refresh.\\n\\\"Mystic Enhancement Ore\\\" is now available for unlimited exchange in the \\\"Shop\\\" \u003e \\\"Paimon's Bargains\\\" \u003e \\\"Stardust Exchange,\\\" and can be unlocked after exchanging existing \\\"Mystic Enhancement Ore.\\\"\\n\\n● Crafting and Forging\\nIn the \\\"Forging\\\" interface, the number of items that can be forged in a single queue for Weapon Enhancement Materials has been doubled. For example, a single queue can now forge Mystic Enhancement Ore ×10 instead of ×5 (the daily crafting limit remains unchanged).\\nIn the \\\"Forging\\\" interface, when selecting Weapon Enhancement Materials to forge, the maximum quantity will be selected by default.\\nWhen crafting \\\"Condensed Resin\\\" at the Crafting Bench, the maximum number of crafting attempts will now be automatically selected based on the remaining amount of \\\"Original Resin\\\" and \\\"Condensed Resin,\\\" and the confirmation pop-up has been removed.\\nWhen selecting to craft \\\"Condensed Resin\\\" at the Crafting Bench, the number of \\\"Condensed Resin\\\" in the Inventory will now be displayed in the top-right corner of the interface.\\n\\n● Enhancement\\nReduces the frequency of the EXP overflow prompt during character leveling: when the EXP overflow is less than 1,000 (non-refundable), the prompt will no longer appear.\\nThe EXP overflow prompt during weapon enhancement has been changed to a text notification and will no longer appear as a pop-up.\\n\\n● Stellar Reunion\\nUpdates the \\\"Stellar Reunion\\\" interface.\\nDuring the \\\"Stellar Reunion\\\" event, Domain of Mastery and Domain of Forgery rewards from different days will be available at the same time, allowing Travelers to freely choose the material drops they need.\\nAdds new exploration-related quests.\\nAdds new character and weapon enhancement-related quests.\\nAdjusts the daily double drop opportunities in \\\"Reunion Blessing\\\" to 3 times.\\nAdds new version highlight videos, with rewards available after viewing: Primogems ×40.\\nReduces the number of quest objectives related to Archon Quests, and the related rewards have been transferred to that of other quests.\\nAdds \\\"Reunion Gifts\\\": Starting from Version 5.0, if returning Travelers activate the \\\"Stellar Reunion\\\" and meet the following criteria, \\\"Reunion Gifts\\\" will be unlocked, allowing them to obtain Intertwined Fate ×10 by completing the related quests:\\na. Adventure Rank 30 or above\\nb. Haven't logged into the game for at least 45 consecutive days\\nc. At least 60 days since the last time they activated \\\"Reunion Gifts.\\\"\\nIf a Traveler logs into the game during the Version 4.8 \\\"Stellar Reunion\\\" maintenance period and meets the following conditions, both \\\"Stellar Reunion\\\" and \\\"Reunion Gifts\\\" will be unlocked with the Version 5.0 update:\\na. Adventure Rank 30 or above\\nb. Over 45 days since last activating the \\\"Stellar Reunion\\\" event\\nc. Haven't logged into the game for at least 45 consecutive days\\n\\n● Other Systems\\nAfter the version update, the characters that appear in the \\\"Theater Lobby\\\" will no longer have quest progress requirements.\\nUpdates the layout of the Account \\\"Profile\\\" interface, adding the number of characters in the Character Showcase and namecards displayed.\\nIn the \\\"Party Setup\\\" \u003e \\\"Configure Team\\\" interface, Travelers can now hold and drag to adjust the party order.\\nIncreases the Inventory limit of Furnishings from 2,000 to 2,200.\\nWhen the Reputation Level of a certain region reaches the maximum, the weekly Reputation Quests for that region will no longer be available.\\n\\n● Battle Pass\\nStarting from Version 5.0, some Battle Pass missions will be adjusted.\\na. In Daily Missions, the Battle Pass EXP for completing \\\"Claim Daily Commission Rewards 4 times\\\" will be increased from 150 to 200.\\nb. The Missions \\\"Complete 3 Requests\\\" and \\\"Complete 3 Bounties\\\" will be removed from Weekly Missions.\\nc. New missions will be added in Battle Pass \u003e This BP Period: \\\"Enhance 5-star artifacts a total of 30 levels,\\\" \\\"Enhance 5-star artifacts a total of 60 levels,\\\" and \\\"Enhance 5-star artifacts a total of 100 levels.\\\" Completing these missions will grant Battle Pass EXP x3,600, Primogems x60, and Sanctifying Unction x60 each period.\\nd. A new mission will be added in Battle Pass \u003e This BP Period: \\\"Complete the Act 8 Performance Challenge in Imaginarium Theater and finalize,\\\" which will grant Battle Pass EXP x2,250.\\nStarting from Version 5.0, Travelers can select 3 out of 4 types of Battle Pass rewards (Mora, Character EXP Materials, Mystic Enhancement Ore, and Artifact Enhancement Materials). Details can be viewed in the Battle Pass interface.\\nStarting from Version 5.0, the Talent Level-Up Material bundles \\\"Guide to the Original Current\\\" and \\\"Guidance of the Land of Verdure\\\" will be replaced by \\\"Guides of a Journey,\\\" and \\\"Philosophies of the Original Current\\\" and \\\"Philosophies of the Land of Verdure\\\" will be replaced by \\\"Philosophies of a Journey,\\\" allowing Travelers to choose any Talent Level-Up Material from all regions and types.\\nStarting from Version 5.0, Travelers will receive \\\"Sanctifying Elixir\\\" upon reaching BP Level 26 in the Gnostic Hymn (information about \\\"Sanctifying Elixir\\\" can be found in the \\\"Other Update Details\\\" section of this notice).\\nOptimizes the Battle Pass system interface.\\nUpdates the skip function for the Battle Pass animation. Viewing history will be recorded starting from Version 5.0, meaning that from Version 5.1 onwards, if Travelers have already watched the Battle Pass cutscene, it will not be replayed the first time the Battle Pass interface is opened after the version update.\\n\\n● Other\\nRegarding the adjustments to the Reputation System and Battle Pass Reputation quests, after the Version 5.0 update is completed, the development team will send the following rewards via in-game mail: Mora ×1,000,000. Travelers who reach Adventure Rank 5 or above before 2024/08/28 06:00 (UTC+8) will be eligible to claim this reward. Compensation must be claimed before the end of Version 5.0, so please remember to log into the game to claim it. The mail will be valid for 30 days.\\nAdjusts some of the terrain in the adjacent \\\"Desert of Hadramaveth\\\" area due to the release of a new area.\\nIn \\\"Envisaged Echoes,\\\" adjusts the collision size of some parts of the scenery in Jean's challenge stage to prevent enemies from being abnormally stuck in the walls when knocked back.\\n\\n〓Bug Fixes〓\\n● Enemies\\nFixes an issue whereby when challenging the enemy \\\"Hydro Tulpa,\\\" the character's attacks would incorrectly lock onto the \\\"Half-Tulpa\\\" that appear instead of the \\\"Hydro Tulpa\\\" itself under certain circumstances.\\nFixes an issue whereby the enemy \\\"Fatui Skirmisher\\\" would not re-enter combat for a long time after disengaging in certain circumstances.\\nFixes an issue whereby the combat difficulty of some enemies did not adjust dynamically at different World Levels. Once this issue is fixed, the DMG dealt by some enemies may change.\\n\\n● Character\\nFixes an issue on certain Android devices whereby Clorinde's Elemental Burst animation would be delayed when she casts her Elemental Burst.\\nFixes an issue on certain Android devices whereby the model of the character Gaming could not be displayed properly.\\nFixes an issue whereby the effect of Emilie's Lv. 6 Constellation would abnormally fail to take effect when revived at a \\\"Statue of The Seven\\\" after being defeated by certain enemies.\\nFixes an issue whereby the direction of the attack effects would be abnormal when Emilie performs a Plunging Attack under certain circumstances.\\n\\n● Genius Invokation TCG\\nFixes an issue whereby there were errors in the description or text display of some cards.\\nFixes an issue whereby some \\\"companion\\\" cards generated by \\\"Puca's Support\\\" had effects inconsistent with those played from the Hand and adjusts the list of possible \\\"companion\\\" cards that can be generated.\\n\\n● Audio\\nFixes an issue whereby the game music would be abnormal in the domain of Nahida's Story Quest \\\"Lingering Warmth.\\\"\\nFixes an issue whereby there is a chance that the sound effects of character movement would be missing when Sigewinne moves in the water.\\nFixes an issue whereby in the \\\"Character\\\" \u003e \\\"Profile\\\" \u003e \\\"Voice-Over\\\" interface, there was an error in Arlecchino's Chinese voice line for \\\"When the Wind Is Blowing.\\\"\\nFixes an issue in the \\\"Genius Invokation TCG\\\" gameplay mode whereby some of the voice lines for Navia did not match the actual in-game actions. After the fix, the corresponding relationship between certain voice lines and in-game actions will be adjusted.\\n\\n● Other\\nIn the Simplified Chinese \\\"Tutorial\\\" and other interfaces, some descriptions incorrectly refer to the effect as \\\"Shield,\\\" and has been adjusted to \\\"Ward\\\" (this issue also exists in other language interfaces and will be fixed in a future update).\\nFixes an issue whereby the book model of the Furnishing \\\"Hardcover Storybook: 'Simulanka'\\\" would disappear abnormally under certain circumstances.\\nFixes an issue whereby after completing a performance in \\\"Imaginarium Theater,\\\" the \\\"Performance Cast\\\" would display abnormally during the finalization screen if all characters in the team were defeated.\\nFixes an issue whereby the game would not pause on the finalization screen after failing a performance in \\\"Imaginarium Theater.\\\"\\nFixes an issue whereby there was an image error in the artwork background of Kirara's outfit \\\"Phantom in Boots.\\\"\\nFixes an issue whereby in certain situations, the character would incorrectly retain some expressions after exiting \\\"Photo Mode.\\\"\\nFixes an issue whereby there was a chance that the achievement \\\"Melting... Away...\\\" could not be completed.\\nFixes some text errors in certain languages and optimizes text. (Note: Related in-game functions have not changed. Travelers can view the changes in different languages by going to the Paimon Menu \u003e Settings \u003e Language and changing the Game Language.)\\n◆ Optimizes inconsistencies between certain voice-overs and the corresponding lines.\\n◆ Optimizes certain English translations.\\n\\n〓Genius Invokation TCG Balance Adjustment〓\\nAdjusts the effect of the Talent Card \\\"Featherfall Judgment\\\" of the Character Card \\\"Cyno\\\": Adjusts \\\"... uses Secret Rite: Chasmic Soulfarer while having at least 2 levels of Pactsworn Pathclearer's Indwelling effect, deal +2 DMG. (Once per Round)\\\" to \\\"... uses Secret Rite: Chasmic Soulfarer while having at least 2 levels of Pactsworn Pathclearer's Indwelling effect, DMG dealt by Secret Rite: Chasmic Soulfarer +1. (Max twice per Round).\\\"\\nAdjusts the effect of the Elemental Skill of the Character Card \\\"All-Devouring Narwhal\\\": The effect \\\"Deals 1 Hydro DMG. This character deals +1 DMG for every 3 extra max HP provided by Insatiable Appetite (Max +4)\\\" will be adjusted to \\\"(Max +3).\\\"\\nAdjusts the \\\"Deep Devourer's Domain\\\" effect of the Character Card \\\"All-Devouring Narwhal\\\": Adjusts the \\\"increases in Max HP\\\" effect from taking effect immediately to taking effect at the end of the Round.\\nAdjusts the number of times the damage negation effect triggered by \\\"When the character to which this is attached takes DMG\\\" occurs per Round for the Equipment Card \\\"Prospector's Drill\\\": Adjusted from \\\"Twice per Round\\\" to \\\"Once per Round.\\\"\\nAdjusts the effect of \\\"Bond of Life\\\" state: The Bond of Life can now negate healing effects associated to the \\\"increases in Max HP\\\" effect.\\n\\n\\nAfter the version update is completed, the rewards for the web event \\\"Off We Go to the Nation of Pyro!\\\" will be issued officially: \\\"Ring of Yaxche,\\\" \\\"Footprint of the Rainbow,\\\" and \\\"Earth Shaker,\\\" along with their corresponding Ascension Materials: Delirious Decadence of the Sacred Lord ×6, Blazing Sacrificial Heart's Terror ×3, Axis of the Secret Source ×3, Shard of a Shattered Will ×3, Ignited Stone ×3, Sentry's Wooden Whistle ×4, and Damaged Mask ×2. These rewards will be sent to Travelers via in-game mail.\\na. Travelers who logged into the web event \\\"Off We Go to the Nation of Pyro!\\\" and cheered for the Sacred Flame Pilgrimage before the version update will receive an in-game mail approximately 2–12 hours after the update is complete. The mail will be valid for 30 days, so Travelers should log in to the game and claim the attachment within 30 days from receiving the mail.\\nb. Travelers who log into the web event \\\"Off We Go to the Nation of Pyro!\\\" and cheer for the Sacred Flame Pilgrimage after the version update will receive the reward mail within 5–10 minutes after completing the relevant reward objectives. The mail will be valid for 30 days, so Travelers should log in to the game and claim the attachment within 30 days from receiving the mail.\\n\\n\\n*This is a work of fiction and is not related to any actual people, events, groups, or organizations.\\n\\\"PlayStation\\\", \\\"PS5\\\", \\\"PS4\\\", \\\"DualSense\\\", \\\"DUALSHOCK\\\" are registered trademarks or trademarks of Sony Interactive Entertainment Inc.\\n\"}]","structured_content_rows":[],"lang":"en-us","official_type":1,"reply_forbid":{"date_type":0,"start_date":"0","cur_date":"0","level":0},"video":"","contribution_id":"0","event_start_date":"0","event_end_date":"0","classification_id":"25","is_audit":false,"is_multi_language":true,"origin_lang":"en-us","sub_type":0,"reprint_source":"","can_edit":true,"last_modify_time":1724800202,"multi_language_info":{"langs":["zh-cn","zh-tw","de-de","ko-kr","it-it","id-id","th-th","pt-pt","en-us","es-es","vi-vn","ja-jp","fr-fr","ru-ru","tr-tr"],"future_post_id":"0","lang_subject":{"pt-pt":"Descrição de Atualização da Versão 5.0 \"Jornada das Flores de Glória e Dias Flamejantes\"","ko-kr":"「영광의 꽃과 태양의 길」 5.0 버전 업데이트 안내","zh-cn":"「荣花与炎日之途」5.0版本更新说明","de-de":"Erläuterungen zur Aktualisierung auf Version 5.0 „Ein Pfad zu Blumenpracht und Sonnenglut“","ru-ru":"Подробности обновления 5.0 «Цветы под палящим солнцем»","es-es":"Detalles de la versión 5.0 «Un viaje glorioso y ardiente»","th-th":"คำอธิบายการอัปเดตเวอร์ชัน 5.0 \"ดอกไม้ผลิบานบนเส้นทางแผดเผา\"","zh-tw":"「榮花與炎日之途」5.0版本更新說明","fr-fr":"Détails de mise à jour de version 5.0 « Fleurs radieuses lors d'un périple sous le soleil brûlant »","tr-tr":"\"Kavurucu Bir Yolculuğun İhtişamlı Çiçekleri\" 5.0 Sürümü Güncelleme Ayrıntıları","vi-vn":"Giới Thiệu Cập Nhật Phiên Bản 5.0 \"Sắc Hoa Rực Rỡ Trong Hành Trình Nắng Cháy\"","it-it":"Dettagli versione 5.0 \"Viaggio tra i fiori sotto il sole rovente\"","ja-jp":"Ver.5.0「栄華と炎天の途」正式リリース","en-us":"\"Flowers Resplendent on the Sun-Scorched Sojourn\" Version 5.0 Update Details","id-id":"Penjelasan Update Versi 5.0 \"Kembang Megah dalam Perjalanan Terik Sang Surya\""},"lang_content":{},"lang_structured_content":{}},"visible_level":1,"has_cover":false,"suid":"0","desc":"Dear Traveler, Below are the details of the Version 5.0 update \"Flowers Resplendent on the Sun-Scorched Sojourn\" and the update compensation. 〓Compensation Details〓 Maintenance Compensation: Primogems ×300 (60 Primogems for every hour the servers are down.) Issue Fix Compensation: Primogems ×300 (Please refer to the relevant compensation mail for more details) 〓Scope of Compensation〓 Maintenance Compensation: Travelers who have reached Adventure Rank 5 or above by 2024/08/28 06:00 (UTC+8). Compensation must be claimed before the end of Version 5.0. Issue Fix Compensation: Travelers who have reached Adventure Rank 5 or above by 2024/08/28 06:00 (UTC+8). Please log in and claim your compensation before 2024/08/31 06:00 (UTC+8). Our developers will distribute compensation to Travelers via in-game mail within 5 hours after the update maintenance is finished. The mail will expire after 30 days, so don't forget to claim the attached compensation in time. 〓Update Schedule〓 Update maintenance begins 2024/08/28 06:00 (UTC+8) and is estimated to take 5 hours. 〓How to Update Game Client〓 PC: Close the game, open the Genshin Impact Launcher, and click Update. iOS: Open the App Store and tap Update. Android: Open the game and follow the directions on-screen. PS5™ and PS4™: Highlight Genshin Impact from the Home Screen, press the OPTIONS button and select \"Check for Update.\" Please do not hesitate to contact Customer Service if you encounter any issues installing the new version. We will do our very best to resolve the issue. 〓Update Details〓 I. New Region New Region - Natlan The warriors of the mountains lead the path unto flowers splendorous, and the swimming Saurians of the springs bring news all night. On the far shore from sand and sea, the blazing epic hymn echoes through the land where the Sacred Flame blazes eternal. Beyond the fiery altars and the mysterious realm of night, an unprecedented adventure is about to unfold in the land where humans and Saurians dwell together. ◇ New Areas: In Version 5.0, the following areas in Natlan will become available: Tequemecan Valley, Coatepec Mountain, Toyac Springs, and Basin of Unnumbered Flames. ※ Completing Archon Quest Prologue: Act III \"Song of the Dragon and Freedom\" will automatically unlock a Teleport Waypoint to the right of Tequemecan Valley in Natlan (If you have already completed this Archon Quest, the Teleport Waypoint will be unlocked after the update). You can use this Teleport Waypoint to head over to Natlan. You'll also receive the Primogem reward for this Teleport Waypoint when it unlocks automatically. ▌New Mechanic in Natlan \"Saurian Indwelling\" Natlan's Saurians are unique life forms that can enter a \"Spiritsconce\" state under specific circumstances. Indwell your spirit onto Spiritsconces to activate their power, transforming into and controlling the Saurian's original form. ▌New System in Natlan \"Tona's Flame\" You can obtain Pyro Sigils during your adventures in Natlan. Offer them up to the Tablet of Tona at the Temple of Pax to increase its level and obtain valuable rewards. Satisfy any one of the criteria below to unlock \"Tona's Flame\": • Enter within a certain radius of the Tablet of Tona • Complete Archon Quest Chapter V: Act I \"Flowers Resplendent on the Sun-Scorched Sojourn\" Reputation System in Natlan ◇ Natlan Reputation Unlock Criteria: • Complete \"Pilgrimage of the Return of the Sacred Flame\" in Archon Quest Chapter V: Act I \"Flowers Resplendent on the Sun-Scorched Sojourn\" Each tribe in Natlan has its own Reputation System. Visit each tribe's \"Obsidian Totem Pole\" to undertake the quests and earn Reputation EXP. Upon increasing Reputation Levels, you can claim corresponding rewards. Once a tribe's Reputation Level is maxed out, you can also receive additional rewards from the \"Speaker's Chamber.\" Expeditions, Daily Commissions, and other new content will also be added in Natlan. In Natlan's new commissions, if related achievements of a Commission Quest are not unlocked yet, the probability of that Commission Quest appearing will increase. ◇ Natlan Daily Commissions Unlock Criteria: • Complete Archon Quest Chapter V: Act I \"Flowers Resplendent on the Sun-Scorched Sojourn\" • Complete the World Quest \"Toward Red-Hot Adventure!\" In addition, there will be new \"Radiant Spincrystals\" in Natlan. II. New Characters 5-Star Character \"Splish-Splash Wavechaser\" Mualani (Hydro) ◇ Vision: Hydro ◇ Weapon: Catalyst ◇ A well-known guide in Natlan who owns a watersports shop, and expert in all forms of wave-chasing. ◆ Elemental Skill: Surfshark Wavebreaker ◆ Mualani enters a surfing stance, and can move on land, water and liquid Phlogiston swiftly. While in this state, Mualani applies \"Marked as Prey\" to opponents upon coming into contact with them and gains Wave Momentum. In this state, Mualani's Normal Attacks will be converted to Sharky's Bites, and consumes Wave Momentum to increase the DMG dealt by Sharky's Bites. When she has 3 stacks of Wave Momentum, when Sharky's Bite hits an opponent, she will fire Shark Missiles at nearby opponents Marked as Prey. ◆ Elemental Burst: Boomsharka-laka ◆ Fires a Super Shark Missile that can deal AoE Hydro DMG. 5-Star Character \"Turnfire Hunt\" Kinich (Dendro) ◇ Vision: Dendro ◇ Weapon: Claymore ◇ A Huitztlan Saurian Hunter skilled at counting costs. ◆ Elemental Skill: Canopy Hunter: Riding High ◆ Kinich can swing in mid-air using a grappling hook. When the grappling hook hits an enemy, it attaches to enemies and Kinich will fire Loop Shots. When Nightsoul points are at max, he can use the Elemental Skill to fire a powerful \"Scalespiker Cannon\" and deal Dendro DMG to enemies. ◆ Elemental Burst: Hail to the Almighty Dragonlord ◆ Unleashes the power of the Almighty Dragonlord, K'uhul Ajaw. Ajaw will unleash his Dragon Breath at intervals, dealing AoE Dendro DMG. 4-Star Character \"Mottled Gold Yet Unsmelted\" Kachina (Geo) ◇ Vision: Geo ◇ Weapon: Polearm ◇ A young warrior of the Nanatzcayan, given the Ancient Name of \"Uthabiti.\" Kind-hearted and insatiably persistent, she grows stronger and more capable with each setback she faces. ◆ Elemental Skill: Go, Go Turbo Twirly! ◆ Fight alongside Turbo Twirly. Kachina can ride Turbo Twirly to move swiftly, climb, and slam enemies, and also summon it independently to deal continuous DMG. ◆ Elemental Burst: Time to Get Serious! ◆ Creates a Turbo Drill Field that increases Turbo Twirly's attack AoE and its Movement SPD when Kachina is riding it. III. New Domain Domain of Forgery: Ancient Watchtower ◇ Legend has it that in ancient times, the colossal beasts that roamed the land had a civilization of their own. After exploring the entirety of the land and surrounding sea, they built these structures in an attempt to cast their gaze upon the even wider world beyond. But these wise beasts have long since vanished, and in the present, no one now knows the true purpose of this place. ◇ Unlock Criteria (satisfy any one of the criteria below to unlock): • Adventure Rank 10 or above • Complete \"Knights of Favonius\" in Archon Quest Prologue: Act I \"The Outlander Who Caught the Wind\" ◆ Challenge the Domain to obtain Weapon Ascension Materials. Domain of Mastery: Blazing Ruins ◇ In that era, when people had yet to attain true mastery of the flames, there were sages in all corners of the world who pondered the fire and sought to fathom its mysteries. It is said that these ruins are all that is left of what was once a ring-shaped ceremonial site. Here, these sages attempted to perfect the rituals required to transform phlogiston. Among the heroes who later followed the mighty one into the belly of the volcano, there were several who once trained in this place. ◇ Unlock Criteria (satisfy any one of the criteria below to unlock): • Adventure Rank 10 or above • Complete \"Knights of Favonius\" in Archon Quest Prologue: Act I \"The Outlander Who Caught the Wind\" ◆ Challenge the Domain to obtain Character Talent Materials. Domain of Blessing: Sanctum of Rainbow Spirits ◇ It is said that the first sage to learn how to use phlogiston created a place of great purity, and that within this place, warriors were taught to wield the power of prismatic flames and flowing light. Later, even before they were used to resist common enemies, these powers were employed as weapons in conflicts between the tribes. Disheartened by this state of affairs, the Sage of the Stolen Flame withdrew from the world, vanishing from the pages of many tales. Devoid of their original purpose, these empty trial grounds were left behind, along with all those stories that came to be forgotten... ◇ Unlock Criteria (satisfy any one of the criteria below to unlock): • Adventure Rank 10 or above • Complete \"Knights of Favonius\" in Archon Quest Prologue: Act I \"The Outlander Who Caught the Wind\" ◆ Challenge the Domain to obtain Artifacts in the \"Scroll of the Hero of Cinder City\" and \"Obsidian Codex\" sets. IV. New Equipment 1. New Weapons (Examples based on Refinement Rank 1) Surf's Up (5-Star Catalyst) Max HP increased by 20%. Once every 15s, for the 14s after using an Elemental Skill: Gain 4 Scorching Summer stacks. Each stack increases Normal Attack DMG by 12%. For the duration of the effect, once every 1.5s, lose 1 stack after a Normal Attack hits an opponent; once every 1.5s, gain 1 stack after triggering a Vaporize reaction on an opponent. Max 4 Scorching Summer stacks. ◆ During the event wish \"Epitome Invocation,\" the event-exclusive 5-star weapon Surf's Up (Catalyst) will receive a huge drop-rate boost! Fang of the Mountain King (5-Star Claymore) Gain 1 stack of Canopy's Favor after hitting an opponent with an Elemental Skill. This can be triggered once every 0.5s. After a nearby party member triggers a Burning or Burgeon reaction, the equipping character will gain 3 stacks. This effect can be triggered once every 2s and can be triggered even when the triggering party member is off-field. Canopy's Favor: Elemental Skill and Burst DMG is increased by 10% for 6s. Max 6 stacks. Each stack is counted independently. ◆ During the event wish \"Epitome Invocation,\" the event-exclusive 5-star weapon Fang of the Mountain King (Claymore) will receive a huge drop-rate boost! Ash-Graven Drinking Horn (4-Star Catalyst) When an attack hits an opponent, deal AoE DMG equal to 40% of Max HP at the target location. This effect can be triggered once every 15s. ◆ Ash-Graven Drinking Horn (Catalyst) and its refinement materials can be redeemed in the \"Traces of Artistry\" event. ▌Forgeable Weapons Flute of Ezpitzal (4-Star Sword) Using an Elemental Skill increases DEF by 16% for 15s. Earth Shaker (4-Star Claymore) After a party member triggers a Pyro-related reaction, the equipping character's Elemental Skill DMG is increased by 16% for 8s. This effect can be triggered even when the triggering party member is not on the field. Footprint of the Rainbow (4-Star Polearm) Using an Elemental Skill increases DEF by 16% for 15s. Ring of Yaxche (4-Star Catalyst) Using an Elemental Skill grants the Jade-Forged Crown effect: Every 1,000 Max HP will increase the Normal Attack DMG dealt by the equipping character by 0.6% for 10s. Normal Attack DMG can be increased this way by a maximum of 16%. Chain Breaker (4-Star Bow) For every party member from Natlan or who has a different Elemental Type from the equipping character, the equipping character gains 4.8% increased ATK. When there are no less than 3 of the aforementioned characters, the equipping character gains 24 Elemental Mastery. ◆ You can exchange for Weapon Forging Blueprints from Alom in the Stadium of the Sacred Flame: Temple of Pax by consuming certain amounts and types of materials. 2. New Artifacts Scroll of the Hero of Cinder City (4–5 Stars) ◇ 2-Piece Set: When a nearby party member triggers a \"Nightsoul Burst,\" the equipping character regenerates 6 Energy. ◇ 4-Piece Set: After the equipping character triggers a reaction related to their Elemental Type, all nearby party members gain a 12% Elemental DMG Bonus for the Elemental Types involved in the elemental reaction for 15s. If the equipping character is in the Nightsoul's Blessing state when triggering this effect, all nearby party members gain an additional 28% Elemental DMG Bonus for the Elemental Types involved in the elemental reaction for 20s. The equipping character can trigger this effect while off-field, and the DMG bonus from Artifact Sets with the same name do not stack. Obsidian Codex (4–5 Stars) ◇ 2-Piece Set: While the equipping character is in Nightsoul's Blessing and is on the field, their DMG dealt is increased by 15%. ◇ 4-Piece Set: After the equipping character consumes 1 Nightsoul point while on the field, CRIT Rate increases by 40% for 6s. This effect can trigger once every second. V. New Main Story 1. New Archon Quests Archon Quest Chapter V: Act I \"Flowers Resplendent on the Sun-Scorched Sojourn\" Permanently available after the Version 5.0 update ◆ Quest Unlock Criteria: • Adventure Rank 40 or above • Complete Archon Quest Chapter IV: Act VI \"Bedtime Story\" • The \"Focused Experience Mode\" function is available for this quest. Adds the \"Quick Start\" function: (1) Once unlocked, you can maintain your current Archon Quest progress, while accepting and progressing through Archon Quest Chapter V: Act I \"Flowers Resplendent on the Sun-Scorched Sojourn.\" This function will be available until the Version 6.0 update. (2) Unlock Criteria: Reach Adventure Rank 28 or above, and complete Archon Quest Chapter I: Act III \"A New Star Approaches.\" Archon Quest Chapter V: Act II \"Black Stone Under a White Stone\" Permanently available after the Version 5.0 update ◆ Quest Unlock Criteria: • Adventure Rank 40 or above • Complete Archon Quest Chapter V: Act I \"Flowers Resplendent on the Sun-Scorched Sojourn\" • The \"Focused Experience Mode\" function is available for this quest. 2. New Tribal Chronicles \"Where the Springs Return\" Act I – Act III of \"Where the Springs Return\" will be permanently available after the Version 5.0 update ◆ Act I and Act II Quest Unlock Criteria: • Adventure Rank 40 or above • Complete \"Pilgrimage of the Return of the Sacred Flame\" in Archon Quest Chapter V: Act I \"Flowers Resplendent on the Sun-Scorched Sojourn\" ◆ Act III Quest Unlock Criteria: • Adventure Rank 40 or above • Complete \"Into Eternal Night\" in Archon Quest Chapter V: Act II \"Black Stone Under a White Stone\" The three acts must be experienced in sequence. You can only unlock the next act after completing the previous one and meeting the corresponding unlock criteria. \"Yupanqui's Turnfire\" Act I and Act II of \"Yupanqui's Turnfire\" will be permanently available after the Version 5.0 update Act III of \"Yupanqui's Turnfire\" will be permanently available after 2024/09/17 18:00 ◆ Act I – Act III Quest Unlock Criteria: • Adventure Rank 40 or above • Complete \"Pilgrimage of the Return of the Sacred Flame\" in Archon Quest Chapter V: Act I \"Flowers Resplendent on the Sun-Scorched Sojourn\" The three acts must be experienced in sequence. You can only unlock the next act after completing the previous one and meeting the corresponding unlock criteria. \"A Prayer for Blessings, Told to Crested Peaks\" Act I and Act II of \"A Prayer for Blessings, Told to Crested Peaks\" will be permanently available after the Version 5.0 update ◆ Act I and Act II Quest Unlock Criteria: • Adventure Rank 40 or above • Complete \"Pilgrimage of the Return of the Sacred Flame\" in Archon Quest Chapter V: Act I \"Flowers Resplendent on the Sun-Scorched Sojourn\" The two acts must be experienced in sequence. You can only unlock the next act after completing the previous one and meeting the corresponding unlock criteria. If you use the \"Quick Start\" function to experience Archon Quest Chapter V: Act I \"Flowers Resplendent on the Sun-Scorched Sojourn,\" you can accept the Tribal Chronicles once you meet the criteria for completing the corresponding Archon Quest (you are not restricted by the Adventure Rank 40 or above requirement). 3. New World Quests New World Quests \"In the Footsteps of the Chosen of Dragons\" Quest Chain, \"Shadows of the Mountains\" Quest Chain, \"Tale of Dreams Plucked From Fire\" Quest Chain, \"Between Pledge and Forgettance\" Quest Chain, \"To the Night, What is the Night's,\" \"Ripe For Trouble,\" \"To Wish Upon a Star,\" \"Stride on Rainbows, Split the Waves,\" \"The Case of the Crafting Bench,\" \"The Call of Mystical Martial Arts,\" etc. VI. New Enemies Goldflame Qucusaur Tyrant ◇ A Qucusaurus whose extraordinary form is a result of being unable to withstand the great power it has been granted. It will fly into the air during combat and enter the \"Golden Flame\" energy-gathering form, creating a shield around itself and launching a Flamewind Feather towards the ground that summons a flamewind. If you cannot destroy the Flamewind Feather before the Qucusaurus dives down into it, the creature will use a Phlogiston Current to return to the skies. This will persist until it is exhausted and returns to its original form. Located at Basin of Unnumbered Flames Gluttonous Yumkasaur Mountain King ◇ A powerful Yumkasaurus that has experienced numerous impressive battles. It will collect Flamegranates during combat and spit them out as bombs. However, if you can use Pyro to ignite the Flamegranates before the Gluttonous Yumkasaur Mountain King can swallow them, who knows what might happen... Located at Tequemecan Valley Wayob Manifestation \"Rock-Cavernous Wayob Manifestation,\" \"Flow-Inverted Wayob Manifestation,\" and \"Foliar-Swift Wayob Manifestation\" ◇ The Wayob worshipped by the various tribes of Natlan manifest themselves in the form of these obsidian totems. In battle, the Wayob Manifestation will deploy its Arena: Moment of Trial, creating a shield for itself and absorbing the Elemental Energy of all characters in the Arena. Characters in the Arena deal greatly increased DMG. If the shield is broken before the Arena expires, they will also regain a large amount of Energy. However, if they fail to break the shield, the Manifestation will generate a barrier based on the value of the remaining Elemental Shield. Secret Source Automaton: Hunter-Seeker \"Secret Source Automaton: Hunter-Seeker\" ◇ An ancient mechanical creation that wanders Natlan to this day, though its function is not known. When characters enter and maintain the Nightsoul's Blessing state, the Secret Source Automaton: Hunter-Seeker will start progressing through its Adaptive Countermeasures. Once those are complete, the Hunter-Seeker will unleash its special cluster laser. Still, risk and opportunity go hand-in-hand, so perhaps you might take this opportunity to deal immense damage to it... Avatars of Lava \"Fluid Avatar of Lava\" and \"Eroding Avatar of Lava\" ◇ A strange monster that must continually absorb heat to stay in an active state. However, it seems to damage itself should it absorb too much. After you use Pyro attacks to cause it to fully enter an Overburn state, it will rapidly disintegrate. Natlan Saurians \"Koholasaurus,\" \"Tepetlisaurus,\" \"Yumkasaurus,\" \"Koholasaur Whelp,\" \"Tepetlisaur Whelp,\" and \"Yumkasaur Whelp.\" ◇ The Saurians that inhabit the land of Natlan. Special dragons that were better able to adapt to their environments, taking on different shapes and forms based on their surroundings. Sauroform Tribal Warriors \"Flowing Blade Skirmisher,\" \"Flowing Blade Grease-Saw,\" \"Flowing Blade Harpoon-Thrower,\" \"Koholasaurus Warrior: Waveshuttler,\" \"Koholasaurus Warrior: Reefsplitter,\" \"Forged Sand Interrogator,\" \"Forged Sand Shieldbreaker,\" \"Forged Sand Javelineer,\" \"Tepetlisaurus Warrior: Shard Striker,\" \"Tepetlisaurus Warrior: Rockbreaker Blade,\" \"Swiftstep Seeker,\" \"Swiftstep Storm Scout,\" \"Swiftstep Armed Courier,\" \"Yumkasaurus Warrior: Whirling Leaves,\" and \"Yumkasaurus Warrior: Flowing Skyfire\" ◇ The warriors of Natlan's great tribes who fight for the honor and glory of their people. Over long years of living and fighting alongside their Saurian companions, these tribal warriors have gradually acquired their traits and learned how to apply them on the field of battle. VII. Other Update Details New Recipes: ○ Monstadt \"Good Hunter\": Meatnado and Apple Roly Poly ○ Cipac (NPC): Grainfruit Chips and Grilled Fish in Mint Sauce ○ Chanca (NPC): Grainfruit Meat Soup and Cup O' Grainfruit ○ Obtained from talking to Chanca (NPC): Tatacos ○ Exploration Rewards: Saurus Crackers, Stuffed N' Mashed Potatoes, Chocolate, Blazed Meat Stew, and Fried Shrimp Beanballs ○ World Quest Rewards: Sour Sauce Kipper and Forest of Color ○ Natlan Reputation System Rewards: Glittering Gemstones, Hot Spring O'Clock, and Puff Pops ○ Event Reward: Delights of Wondrous Wonderings New Character Specialty Dishes: ○ Mualani's specialty: Pass the Luck ○ Kinich's specialty: Saurian Hunter's Reward ○ Kachina's specialty: Impeccably Organized Adds new \"Meetings in Outrealm: Series V,\" \"Imaginarium Theater: The Second Folio,\" \"Natlan: The Land of Fire and Competition (I),\" and \"Duelist: Series I\" Achievement categories, and adds new Achievements to the \"Wonders of the World\" category. Adds Set 34 of \"Paimon's Paintings\" chat emojis. Adds some prompts for loading screens. New Namecards: \"Mualani: Sharky\": Reward for reaching Friendship Lv. 10 with Mualani \"Kinich: Ajaw\": Reward for reaching Friendship Lv. 10 with Kinich \"Kachina: Twirly\": Reward for reaching Friendship Lv. 10 with Kachina \"Natlan: Divine Army\": Reward for reaching the highest Reputation Level with 1 tribe \"Natlan: Fiery Dragon\": Reward for reaching the highest Reputation Level with 4 tribes \"Achievement: Endpoint\": Reward for completing all achievements under \"Meetings in Outrealm: Series V\" \"Achievement: Feline Fortune\": Reward for completing all achievements under \"Imaginarium Theater: The Second Folio\" \"Natlan: Return of the Flame\": Reward for completing all achievements under \"Natlan: The Land of Fire and Competition (I)\" \"Achievement: Lord of the Night\": Reward for completing all achievements under \"Duelist: Series I\" \"Travel Notes: Primal Fire\": Reward obtained via the BP system Adds new Character Event Wish mechanic \"Capturing Radiance.\" For more information, please visit the \"Wish\" interface in the game. Reduces the maximum amount of Fate Points required from 2 to 1 in the Weapon Event Wish \"Epitomized Path.\" Adds new Artifact Salvage function. Artifacts that have not been enhanced and leveled up can be salvaged into Sanctifying Unction and Sanctifying Essence in Inventory \u003e Artifacts. Adds some new adjustments to the Artifacts system: (1) Adds the gadget \"Artifact Transmuter,\" which can be obtained by completing the quests in \"Adventurer Handbook \u003e Experience\" and can be used to extract and redeem Artifacts. (2) Adds new Consumable \"Sanctifying Elixir\": Use the \"Artifact Transmuter\" to extract a certain number of 5-star Artifacts that have been enhanced to \"+4\" or above, and convert them into \"Sanctifying Elixir\" (You can convert Artifacts into 1 \"Sanctifying Elixir\" per version). You can also obtain \"Sanctifying Elixir\" by exploring the open world. (3) You can exchange for certain components of certain Artifact sets by using the \"Sanctifying Elixir\" in the \"Artifact Transmuter.\" Apart from that, you can also determine the Main Affix and two Minor Affixes (Different Artifact components require different amounts of \"Sanctifying Elixir.\" The same set of Artifacts can only be exchanged once in each version). Adds new event \"Turbo Twirly!\": Progress through Archon Quest Chapter V: Act I \"Flowers Resplendent on the Sun-Scorched Sojourn\" and invite the character \"Mottled Gold Yet Unsmelted\" Kachina (Geo). Adds World Level 9. Upon reaching Adventure Rank 58, Travelers can complete corresponding World Level Ascension Quests to increase their World Level. After the World Level increases, the levels of monsters and bosses will increase, the challenge difficulty and the rewards dropped will also be increased (Travelers who have reached Adventure Rank 58 before the version update can complete Ascension Quests to increase their World Level after the version update). Adds the Borderland Billet series. Adds Borderland Billet Conversion for various Weapon types in \"Crafting Bench \u003e Conversion\": Use Dream Solvent to convert Billets of other types to Borderland Billets for the same Weapon type, or change Borderland Billets to Billets of other types for the same Weapon type. Adds another 8 sets of Artifacts available to exchange in the Mystic Offering system: Artifact Strongbox: Deepwood Memories, Artifact Strongbox: Gilded Dreams, Artifact Strongbox: Desert Pavilion Chronicle, Artifact Strongbox: Flower of Paradise Lost, Artifact Strongbox: Nymph's Dream, Artifact Strongbox: Vourukasha's Glow, Artifact Strongbox: Marechaussee Hunter, and Artifact Strongbox: Golden Troupe. Adds new Gadgets: Firstborn Firesprite and Kaboom Box. Adds new Natlan Reward Gadgets: Pyroculus Resonance Stone and Pyro Treasure Compass. Adds some of the Harvestable seeds from Natlan to the Seed Dispensary. Adds new Wildlife: Red Flamingo, Halberd-Crest Bird, Thick-Feathered Ruffed Pheasant, Flowcurrent Bird, Alpaca, Brown Deer, Flying Squirrel, Capybara, Pyro Crystalfly, Blue Mountain Spoonbill, Flowfire Bird, Phlogiston Aphid, Crystal Beetle, and Long-Necked Rhino. You can use the Omni-Ubiquity Net to capture certain Natlan creatures. \"Genius Invokation TCG\" Gameplay Update: New Character Cards: Xianyun, Freminet, and their corresponding Talent cards. Corresponding invitation duels and guest challenges have been added to the Player List. New Character Card: Hydro Hilichurl Rogue and the corresponding Talent card. The Tavern Challenge has also been added. New Action Cards: \"Xenochromatic Hunter's Ray,\" \"Yumkasaurus,\" \"Koholasaurus,\" \"Stadium of the Sacred Flame,\" \"Atea,\" \"Edict of Absolution,\" and \"Saurian Dining Buddies\" can be purchased from Prince at The Cat's Tail. The Forge Realm's Temper is once again available. The theme of this edition is \"The Forge Realm's Temper: Game of Wits\": (1) During The Forge Realm's Temper: Game of Wits, some stages will have special victory and defeat conditions. Adeptly adapt your tactics to complete the challenge and avoid the conditions for defeat! (2) Within The Forge Realm's Temper: Game of Wits event stages, there will also be special rules that can easily exert influence on the tempo of the match. Fully utilizing these special rules will contribute greatly to your success. Imaginarium Theater After the Version 5.0 update, the two Imaginarium Theater seasons will be as follows: The first season of \"Imaginarium Theater\" will be available on 2024/09/01 04:00. Required Elemental Types: Pyro, Hydro, and Dendro Opening Characters: Dehya, Xiangling, Mualani, Candace, Emilie, and Yaoyao When Imaginarium Theater is open, the corresponding Opening Characters will obtain Fantastical Blessings. Special Guest Stars: Kaedehara Kazuha, Kachina, Clorinde, and Raiden Shogun After the first season of Imaginarium Theater begins, the characters Collei, Cyno, Neuvillette, and Amber will each gain a new \"Thespian Trick\" that can be exchanged from the NPC Wolfy. The second season of \"Imaginarium Theater\" will be available on 2024/10/01 04:00. Required Elemental Types: Pyro, Electro, and Geo Opening Characters: Dehya, Chevreuse, Keqing, Fischl, Chiori, and Ningguang When Imaginarium Theater is open, the corresponding Opening Characters will obtain Fantastical Blessings. Special Guest Stars: Kinich, Yelan, Venti, and Sucrose After the second season of Imaginarium Theater begins, the characters Venti, Thoma, Mika, and Navia will each gain a new \"Thespian Trick\" that can be exchanged from the NPC Wolfy. After the first season of Imaginarium Theater begins, the following adjustments will be made: (1) In the new gameplay phase, Wondrous Boons will be updated to \"Brilliant Blessings\" focused on the current season's three-element reactions. You can continuously upgrade the Blessing level to enhance the effects of the corresponding Elemental Reactions. Based on the new Brilliant Blessings, the refresh mechanic of Performance Events has also been adjusted. (2) Reduces the number of characters required for each difficulty level, and additional characters included can receive buffs: a. The number of characters required for Easy mode has been reduced to 8, and you can include an additional 2 characters. b. The number of characters required for Normal mode has been reduced to 12, and you can include an additional 2 characters. c. The number of characters required for Hard mode has been reduced to 16, and you can include an additional 4 characters. Each extra Alternate Cast included will receive additional Fantasia Flowers and increase the Blessing Level (the Blessing Level provides attribute buffs to characters) when the performance begins. Making full use of the special rules can help you better complete the challenge. (3) Visionary Mode is now available, which can be unlocked after clearing Hard Mode previously. The required number of characters for participation is 22 and 4 additional characters can be added. Both the Debut Performance Gift and Performance Tour Rewards will be increased to 10 acts. Additionally, by completing 10 acts of combat performances in each season of \"Imaginarium Theater,\" you can receive 1 Key of Echoes in the \"Envisaged Echoes\" gameplay. (4) The number of \"Fantasia Flowers\" obtained from completing \"Battle: Normal\" and \"Battle: Defense Sequence\" in performances has been increased to 90, and the additional challenges in \"Combat Events\" have been removed. (5) The usage limit for the Rewind function has been increased to 2 (on any difficulty mode except Easy mode). In future updates, the development team will continue to optimize \"Imaginarium Theater\" based on your feedback and actual data from the gameplay. Spiral Abyss The \"Fragment of Harmonic Whimsy\" and \"Unfinished Reverie\" Artifact set rewards in \"Domain Reliquary: Tier I\" and \"Domain Reliquary: Tier II\" for Spiral Abyss Floors 9–12 will be replaced with the \"Scroll of the Hero of Cinder City\" and the \"Obsidian Codex\" sets. Floor 9 Ley Line Disorder changed to: • All party members gain a 50% Pyro DMG Bonus. Floor 10 Ley Line Disorder changed to: • DMG dealt by characters is increased by 50% when in Nightsoul's Blessing. Floor 11 Ley Line Disorder changed to: • All party members gain a 60% Dendro DMG Bonus. • All party members receive a 60% Hydro DMG Bonus. Updated the monster lineup on Floors 9 – 12 of the Spiral Abyss. Starting from the first time that the Lunar Phase refreshes after updating to Version 5.0, the Lunar Phases will be as follows: Contending Moon After the active character uses an Elemental Skill, Normal Attack and Elemental Skill DMG is increased by 40% for 12s. For characters in Nightsoul's Blessing, this effect is enhanced: Normal Attack and Elemental Skill DMG is increased by 80%. ※ The above updates to Spiral Abyss will take effect after the Spiral Abyss update on September 16. 〓Adjustments \u0026 Optimizations〓 ● Quests Adds pop-up notifications for some newly-added quests before long quest sequences or before battles. Adjusts the placement of some enemies in the Archon Quest \"We Will Be Reunited\" to reduce the difficulty of combat. ● Enemies Reduces the damage dealt by the enemy \"Fatui Skirmisher - Cryogunner Legionnaire\" when multiple hits of Frost Blast continuously hit a character. ● Serenitea Pot Increases the load limits for both indoor and outdoor areas in the Serenitea Pot due to stricter performance optimization strategies. ● Exploration Clicking \"Go to collect\" under the \"Source\" of regional specialties now directs to the open world map and displays the areas where you can collect the corresponding specialty. Now, before reaching the maximum Stamina limit, Travelers can increase Stamina by leveling up any region's Statue of The Seven (meaning Travelers no longer need to fully level up the Statues of The Seven in Mondstadt and Liyue to reach the maximum Stamina limit). After the version update, if a Traveler has already leveled up the Statues of The Seven in regions other than Mondstadt and Liyue, they will receive the corresponding Stamina increase. Adjusts the difficulty of battling \"Ruin Hunters\" in the World Quest \"Nine Pillars of Peace,\" and significantly reduces the difficulty at World Levels 1 and 2. Increases the material drop rates of enemies \"Nobushi,\" \"Kairagi,\" \"Specters,\" \"Abyss Mages,\" \"Ruin Guards,\" \"Ruin Hunters,\" and \"Ruin Graders.\" Increases the total pin limit on the map from 200 to 250. ● Food Adds new icons to some foods with special effects. When using certain specialty foods (such as character specialties), secondary confirmation pop-ups or prompts will appear. Adds filtering and sorting functions on the Inventory \u003e Food interface. Optimizes the sorting rules on the \"Cook\" interface. Optimizes the filter function on the \"Cook\" interface, adding filter options related to Proficiency. Adjusts the order of using food to revive characters: Low-rarity basic food will appear first. ● Shop Adds the \"Crown of Insight\" as an exchangeable item in the \"Shop\" \u003e \"Paimon's Bargains\" \u003e \"Starglitter Exchange,\" priced at Starglitter ×50, with a monthly refresh. \"Mystic Enhancement Ore\" is now available for unlimited exchange in the \"Shop\" \u003e \"Paimon's Bargains\" \u003e \"Stardust Exchange,\" and can be unlocked after exchanging existing \"Mystic Enhancement Ore.\" ● Crafting and Forging In the \"Forging\" interface, the number of items that can be forged in a single queue for Weapon Enhancement Materials has been doubled. For example, a single queue can now forge Mystic Enhancement Ore ×10 instead of ×5 (the daily crafting limit remains unchanged). In the \"Forging\" interface, when selecting Weapon Enhancement Materials to forge, the maximum quantity will be selected by default. When crafting \"Condensed Resin\" at the Crafting Bench, the maximum number of crafting attempts will now be automatically selected based on the remaining amount of \"Original Resin\" and \"Condensed Resin,\" and the confirmation pop-up has been removed. When selecting to craft \"Condensed Resin\" at the Crafting Bench, the number of \"Condensed Resin\" in the Inventory will now be displayed in the top-right corner of the interface. ● Enhancement Reduces the frequency of the EXP overflow prompt during character leveling: when the EXP overflow is less than 1,000 (non-refundable), the prompt will no longer appear. The EXP overflow prompt during weapon enhancement has been changed to a text notification and will no longer appear as a pop-up. ● Stellar Reunion Updates the \"Stellar Reunion\" interface. During the \"Stellar Reunion\" event, Domain of Mastery and Domain of Forgery rewards from different days will be available at the same time, allowing Travelers to freely choose the material drops they need. Adds new exploration-related quests. Adds new character and weapon enhancement-related quests. Adjusts the daily double drop opportunities in \"Reunion Blessing\" to 3 times. Adds new version highlight videos, with rewards available after viewing: Primogems ×40. Reduces the number of quest objectives related to Archon Quests, and the related rewards have been transferred to that of other quests. Adds \"Reunion Gifts\": Starting from Version 5.0, if returning Travelers activate the \"Stellar Reunion\" and meet the following criteria, \"Reunion Gifts\" will be unlocked, allowing them to obtain Intertwined Fate ×10 by completing the related quests: a. Adventure Rank 30 or above b. Haven't logged into the game for at least 45 consecutive days c. At least 60 days since the last time they activated \"Reunion Gifts.\" If a Traveler logs into the game during the Version 4.8 \"Stellar Reunion\" maintenance period and meets the following conditions, both \"Stellar Reunion\" and \"Reunion Gifts\" will be unlocked with the Version 5.0 update: a. Adventure Rank 30 or above b. Over 45 days since last activating the \"Stellar Reunion\" event c. Haven't logged into the game for at least 45 consecutive days ● Other Systems After the version update, the characters that appear in the \"Theater Lobby\" will no longer have quest progress requirements. Updates the layout of the Account \"Profile\" interface, adding the number of characters in the Character Showcase and namecards displayed. In the \"Party Setup\" \u003e \"Configure Team\" interface, Travelers can now hold and drag to adjust the party order. Increases the Inventory limit of Furnishings from 2,000 to 2,200. When the Reputation Level of a certain region reaches the maximum, the weekly Reputation Quests for that region will no longer be available. ● Battle Pass Starting from Version 5.0, some Battle Pass missions will be adjusted. a. In Daily Missions, the Battle Pass EXP for completing \"Claim Daily Commission Rewards 4 times\" will be increased from 150 to 200. b. The Missions \"Complete 3 Requests\" and \"Complete 3 Bounties\" will be removed from Weekly Missions. c. New missions will be added in Battle Pass \u003e This BP Period: \"Enhance 5-star artifacts a total of 30 levels,\" \"Enhance 5-star artifacts a total of 60 levels,\" and \"Enhance 5-star artifacts a total of 100 levels.\" Completing these missions will grant Battle Pass EXP x3,600, Primogems x60, and Sanctifying Unction x60 each period. d. A new mission will be added in Battle Pass \u003e This BP Period: \"Complete the Act 8 Performance Challenge in Imaginarium Theater and finalize,\" which will grant Battle Pass EXP x2,250. Starting from Version 5.0, Travelers can select 3 out of 4 types of Battle Pass rewards (Mora, Character EXP Materials, Mystic Enhancement Ore, and Artifact Enhancement Materials). Details can be viewed in the Battle Pass interface. Starting from Version 5.0, the Talent Level-Up Material bundles \"Guide to the Original Current\" and \"Guidance of the Land of Verdure\" will be replaced by \"Guides of a Journey,\" and \"Philosophies of the Original Current\" and \"Philosophies of the Land of Verdure\" will be replaced by \"Philosophies of a Journey,\" allowing Travelers to choose any Talent Level-Up Material from all regions and types. Starting from Version 5.0, Travelers will receive \"Sanctifying Elixir\" upon reaching BP Level 26 in the Gnostic Hymn (information about \"Sanctifying Elixir\" can be found in the \"Other Update Details\" section of this notice). Optimizes the Battle Pass system interface. Updates the skip function for the Battle Pass animation. Viewing history will be recorded starting from Version 5.0, meaning that from Version 5.1 onwards, if Travelers have already watched the Battle Pass cutscene, it will not be replayed the first time the Battle Pass interface is opened after the version update. ● Other Regarding the adjustments to the Reputation System and Battle Pass Reputation quests, after the Version 5.0 update is completed, the development team will send the following rewards via in-game mail: Mora ×1,000,000. Travelers who reach Adventure Rank 5 or above before 2024/08/28 06:00 (UTC+8) will be eligible to claim this reward. Compensation must be claimed before the end of Version 5.0, so please remember to log into the game to claim it. The mail will be valid for 30 days. Adjusts some of the terrain in the adjacent \"Desert of Hadramaveth\" area due to the release of a new area. In \"Envisaged Echoes,\" adjusts the collision size of some parts of the scenery in Jean's challenge stage to prevent enemies from being abnormally stuck in the walls when knocked back. 〓Bug Fixes〓 ● Enemies Fixes an issue whereby when challenging the enemy \"Hydro Tulpa,\" the character's attacks would incorrectly lock onto the \"Half-Tulpa\" that appear instead of the \"Hydro Tulpa\" itself under certain circumstances. Fixes an issue whereby the enemy \"Fatui Skirmisher\" would not re-enter combat for a long time after disengaging in certain circumstances. Fixes an issue whereby the combat difficulty of some enemies did not adjust dynamically at different World Levels. Once this issue is fixed, the DMG dealt by some enemies may change. ● Character Fixes an issue on certain Android devices whereby Clorinde's Elemental Burst animation would be delayed when she casts her Elemental Burst. Fixes an issue on certain Android devices whereby the model of the character Gaming could not be displayed properly. Fixes an issue whereby the effect of Emilie's Lv. 6 Constellation would abnormally fail to take effect when revived at a \"Statue of The Seven\" after being defeated by certain enemies. Fixes an issue whereby the direction of the attack effects would be abnormal when Emilie performs a Plunging Attack under certain circumstances. ● Genius Invokation TCG Fixes an issue whereby there were errors in the description or text display of some cards. Fixes an issue whereby some \"companion\" cards generated by \"Puca's Support\" had effects inconsistent with those played from the Hand and adjusts the list of possible \"companion\" cards that can be generated. ● Audio Fixes an issue whereby the game music would be abnormal in the domain of Nahida's Story Quest \"Lingering Warmth.\" Fixes an issue whereby there is a chance that the sound effects of character movement would be missing when Sigewinne moves in the water. Fixes an issue whereby in the \"Character\" \u003e \"Profile\" \u003e \"Voice-Over\" interface, there was an error in Arlecchino's Chinese voice line for \"When the Wind Is Blowing.\" Fixes an issue in the \"Genius Invokation TCG\" gameplay mode whereby some of the voice lines for Navia did not match the actual in-game actions. After the fix, the corresponding relationship between certain voice lines and in-game actions will be adjusted. ● Other In the Simplified Chinese \"Tutorial\" and other interfaces, some descriptions incorrectly refer to the effect as \"Shield,\" and has been adjusted to \"Ward\" (this issue also exists in other language interfaces and will be fixed in a future update). Fixes an issue whereby the book model of the Furnishing \"Hardcover Storybook: 'Simulanka'\" would disappear abnormally under certain circumstances. Fixes an issue whereby after completing a performance in \"Imaginarium Theater,\" the \"Performance Cast\" would display abnormally during the finalization screen if all characters in the team were defeated. Fixes an issue whereby the game would not pause on the finalization screen after failing a performance in \"Imaginarium Theater.\" Fixes an issue whereby there was an image error in the artwork background of Kirara's outfit \"Phantom in Boots.\" Fixes an issue whereby in certain situations, the character would incorrectly retain some expressions after exiting \"Photo Mode.\" Fixes an issue whereby there was a chance that the achievement \"Melting... Away...\" could not be completed. Fixes some text errors in certain languages and optimizes text. (Note: Related in-game functions have not changed. Travelers can view the changes in different languages by going to the Paimon Menu \u003e Settings \u003e Language and changing the Game Language.) ◆ Optimizes inconsistencies between certain voice-overs and the corresponding lines. ◆ Optimizes certain English translations. 〓Genius Invokation TCG Balance Adjustment〓 Adjusts the effect of the Talent Card \"Featherfall Judgment\" of the Character Card \"Cyno\": Adjusts \"... uses Secret Rite: Chasmic Soulfarer while having at least 2 levels of Pactsworn Pathclearer's Indwelling effect, deal +2 DMG. (Once per Round)\" to \"... uses Secret Rite: Chasmic Soulfarer while having at least 2 levels of Pactsworn Pathclearer's Indwelling effect, DMG dealt by Secret Rite: Chasmic Soulfarer +1. (Max twice per Round).\" Adjusts the effect of the Elemental Skill of the Character Card \"All-Devouring Narwhal\": The effect \"Deals 1 Hydro DMG. This character deals +1 DMG for every 3 extra max HP provided by Insatiable Appetite (Max +4)\" will be adjusted to \"(Max +3).\" Adjusts the \"Deep Devourer's Domain\" effect of the Character Card \"All-Devouring Narwhal\": Adjusts the \"increases in Max HP\" effect from taking effect immediately to taking effect at the end of the Round. Adjusts the number of times the damage negation effect triggered by \"When the character to which this is attached takes DMG\" occurs per Round for the Equipment Card \"Prospector's Drill\": Adjusted from \"Twice per Round\" to \"Once per Round.\" Adjusts the effect of \"Bond of Life\" state: The Bond of Life can now negate healing effects associated to the \"increases in Max HP\" effect. After the version update is completed, the rewards for the web event \"Off We Go to the Nation of Pyro!\" will be issued officially: \"Ring of Yaxche,\" \"Footprint of the Rainbow,\" and \"Earth Shaker,\" along with their corresponding Ascension Materials: Delirious Decadence of the Sacred Lord ×6, Blazing Sacrificial Heart's Terror ×3, Axis of the Secret Source ×3, Shard of a Shattered Will ×3, Ignited Stone ×3, Sentry's Wooden Whistle ×4, and Damaged Mask ×2. These rewards will be sent to Travelers via in-game mail. a. Travelers who logged into the web event \"Off We Go to the Nation of Pyro!\" and cheered for the Sacred Flame Pilgrimage before the version update will receive an in-game mail approximately 2–12 hours after the update is complete. The mail will be valid for 30 days, so Travelers should log in to the game and claim the attachment within 30 days from receiving the mail. b. Travelers who log into the web event \"Off We Go to the Nation of Pyro!\" and cheer for the Sacred Flame Pilgrimage after the version update will receive the reward mail within 5–10 minutes after completing the relevant reward objectives. The mail will be valid for 30 days, so Travelers should log in to the game and claim the attachment within 30 days from receiving the mail. *This is a work of fiction and is not related to any actual people, events, groups, or organizations. \"PlayStation\", \"PS5\", \"PS4\", \"DualSense\", \"DUALSHOCK\" are registered trademarks or trademarks of Sony Interactive Entertainment Inc."},"forum":null,"topics":[],"user":{"uid":"1015537","nickname":"Genshin Impact Official","introduce":"Grand Master of Genshin Impact Forum","avatar":"100236","gender":0,"certification":{"type":1,"icon_url":"https://hyl-static-res-prod.hoyolab.com/upload/static-resource/2022/02/23/f5a37763f0f2080c0c43cca8638af024_5295925290813405198.webp","desc":"Official Big Boss"},"level_exp":{"level":0,"exp":0},"is_following":false,"is_followed":false,"avatar_url":"https://fastcdn.hoyoverse.com/static-resource-v2/2024/04/10/71a62b9a993534f3db7896fc6f725ff8_4436020059642725994.webp","auth":null,"is_logoff":false,"pendant":"","was_following":false,"post_num":3049,"suid":"0","black_relation":{"is_blacking":false,"is_blacked":false},"badge":null,"lantern":null,"otaku_devotion_title":{"icon":"","name":"","desc":"","otaku_identity":"OtakuIdentityNone","accompany_title":"AccompanyTitleUnknown","role_id":"0"}},"self_operation":{"attitude":0,"is_collected":false},"stat":{"view_num":193561,"reply_num":344,"like_num":3375,"bookmark_num":517,"share_num":104,"view_num_unit":"","reply_num_unit":"","like_num_unit":"","bookmark_num_unit":"","share_num_unit":"","true_view_num":0,"click_view_num":0,"summary_for_creator":null,"multi_upvote_stats":[{"upvote_id":"1","upvote_num":3236},{"upvote_id":"2","upvote_num":62},{"upvote_id":"3","upvote_num":39},{"upvote_id":"4","upvote_num":18},{"upvote_id":"5","upvote_num":8},{"upvote_id":"8","upvote_num":4},{"upvote_id":"10","upvote_num":4},{"upvote_id":"7","upvote_num":2},{"upvote_id":"9","upvote_num":2}],"self_operation":null},"help_sys":null,"cover":null,"image_list":[{"url":"https://upload-os-bbs.hoyolab.com/upload/2024/08/27/0/e830be0201055afbb30397cf1d3c7c13_6674403750866562171.jpeg","height":390,"width":1080,"format":"JPEG","size":"112590","spoiler":false,"cuts":[{"ratio":2,"lt_point":{"x":0,"y":0},"rb_point":{"x":520,"y":389}},{"ratio":3,"lt_point":{"x":0,"y":0},"rb_point":{"x":390,"y":389}},{"ratio":4,"lt_point":{"x":0,"y":13},"rb_point":{"x":569,"y":333}},{"ratio":1,"lt_point":{"x":0,"y":0},"rb_point":{"x":292,"y":389}}],"tag_info":{"is_long_picture":false},"template_info":null,"image_id":"86832314"}],"is_official_master":false,"is_user_master":false,"hot_reply_exist":true,"vote_count":0,"last_modify_time":1724800202,"contribution":null,"classification":{"id":"25","name":"Game News \u0026 suggestions","icon":""},"video":null,"game":{"game_id":2,"game_name":"Genshin Impact","color":"#7D6631","background_color":"#F3E9C8","icon":""},"data_box":"","is_top_icon":false,"tags":{"is_user_top":false,"is_qualified_post":true,"is_hot_entry_post":false,"hot_topic_idx":0},"hot_reply":null,"collection":null,"is_rich_text":false,"catalog_style_hint":0,"cover_list":[{"url":"https://upload-os-bbs.hoyolab.com/upload/2024/08/27/0/e830be0201055afbb30397cf1d3c7c13_6674403750866562171.jpeg","height":390,"width":1080,"format":"JPEG","size":"112590","spoiler":false,"cuts":[{"ratio":2,"lt_point":{"x":0,"y":0},"rb_point":{"x":520,"y":389}},{"ratio":3,"lt_point":{"x":0,"y":0},"rb_point":{"x":390,"y":389}},{"ratio":4,"lt_point":{"x":0,"y":13},"rb_point":{"x":569,"y":333}},{"ratio":1,"lt_point":{"x":0,"y":0},"rb_point":{"x":292,"y":389}}],"tag_info":{"is_long_picture":false},"template_info":null,"image_id":"86832314"}],"cut_type":1,"shows_game_classification":false,"vote":null,"hot_reply_v2":null,"feedback":null,"reply_quick_source":[],"trans_source":"AWSTranslate"}}}