{"retcode":0,"message":"OK","data":{"post":{"post":{"game_id":2,"post_id":"34066691","f_forum_id":0,"uid":"1015537","subject":"\"The Rainbow Destined to Burn\" Version 5.1 Update Details","content":"\u003cdiv class=\"ql-image img-center 52c1d02d-01b4-4543-928b-c5cdc89b12c7\" data-uuid=\"52c1d02d-01b4-4543-928b-c5cdc89b12c7\"\u003e\u003cdiv class=\"ql-image-wrp\"\u003e\u003cdiv class=\"ql-image-mask-wrapper\"\u003e\u003cimg src=\"https://hoyolab-upload-private.hoyolab.com/upload/2024/10/08/0/20e288502dee30ce1a0210347a6c4102_1948436012719403307.jpeg?x-oss-process=image%2Fresize%2Cs_1000%2Fauto-orient%2C0%2Finterlace%2C1%2Fformat%2Cwebp%2Fquality%2Cq_70\" alt=\"\" align=\"img-center\" data-uuid=\"52c1d02d-01b4-4543-928b-c5cdc89b12c7\"\u003e\u003c/div\u003e\u003cdiv class=\"ql-image-desc-wrp\"\u003e\u003cp contenteditable=\"false\" class=\"ql-image-desc\" data-placeholder=\"Click to enter image description (up to 90 characters)\"\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\u003cp\u003eDear Traveler,\u003c/p\u003e\u003cp\u003eBelow are the details of the Version 5.1 update \"The Rainbow Destined to Burn\" and the update compensation.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e〓Compensation Details〓\u003c/p\u003e\u003cp\u003eMaintenance Compensation: Primogems ×300 (60 Primogems per hour the servers are down)\u003c/p\u003e\u003cp\u003eIssue Fix Compensation: Primogems ×300 (please refer to the relevant compensation mail for more details)\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e〓Scope of Compensation〓\u003c/p\u003e\u003cp\u003eMaintenance Compensation: Travelers who have reached Adventure Rank 5 or above by 2024/10/09 06:00 (UTC+8).\u003c/p\u003e\u003cp\u003eCompensation must be claimed before the end of Version 5.1.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003eIssue Fix Compensation: Travelers who have reached Adventure Rank 5 or above by 2024/10/09 06:00 (UTC+8).\u003c/p\u003e\u003cp\u003ePlease log in and claim your compensation before 2024/10/12 06:00 (UTC+8).\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003eOur developers will distribute compensation to Travelers via in-game mail within 5 hours after the update maintenance is finished. The mail will expire after 30 days, so don't forget to claim the attached compensation in time.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e〓Update Schedule〓\u003c/p\u003e\u003cp\u003eUpdate maintenance begins 2024/10/09 06:00 (UTC+8) and is estimated to take 5 hours.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e〓How to Update Game Client〓\u003c/p\u003e\u003cp\u003ePC: Close the game, open the Genshin Impact Launcher, and click Update.\u003c/p\u003e\u003cp\u003eiOS: Open the App Store and tap Update.\u003c/p\u003e\u003cp\u003eAndroid: Open the game and follow the directions on-screen.\u003c/p\u003e\u003cp\u003ePS5™ and PS4™: Highlight Genshin Impact from the Home Screen, press the OPTIONS button and select \"Check for Update.\"\u003c/p\u003e\u003cp\u003ePlease do not hesitate to contact Customer Service if you encounter any issues installing the new version. We will do our very best to resolve the issue.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e〓Update Details〓\u003c/p\u003e\u003cp\u003eI. New Character\u003c/p\u003e\u003cp\u003e5-Star Character \"Ardent Flames Forge the Soul\" Xilonen (Geo)\u003c/p\u003e\u003cp\u003e◇ Vision: Geo\u003c/p\u003e\u003cp\u003e◇ Weapon: Sword\u003c/p\u003e\u003cp\u003e◇ A Name Engraver of the Nanatzcayan, she is especially skilled at finding a good balance between the heavy responsibilities of her job and living well.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e◆ Elemental Skill: Yohual's Scratch\u003c/p\u003e\u003cp\u003e◇ Source Samples: Xilonen has 3 Geo Samplers with her that can generate different Soundscapes based on her other party members' Elemental Types (Pyro/Hydro/Cryo/Electro). Different Soundscapes can result in Elemental Skills and Bursts to produce various effects, and decrease nearby opponents' corresponding Elemental RES while active.\u003c/p\u003e\u003cp\u003e◇ After unleashing her Elemental Skill, Xilonen will enter the Nightsoul's Blessing state and switch to the Blade Roller mode. While in this mode, Xilonen's Normal Attacks will allow her to perform consecutive kicks using her roller blades. She can also engage in swift movement and climbing, and activate her Geo Samplers. After unlocking the Talent \"Netotiliztli's Echoes,\" different Soundscapes will enhance Xilonen's Normal and Plunging Attacks: either by gaining Nightsoul points upon hitting enemies or by increasing the DMG dealt by Normal and Plunging Attacks. When Nightsoul points reach the maximum, all Samplers will be activated.\u003c/p\u003e\u003cp\u003e◆ Elemental Burst: Ocelotlicue Point!\u003c/p\u003e\u003cp\u003e◇ Deals AoE Geo DMG to opponents and based on different Soundscapes: Restores HP for nearby active characters or deals additional AoE Geo DMG.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003eII. New Equipment\u003c/p\u003e\u003cp\u003e1. New Weapons (Examples based on Refinement Rank 1)\u003c/p\u003e\u003cp\u003ePeak Patrol Song (5-Star Sword)\u003c/p\u003e\u003cp\u003eGain \"Ode to Flowers\" after Normal or Plunging Attacks hit an opponent: DEF increases by 8% and gain a 10% All Elemental DMG Bonus for 6s. Max 2 stacks. Can trigger once per 0.1s. When this effect reaches 2 stacks or the 2nd stack's duration is refreshed, increase all nearby party members' All Elemental DMG Bonus by 8% for every 1,000 DEF the equipping character has, up to a maximum of 25.6%, for 15s.\u003c/p\u003e\u003cp\u003e◆ During the event wish \"Epitome Invocation,\" the event-exclusive 5-star weapon Peak Patrol Song (Sword) will receive a huge drop-rate boost!\u003c/p\u003e\u003cp\u003eSturdy Bone (4-Star Sword)\u003c/p\u003e\u003cp\u003eSprint or Alternate Sprint Stamina Consumption decreased by 15%. Additionally, after using Sprint or Alternate Sprint, Normal Attack DMG is increased by 16% of ATK. This effect expires after triggering 18 times or 7s.\u003c/p\u003e\u003cp\u003e◆ During the event wish \"Epitome Invocation,\" the event-exclusive 4-star weapon Sturdy Bone (Sword) will receive a huge drop-rate boost!\u003c/p\u003e\u003cp\u003eMountain-Bracing Bolt (4-Star Polearm)\u003c/p\u003e\u003cp\u003eDecreases Climbing Stamina Consumption by 15% and increases Elemental Skill DMG by 12%. Also, after other nearby party members use Elemental Skills, the equipping character's Elemental Skill DMG will also increase by 12% for 8s.\u003c/p\u003e\u003cp\u003e◆ During the event wish \"Epitome Invocation,\" the event-exclusive 4-star weapon Mountain-Bracing Bolt (Polearm) will receive a huge drop-rate boost!\u003c/p\u003e\u003cp\u003eFruitful Hook (4-Star Claymore)\u003c/p\u003e\u003cp\u003eIncrease Plunging Attack CRIT Rate by 16%; After a Plunging Attack hits an opponent, Normal, Charged, and Plunging Attack DMG increased by 16% for 10s.\u003c/p\u003e\u003cp\u003e◆ During the event wish \"Epitome Invocation,\" the event-exclusive 4-star weapon Fruitful Hook (Claymore) will receive a huge drop-rate boost!\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003eIII. New Main Story\u003c/p\u003e\u003cp\u003e1. New Archon Quests\u003c/p\u003e\u003cp\u003eArchon Quest Chapter V: Act III \"Beyond the Smoke and Mirrors\"\u003c/p\u003e\u003cp\u003ePermanently available after the Version 5.1 update\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e◆ Quest Unlock Criteria:\u003c/p\u003e\u003cp\u003e• Reach Adventure Rank 28 or above\u003c/p\u003e\u003cp\u003e• Complete Archon Quest Chapter V: Act II \"Black Stone Under a White Stone\"\u003c/p\u003e\u003cp\u003e• The \"Focused Experience Mode\" function is available for this quest.\u003c/p\u003e\u003cp\u003eArchon Quest Chapter V: Act IV \"The Rainbow Destined to Burn\"\u003c/p\u003e\u003cp\u003ePermanently available after the Version 5.1 update\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e◆ Quest Unlock Criteria:\u003c/p\u003e\u003cp\u003e• Reach Adventure Rank 28 or above\u003c/p\u003e\u003cp\u003e• Complete Archon Quest Chapter V: Act III \"Beyond the Smoke and Mirrors\"\u003c/p\u003e\u003cp\u003e• The \"Focused Experience Mode\" function is available for this quest.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e2. New Tribal Chronicle Quest\u003c/p\u003e\u003cp\u003eA Prayer for Blessings, Told to Crested Peaks\u003c/p\u003e\u003cp\u003eAct III of \"A Prayer for Blessings, Told to Crested Peaks\" will be permanently available after the Version 5.1 update\u003c/p\u003e\u003cp\u003e◆ Act III Quest Unlock Criteria:\u003c/p\u003e\u003cp\u003e• Adventure Rank 28 or above\u003c/p\u003e\u003cp\u003e• Complete \"A Fuel Named 'Fate'\" in the Archon Quest \"The Rainbow Destined to Burn\"\u003c/p\u003e\u003cp\u003e• Complete Act I and Act II of the Tribal Chronicles Quest \"A Prayer for Blessings, Told to Crested Peaks\"\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003eYou can use the \"Quick Start\" function to accept and progress through Archon Quest Chapter V: Act I \"Flowers Resplendent on the Sun-Scorched Sojourn\" while maintaining your current progress in the existing Archon Quests. After using the \"Quick Start\" function to complete Archon Quest Chapter V: Act I, you can continue to accept and complete the subsequent Acts of Chapter V until you unlock the latest Archon Quest or Tribal Chronicles introduced in the current version update.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003eIV. New Enemies\u003c/p\u003e\u003cp\u003eSecret Source Automaton: Configuration Device\u003c/p\u003e\u003cp\u003e◇ A machine with terrifying destructive capabilities.\u003c/p\u003e\u003cp\u003eWhen characters enter and maintain the Nightsoul's Blessing state, the Secret Source Automaton: Configuration Device will start progressing through its Adaptive Countermeasures. Once those are complete, the Configuration Device will start preparing its Boltsphere Cannon. During this time, the Configuration Device will start up its Accretion Mechanism to dig into Solid Phlogiston and collect phlogiston. The Accretion Mechanism will generate an energy field. If you wish to destroy the Mechanism and interrupt the charging of the Boltsphere Cannon, you must first climb the Solid Phlogiston and enter the energy field.\u003c/p\u003e\u003cp\u003eLocated at Toyac Springs.\u003c/p\u003e\u003cp\u003eTenebrous Mimiflora\u003c/p\u003e\u003cp\u003e◇ An Abyssal monster that has descended to this world from the deep, dark depths of a twisted and alien world, the Tenebrous Mimiflora can mimic various phenomena.\u003c/p\u003e\u003cp\u003eThe Tenebrous Mimiflora can deploy a Void Ward in combat. Some of its attacks can cause stackable Attrition that, after a time, will cause your active character to lose HP. Use a specific number of Elemental attacks to destroy this creature's Ward. Nightsoul-aligned Elemental attacks can break through its defenses more effectively.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003eV. Other Update Details\u003c/p\u003e\u003cp\u003eNew Recipes:\u003c/p\u003e\u003cp\u003e○ Cipac (Natlan NPC): BBQ Beef Heart Skewers\u003c/p\u003e\u003cp\u003e○ Natlan's Zakan's Street Bites: Xocoatl\u003c/p\u003e\u003cp\u003eNew Character Specialty Dish:\u003c/p\u003e\u003cp\u003e○ Xilonen's specialty: Fruit-Flavored Milk Candies\u003c/p\u003e\u003cp\u003eAdds new Achievements to the \"Wonders of the World\" category.\u003c/p\u003e\u003cp\u003eAdds Set 35 of \"Paimon's Paintings\" chat emojis.\u003c/p\u003e\u003cp\u003eNew Namecards:\u003c/p\u003e\u003cp\u003e\"Xilonen: Cue Point\": Reward for reaching Friendship Lv. 10 with Xilonen\u003c/p\u003e\u003cp\u003e\"Travel Notes: Sabzeruz\": Reward obtained via the BP system\u003c/p\u003e\u003cp\u003e\"Genius Invokation TCG\" Gameplay Update:\u003c/p\u003e\u003cp\u003eNew Character Card: Chiori and her corresponding Talent card. Corresponding invitation duel and guest challenges have been added to the Player List.\u003c/p\u003e\u003cp\u003eNew Character Cards: Eremite Floral Ring-Dancer, Abyss Lector: Violet Lightning, and their corresponding Talent cards. Their Tavern Challenges have also been added.\u003c/p\u003e\u003cp\u003eNew Action Cards: \"Portable Power Saw,\" \"Conductor's Top Hat,\" \"Tepetlisaurus,\" \"Stage Tepetl,\" \"Eremite Teatime,\" and \"Saurus Crackers\" can be purchased from Prince at The Cat's Tail.\u003c/p\u003e\u003cp\u003eThe Forge Realm's Temper is once again available. The theme of this edition is \"The Forge Realm's Temper: Clever Stratagems\":\u003c/p\u003e\u003cp\u003e1. During The Forge Realm's Temper: Clever Stratagems, you can select the parameters for each stage. Parameters that may be set include: stage difficulty, enemy health, and the round limit for the match.\u003c/p\u003e\u003cp\u003e2. After completing the challenge, points will be obtained based on the difficulty completed for each parameter. The best score obtained for each stage will be recorded, and will allow you to claim rewards that correspond to certain scores.\u003c/p\u003e\u003cp\u003eImaginarium Theater\u003c/p\u003e\u003cp\u003eAfter the Version 5.1 update, the new season of \"Imaginarium Theater\" will be available on November 1.\u003c/p\u003e\u003cp\u003eRequired Elemental Types: Pyro, Electro, and Dendro\u003c/p\u003e\u003cp\u003eOpening Characters: Klee, Xinyan, Yae Miko, Dori, Tighnari, and Kirara\u003c/p\u003e\u003cp\u003eWhen Imaginarium Theater is open, the corresponding Opening Characters will obtain Fantastical Blessings.\u003c/p\u003e\u003cp\u003eSpecial Guest Stars: Xilonen, Chiori, Xingqiu, and Layla\u003c/p\u003e\u003cp\u003eAfter the first season of Imaginarium Theater begins, the characters Kaedehara Kazuha, Eula, Gorou, and Candace will each gain a new \"Thespian Trick\" that can be exchanged from the NPC Wolfy.\u003c/p\u003e\u003cp\u003eEnvisaged Echoes Gameplay Update:\u003c/p\u003e\u003cp\u003eAfter the version update, new challenge stages and Echo cosmetics for Zhongli and Keqing will be added.\u003c/p\u003e\u003cp\u003eSpiral Abyss\u003c/p\u003e\u003cp\u003e○ The content for the first phase (updated on October 16) is as follows:\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e◆ Floor 11 Ley Line Disorder changed to:\u003c/p\u003e\u003cp\u003e• All party members gain a 75% Geo DMG Bonus.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e◆ Updated the monster lineup on Floors 11 – 12 of the Spiral Abyss.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e◆ Blessing of the Abyssal Moon:\u003c/p\u003e\u003cp\u003eRugged Moon\u003c/p\u003e\u003cp\u003eAfter a character uses an Elemental Skill, said character's DEF increases by 60% for 9s.\u003c/p\u003e\u003cp\u003e○ The content for the second phase (updated on November 16) is as follows:\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e◆ Floor 11 Ley Line Disorder changed to:\u003c/p\u003e\u003cp\u003e• All party members gain a 60% Geo DMG Bonus.\u003c/p\u003e\u003cp\u003e• All party members gain a 60% Pyro DMG Bonus.\u003c/p\u003e\u003cp\u003e◆ Updated the monster lineup on Floors 11 – 12 of the Spiral Abyss.\u003c/p\u003e\u003cp\u003e◆ Blessing of the Abyssal Moon:\u003c/p\u003e\u003cp\u003eVigorous Moon\u003c/p\u003e\u003cp\u003eAfter the current active character's Charged Attack hits an opponent, said character's ATK increases by 20% for 8s. Max 4 stacks, each stack has an independent duration.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003eDue to recording arrangements, some content in Version 5.1 does not have English voice-overs. We sincerely apologize for the inconvenience caused.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e〓Adjustments \u0026amp; Optimizations〓\u003c/p\u003e\u003cp\u003e● Enemies\u003c/p\u003e\u003cp\u003eAdjusts the damage judgment timing of the skill \"Rock Swings\" unleashed by the enemy \"Eroding Avatar of Lava\" to better match its animation.\u003c/p\u003e\u003cp\u003eAdjusts the position of the related special effects when the enemy \"Goldflame Qucusaur Tyrant\" triggers a Burning reaction.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e● Settings\u003c/p\u003e\u003cp\u003eOther than the \"Settings/Others\" interface, you can now also set whether to \"Allow Auto Adding of 5-Star Artifacts as Enhancement Materials\" in the \"Input Settings\" on the Artifact enhancement interface.\u003c/p\u003e\u003cp\u003eOther than the \"Settings/Others\" interface, you can now also set whether to \"Auto-Lock 4-Star Weapons\" in the \"Inventory \u0026gt; Weapons\" interface.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e● Spiral Abyss\u003c/p\u003e\u003cp\u003eWhen opening the \"Spiral Abyss\" interface, if you have completed the \"Abyss Corridor\" (i.e., Floors 1–8 of the Spiral Abyss) with full stars, the \"Abyssal Moon Spire\" interface will open directly (i.e., Floors 9–12).\u003c/p\u003e\u003cp\u003eAdds the Spiral Abyss skip function. After the Spiral Abyss update on October 16:\u003c/p\u003e\u003cp\u003ea. If you have completed Floor 11 in the previous Cycle of the Spiral Abyss at full stars, then after the Spiral Abyss update, you can claim the full star rewards for Floor 9 of the current Spiral Abyss.\u003c/p\u003e\u003cp\u003eb. After completing Floor 12 of the Spiral Abyss with full stars, you can claim the full star rewards for Floor 9 and Floor 10 of the current Spiral Abyss.\u003c/p\u003e\u003cp\u003e*You can claim all Chamber Bounties for the skipped floors directly via the review pop-up. However, the Primogem rewards from Star's Bounty will still need to be claimed manually.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e● Enhancement and Forging-related\u003c/p\u003e\u003cp\u003eThe \"Source\" for character ascension materials, character and weapon enhancement materials, character talent materials, and weapon ascension materials will now display the quantity that can be crafted.\u003c/p\u003e\u003cp\u003eThe \"Crafting\" interface now allows you to filter the required materials based on the character. After selecting a character, you can further filter by their skills, ascension level, and the weapons they are equipped with.\u003c/p\u003e\u003cp\u003eWhen clicking on Stardust Exchange for the \"Source\" of high-rarity character and weapon enhancement materials, if the currently available materials of the same rarity have been completely exchanged, it will automatically switch to similar materials of a lower rarity.\u003c/p\u003e\u003cp\u003eOptimizes the interactive experience in the Crafting, Forge, and Creation/Furnishings interfaces:\u003c/p\u003e\u003cp\u003ea. After performing the relevant crafting operation, the icon position of the selected crafted item will no longer change.\u003c/p\u003e\u003cp\u003eb. After performing the relevant crafting operation, the refresh effect for the item list will no longer play.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e● Other Systems\u003c/p\u003e\u003cp\u003eOptimizes the layout and user experience of the pop-up interface for Character Talent Materials and Weapon Ascension Materials in the relevant bundles for \"Battle Pass\" and \"Bundles.\"\u003c/p\u003e\u003cp\u003eAdjusts the design of the \"Character \u0026gt; Level Up Talent\" pop-up, and increases the animation speed to optimize the experience when upgrading talents.\u003c/p\u003e\u003cp\u003eAdjusts the order of \"Adventurer Handbook \u0026gt; Domain \u0026gt; Trounce Domain\": the \"Trounce Domain\" tab will now be arranged based on \"new to old\" and \"unlocked and locked\" status.\u003c/p\u003e\u003cp\u003eAdjusts the default page of the \"Adventurer Handbook\": if you have completed the content on the \"Experience\" tab, while the \"Commissions\" or \"Guide\" tab still has incomplete content, the first time you log in and open the \"Adventurer Handbook,\" it will open the \"Commissions\" or \"Guide\" page.\u003c/p\u003e\u003cp\u003e\"Character \u0026gt; Artifact\" Interface Function Optimizations:\u003c/p\u003e\u003cp\u003ea. Records the Artifact set filters and affixes sorting that you set for a specific character, and when entering the interface again, the Artifacts will be displayed based on the previous filter and sorting settings.\u003c/p\u003e\u003cp\u003eb. Adds a new button at the bottom of the Artifacts list in this interface to switch between set filtering and non-set filtering states.\u003c/p\u003e\u003cp\u003ec. The selected Artifact affix sorting option will now be displayed directly at the bottom of the interface.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e● Audio\u003c/p\u003e\u003cp\u003eRemoves audio resources from earlier versions. After the Version 5.1 update, the audio files will occupy less space compared to Version 5.0.\u003c/p\u003e\u003cp\u003eOptimizes the interactive sound effects of certain system interfaces and fixes issues with missing sound effects for some open world objects.\u003c/p\u003e\u003cp\u003eAdjusts the volume of music in certain areas in Natlan.\u003c/p\u003e\u003cp\u003eOptimizes the sound attenuation effect when the enemy \"Goldflame Qucusaur Tyrant\" is in flight.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e● Other\u003c/p\u003e\u003cp\u003eAdds support for opening multiple \"Domain Reliquaries\" simultaneously in batches.\u003c/p\u003e\u003cp\u003eUpdates the blocking strategy for certain spam and advertising behaviors.\u003c/p\u003e\u003cp\u003eAdjusts the appearance and position of special effects when triggering \"Brilliant Blessings\" in \"Imaginarium Theater\" battles.\u003c/p\u003e\u003cp\u003eAdjusts the effect descriptions of some \"Brilliant Blessings\" in \"Imaginarium Theater\" (the actual effect remains the same).\u003c/p\u003e\u003cp\u003eWhen selecting events in \"Imaginarium Theater,\" you can now switch to other events by clicking on either side of the screen or using the controller buttons.\u003c/p\u003e\u003cp\u003eUpdates the tutorial for \"Saurian Indwelling\" to include explanations regarding how to disengage from the \"indwelling\" state.\u003c/p\u003e\u003cp\u003eAdjusts certain dialogue text in the Commission Quest \"Tending to a Tepetlisaurus.\"\u003c/p\u003e\u003cp\u003eDue to the unclear completion status of Monetoo-related graffiti in the Sulfurous Veins area of Natlan, the special effects of this graffiti will be optimized after the version update to: the related graffiti will be removed after completing the gameplay.\u003c/p\u003e\u003cp\u003eImproves the issue whereby Mualani's attacks would miss during the preparation for the Sharky's Surging Bite due to changes in enemy positioning. The developers will continue to monitor this character's performance in battle and we welcome feedback from Travelers.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e〓Bug Fixes〓\u003c/p\u003e\u003cp\u003e● Quests\u003c/p\u003e\u003cp\u003eFixes an issue whereby there is a chance that the character would become stuck and unable to be controlled when leaving the quest area while completing the objective \"Collect Contending Sparks\" of the Archon Quest \"Pilgrimage of the Return of the Sacred Flame\" under certain circumstances.\u003c/p\u003e\u003cp\u003eFixes an issue whereby defeating the relevant enemies during the World Quest \"Blackcliff Woes\" for the objective \"Patrol the Chasm's perimeter\" would prevent subsequent objectives from being completed.\u003c/p\u003e\u003cp\u003eFixes an issue in related World Quests whereby the scarf on the Saurian companion's tail was missing animation effects.\u003c/p\u003e\u003cp\u003eFixes an issue in the the World Quest \"Revelations from the Past\" whereby scenes or special effects would be appear to be abnormal when switching to Little One's point of view (little Tepetlisaurus) or switching back to the character's point of view under certain circumstances.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e● Enemies\u003c/p\u003e\u003cp\u003eFixes an issue in Co-Op Mode whereby the enemy \"Goldflame Qucusaur Tyrant\" would appear in an abnormal position when entering combat under certain circumstances.\u003c/p\u003e\u003cp\u003eFixes an issue in Co-Op Mode whereby the enemy \"Goldflame Qucusaur Tyrant\" would abnormally disappear under certain circumstances.\u003c/p\u003e\u003cp\u003eFixes an issue whereby the character could be stuck in the Plunging Attack state for a long time if the character was pushed to the barrier at the edge of the battlefield by the enemy while challenging the opponent \"Goldflame Qucusaur Tyrant\" (After the fix, the duration of the Plunging Attack state will be greatly reduced when the character is pushed against the barrier at the edge of the battlefield by the enemy).\u003c/p\u003e\u003cp\u003eFixes an issue whereby the achievement \"Love and Non-Communication\" could not be completed when repeatedly challenging the enemy \"Thunder Manifestation\" under certain circumstances.\u003c/p\u003e\u003cp\u003eFixes an issue whereby some characters' skill effects may not appear normally or disappear when the enemy \"Ichcahuipilli's Aegis\" exiles the character to the \"Land of Decision.\"\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e● Characters\u003c/p\u003e\u003cp\u003eFixes an issue whereby the special effects would flicker and shake abnormally at the edge of the camera when Furina used her Elemental Burst in Natlan.\u003c/p\u003e\u003cp\u003eFixes an issue whereby the low-altitude and high-altitude landing impact effects would both appear simultaneously when Navia performed a Plunging Attack and hits the ground.\u003c/p\u003e\u003cp\u003eFixes an issue whereby the special movement duration of Mualani or Kachina in their Nightsoul's Blessing state would be abnormal under certain circumstances.\u003c/p\u003e\u003cp\u003eFixes an issue whereby there was a chance that Mualani would abnormally take fall damage when performing Sharky's Bite in the Nightsoul's Blessing state under certain circumstances.\u003c/p\u003e\u003cp\u003eFixes an issue whereby when Kinich had less than 1 second remaining in the Nightsoul's Blessing state and used the \"Scalespiker Cannon,\" the cooldown time displayed for the Elemental Skill button would become abnormal after the Nightsoul's Blessing state ended.\u003c/p\u003e\u003cp\u003eFixes an issue whereby the relevant weather animation effect will end earlier before the skill ends when holding Kinich's Elemental Skill, \"Scalespiker Cannon\".\u003c/p\u003e\u003cp\u003eFixes an issue whereby when Kinich uses his Elemental Skill to swing in mid-air and simultaneously executes a Normal Attack, it can result in an abnormal vertical jump.\u003c/p\u003e\u003cp\u003eThe developers will continue to monitor other actions that may cause this character to perform abnormal vertical jumps. If there are any subsequent plans for adjustments and corrections, we will notify Travelers via announcements.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e● System\u003c/p\u003e\u003cp\u003eFixes an issue whereby completing Act 8 in \"Imaginarium Theater\" in Visionary Mode and finishing the finalization did not allow the corresponding Battle Pass mission to be completed.\u003c/p\u003e\u003cp\u003eFixes an issue whereby in the \"Forge\" interface, the daily crafting quantity would still be deducted even if forging weapon enhancement materials failed due to insufficient required materials under certain circumstances.\u003c/p\u003e\u003cp\u003eFixes an issue under certain circumstances whereby the challenge interface would not record the \"Best Score\" even if you had completed the \"Rock Hopping\" challenge in the Natlan region.\u003c/p\u003e\u003cp\u003eFixes an issue whereby the game would not pause when tracking enemies from the \"Adventurer Handbook \u0026gt; Enemies\" tab or jumping to the \"Map\" from material sources in Single-Player Mode.\u003c/p\u003e\u003cp\u003eFixes an issue resulting in the food \"Strength Tonic\" not being displayed in \"Archive \u0026gt; Materials/Food and Potions.\"\u003c/p\u003e\u003cp\u003eFixes an issue whereby the filter applied to the \"Food\" tab in the \"Inventory\" interface also took effect for the \"Food\" tab of the \"Parametric Transformer.\"\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e● Audio\u003c/p\u003e\u003cp\u003eFixes an issue whereby the volume of certain movement sound effects for characters was abnormal after the Version 5.0 update.\u003c/p\u003e\u003cp\u003eFixes text and voice-over errors in Chinese and Korean regarding the \"Long-Necked Rhino\" in the Archon Quest \"Flowers Resplendent on the Sun-Scorched Sojourn\" (the Japanese and English voice-over will be fixed in subsequent versions).\u003c/p\u003e\u003cp\u003eFixes an issue whereby there were errors with the Chinese voice-overs during some quests.\u003c/p\u003e\u003cp\u003eFixes an issue whereby the relevant voice lines would not trigger correctly when obtaining Gaming for the first time through a wish.\u003c/p\u003e\u003cp\u003eFixes an issue whereby the English voice-over of Kinich and Ajaw's interaction does not synchronize with the idle animation.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e● Other\u003c/p\u003e\u003cp\u003eFixes an issue with the visual effects of the Wildlife \"Pyro Crystalfly\" and \"Coral Butterfly\" appearing abnormally.\u003c/p\u003e\u003cp\u003eFixes an issue whereby certain wildlife like the \"Flying Squirrel\" could not be captured.\u003c/p\u003e\u003cp\u003eFixes an issue on PlayStation®4 and PlayStation®5 whereby the pre-discount price of some currency for \"Gnostic Chorus\" was displayed incorrectly (the post-discount actual price and the amount deducted were not affected).\u003c/p\u003e\u003cp\u003eAdjusts the names of some \"shield\" effects to \"Ward\" in the \"Tutorial\" menu and other interfaces in languages other than Simplified Chinese (this issue was fixed for Simplified Chinese in Version 5.0).\u003c/p\u003e\u003cp\u003eFixes an issue whereby after indwelling a Koholasaur, it would not consume Phlogiston when performing a Aquadash under certain circumstances.\u003c/p\u003e\u003cp\u003eFixes an issue whereby after collecting \"Flamegranates\" while indwelling and controlling a Yumkasaur, the Yumkasaur could continuously leap upward in the air under certain circumstances.\u003c/p\u003e\u003cp\u003eFixes an issue whereby the effect \"Surprise: Explosive Excitement\" from \"Mystery Caches\" in \"Imaginarium Theater\" did not activate correctly under certain circumstances.\u003c/p\u003e\u003cp\u003eFixes an issue whereby the game would experience an abnormal black screen and become unresponsive after the character teleported to the Obsidian Totem Pole: \"Children of Echoes\" when playing on certain PC devices.\u003c/p\u003e\u003cp\u003eFixes an issue whereby the character's shadow effects would display abnormally in Natlan when playing on certain Android devices.\u003c/p\u003e\u003cp\u003eFixes an issue on certain Android devices whereby when controlling and indwelling Saurians in Natlan, there is a chance that the Saurian's model would display abnormally when the camera zoomed in on it.\u003c/p\u003e\u003cp\u003eFixes an issue whereby the treasure chest would not appear correctly after picking up the \"Apple\" and investigating the related location near a Teleport Waypoint in Natlan under certain circumstances.\u003c/p\u003e\u003cp\u003eFixes\u0026nbsp;some\u0026nbsp;text\u0026nbsp;errors\u0026nbsp;in\u0026nbsp;certain\u0026nbsp;languages\u0026nbsp;and\u0026nbsp;optimizes\u0026nbsp;text.\u0026nbsp;(Note:\u0026nbsp;Related\u0026nbsp;in-game\u0026nbsp;functions\u0026nbsp;have\u0026nbsp;not\u0026nbsp;changed.\u0026nbsp;Travelers\u0026nbsp;can\u0026nbsp;view\u0026nbsp;the\u0026nbsp;changes\u0026nbsp;in\u0026nbsp;different\u0026nbsp;languages\u0026nbsp;by\u0026nbsp;going\u0026nbsp;to\u0026nbsp;the\u0026nbsp;Paimon\u0026nbsp;Menu\u0026nbsp;\u0026gt;\u0026nbsp;Settings\u0026nbsp;\u0026gt;\u0026nbsp;Language\u0026nbsp;and\u0026nbsp;changing\u0026nbsp;the\u0026nbsp;Game\u0026nbsp;Language.)\u003c/p\u003e\u003cp\u003e◆\u0026nbsp;Optimizes\u0026nbsp;inconsistencies\u0026nbsp;between\u0026nbsp;certain\u0026nbsp;voice-overs\u0026nbsp;and\u0026nbsp;the\u0026nbsp;corresponding\u0026nbsp;lines.\u003c/p\u003e\u003cp\u003e◆\u0026nbsp;Optimizes\u0026nbsp;certain\u0026nbsp;English\u0026nbsp;translations.\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e〓Genius Invokation TCG Balance Adjustment〓\u003c/p\u003e\u003cp\u003eRedesigns the Character Card \"Eremite Scorching Loremaster\" (Travelers can visit the official notice \"Version 5.1 Genius Invokation TCG Update Details\" or log into the game after the version update to see the changes).\u003c/p\u003e\u003cp\u003eAdjusts the effects of the Character Card \"Guardian of Apep's Oasis\"'s Passive Skill: The number of Awaken, My Kindred generated at the start of the match has been reduced from 6 to 5; the shield generated after summoning 4 Proliferated Organisms has been reduced from 2 points to 1 point.\u003c/p\u003e\u003cp\u003eAdjusts the effect of the Character Card \"Lisa\"'s Normal Attacks: Normal Attacks now apply Conductive to the enemy's active character (no longer requires a Charged Attack).\u003c/p\u003e\u003cp\u003eAdjusts the effect of the Character Card \"Lisa\"'s \"Conductive\" status: Now, \"when the character attached with Conductive takes DMG from Violet Arc or Lightning Rose,\" it will trigger \"Remove this status and DMG +1 for each stack of Conductive\" (previously, this effect could only be triggered by Violet Arc damage).\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\u003cp\u003e*This is a work of fiction and is not related to any actual people, events, groups, or organizations.\u003c/p\u003e\u003cp\u003e\"PlayStation\", \"PS5\", \"PS4\", \"DualSense\", \"DUALSHOCK\" are registered trademarks or trademarks of Sony Interactive Entertainment Inc.\u003c/p\u003e","cover":"","view_type":1,"created_at":1728428420,"images":[],"post_status":{"is_top":false,"is_good":false,"is_official":false,"is_vote":false,"is_quiz_vote":false,"is_demoted":false,"is_hot":false},"topic_ids":[],"view_status":1,"max_floor":251,"is_original":1,"republish_authorization":2,"reply_time":"2024-10-29 04:27:47","is_deleted":0,"is_interactive":false,"structured_content":"[{\"insert\":{\"image\":\"https://upload-os-bbs.hoyolab.com/upload/2024/10/08/0/20e288502dee30ce1a0210347a6c4102_3269712289995868092.jpeg\"},\"attributes\":{\"align\":\"img-center\",\"height\":390,\"width\":1080,\"size\":\"87271\"}},{\"insert\":\"Dear Traveler,\\nBelow are the details of the Version 5.1 update \\\"The Rainbow Destined to Burn\\\" and the update compensation.\\n\\n〓Compensation Details〓\\nMaintenance Compensation: Primogems ×300 (60 Primogems per hour the servers are down)\\nIssue Fix Compensation: Primogems ×300 (please refer to the relevant compensation mail for more details)\\n\\n〓Scope of Compensation〓\\nMaintenance Compensation: Travelers who have reached Adventure Rank 5 or above by 2024/10/09 06:00 (UTC+8).\\nCompensation must be claimed before the end of Version 5.1.\\n\\n\\nIssue Fix Compensation: Travelers who have reached Adventure Rank 5 or above by 2024/10/09 06:00 (UTC+8).\\nPlease log in and claim your compensation before 2024/10/12 06:00 (UTC+8).\\n\\nOur developers will distribute compensation to Travelers via in-game mail within 5 hours after the update maintenance is finished. The mail will expire after 30 days, so don't forget to claim the attached compensation in time.\\n\\n〓Update Schedule〓\\nUpdate maintenance begins 2024/10/09 06:00 (UTC+8) and is estimated to take 5 hours.\\n\\n\\n〓How to Update Game Client〓\\nPC: Close the game, open the Genshin Impact Launcher, and click Update.\\niOS: Open the App Store and tap Update.\\nAndroid: Open the game and follow the directions on-screen.\\nPS5™ and PS4™: Highlight Genshin Impact from the Home Screen, press the OPTIONS button and select \\\"Check for Update.\\\"\\nPlease do not hesitate to contact Customer Service if you encounter any issues installing the new version. We will do our very best to resolve the issue.\\n\\n〓Update Details〓\\nI. New Character\\n5-Star Character \\\"Ardent Flames Forge the Soul\\\" Xilonen (Geo)\\n◇ Vision: Geo\\n◇ Weapon: Sword\\n◇ A Name Engraver of the Nanatzcayan, she is especially skilled at finding a good balance between the heavy responsibilities of her job and living well.\\n\\n◆ Elemental Skill: Yohual's Scratch\\n◇ Source Samples: Xilonen has 3 Geo Samplers with her that can generate different Soundscapes based on her other party members' Elemental Types (Pyro/Hydro/Cryo/Electro). Different Soundscapes can result in Elemental Skills and Bursts to produce various effects, and decrease nearby opponents' corresponding Elemental RES while active.\\n◇ After unleashing her Elemental Skill, Xilonen will enter the Nightsoul's Blessing state and switch to the Blade Roller mode. While in this mode, Xilonen's Normal Attacks will allow her to perform consecutive kicks using her roller blades. She can also engage in swift movement and climbing, and activate her Geo Samplers. After unlocking the Talent \\\"Netotiliztli's Echoes,\\\" different Soundscapes will enhance Xilonen's Normal and Plunging Attacks: either by gaining Nightsoul points upon hitting enemies or by increasing the DMG dealt by Normal and Plunging Attacks. When Nightsoul points reach the maximum, all Samplers will be activated.\\n◆ Elemental Burst: Ocelotlicue Point!\\n◇ Deals AoE Geo DMG to opponents and based on different Soundscapes: Restores HP for nearby active characters or deals additional AoE Geo DMG.\\n\\nII. New Equipment\\n1. New Weapons (Examples based on Refinement Rank 1)\\nPeak Patrol Song (5-Star Sword)\\nGain \\\"Ode to Flowers\\\" after Normal or Plunging Attacks hit an opponent: DEF increases by 8% and gain a 10% All Elemental DMG Bonus for 6s. Max 2 stacks. Can trigger once per 0.1s. When this effect reaches 2 stacks or the 2nd stack's duration is refreshed, increase all nearby party members' All Elemental DMG Bonus by 8% for every 1,000 DEF the equipping character has, up to a maximum of 25.6%, for 15s.\\n◆ During the event wish \\\"Epitome Invocation,\\\" the event-exclusive 5-star weapon Peak Patrol Song (Sword) will receive a huge drop-rate boost!\\nSturdy Bone (4-Star Sword)\\nSprint or Alternate Sprint Stamina Consumption decreased by 15%. Additionally, after using Sprint or Alternate Sprint, Normal Attack DMG is increased by 16% of ATK. This effect expires after triggering 18 times or 7s.\\n◆ During the event wish \\\"Epitome Invocation,\\\" the event-exclusive 4-star weapon Sturdy Bone (Sword) will receive a huge drop-rate boost!\\nMountain-Bracing Bolt (4-Star Polearm)\\nDecreases Climbing Stamina Consumption by 15% and increases Elemental Skill DMG by 12%. Also, after other nearby party members use Elemental Skills, the equipping character's Elemental Skill DMG will also increase by 12% for 8s.\\n◆ During the event wish \\\"Epitome Invocation,\\\" the event-exclusive 4-star weapon Mountain-Bracing Bolt (Polearm) will receive a huge drop-rate boost!\\nFruitful Hook (4-Star Claymore)\\nIncrease Plunging Attack CRIT Rate by 16%; After a Plunging Attack hits an opponent, Normal, Charged, and Plunging Attack DMG increased by 16% for 10s.\\n◆ During the event wish \\\"Epitome Invocation,\\\" the event-exclusive 4-star weapon Fruitful Hook (Claymore) will receive a huge drop-rate boost!\\n\\nIII. New Main Story\\n1. New Archon Quests\\nArchon Quest Chapter V: Act III \\\"Beyond the Smoke and Mirrors\\\"\\nPermanently available after the Version 5.1 update\\n\\n◆ Quest Unlock Criteria:\\n• Reach Adventure Rank 28 or above\\n• Complete Archon Quest Chapter V: Act II \\\"Black Stone Under a White Stone\\\"\\n• The \\\"Focused Experience Mode\\\" function is available for this quest.\\nArchon Quest Chapter V: Act IV \\\"The Rainbow Destined to Burn\\\"\\nPermanently available after the Version 5.1 update\\n\\n◆ Quest Unlock Criteria:\\n• Reach Adventure Rank 28 or above\\n• Complete Archon Quest Chapter V: Act III \\\"Beyond the Smoke and Mirrors\\\"\\n• The \\\"Focused Experience Mode\\\" function is available for this quest.\\n\\n2. New Tribal Chronicle Quest\\nA Prayer for Blessings, Told to Crested Peaks\\nAct III of \\\"A Prayer for Blessings, Told to Crested Peaks\\\" will be permanently available after the Version 5.1 update\\n◆ Act III Quest Unlock Criteria:\\n• Adventure Rank 28 or above\\n• Complete \\\"A Fuel Named 'Fate'\\\" in the Archon Quest \\\"The Rainbow Destined to Burn\\\"\\n• Complete Act I and Act II of the Tribal Chronicles Quest \\\"A Prayer for Blessings, Told to Crested Peaks\\\"\\n\\nYou can use the \\\"Quick Start\\\" function to accept and progress through Archon Quest Chapter V: Act I \\\"Flowers Resplendent on the Sun-Scorched Sojourn\\\" while maintaining your current progress in the existing Archon Quests. After using the \\\"Quick Start\\\" function to complete Archon Quest Chapter V: Act I, you can continue to accept and complete the subsequent Acts of Chapter V until you unlock the latest Archon Quest or Tribal Chronicles introduced in the current version update.\\n\\nIV. New Enemies\\nSecret Source Automaton: Configuration Device\\n◇ A machine with terrifying destructive capabilities.\\nWhen characters enter and maintain the Nightsoul's Blessing state, the Secret Source Automaton: Configuration Device will start progressing through its Adaptive Countermeasures. Once those are complete, the Configuration Device will start preparing its Boltsphere Cannon. During this time, the Configuration Device will start up its Accretion Mechanism to dig into Solid Phlogiston and collect phlogiston. The Accretion Mechanism will generate an energy field. If you wish to destroy the Mechanism and interrupt the charging of the Boltsphere Cannon, you must first climb the Solid Phlogiston and enter the energy field.\\nLocated at Toyac Springs.\\nTenebrous Mimiflora\\n◇ An Abyssal monster that has descended to this world from the deep, dark depths of a twisted and alien world, the Tenebrous Mimiflora can mimic various phenomena.\\nThe Tenebrous Mimiflora can deploy a Void Ward in combat. Some of its attacks can cause stackable Attrition that, after a time, will cause your active character to lose HP. Use a specific number of Elemental attacks to destroy this creature's Ward. Nightsoul-aligned Elemental attacks can break through its defenses more effectively.\\n\\nV. Other Update Details\\nNew Recipes:\\n○ Cipac (Natlan NPC): BBQ Beef Heart Skewers\\n○ Natlan's Zakan's Street Bites: Xocoatl\\nNew Character Specialty Dish:\\n○ Xilonen's specialty: Fruit-Flavored Milk Candies\\nAdds new Achievements to the \\\"Wonders of the World\\\" category.\\nAdds Set 35 of \\\"Paimon's Paintings\\\" chat emojis.\\nNew Namecards:\\n\\\"Xilonen: Cue Point\\\": Reward for reaching Friendship Lv. 10 with Xilonen\\n\\\"Travel Notes: Sabzeruz\\\": Reward obtained via the BP system\\n\\\"Genius Invokation TCG\\\" Gameplay Update:\\nNew Character Card: Chiori and her corresponding Talent card. Corresponding invitation duel and guest challenges have been added to the Player List.\\nNew Character Cards: Eremite Floral Ring-Dancer, Abyss Lector: Violet Lightning, and their corresponding Talent cards. Their Tavern Challenges have also been added.\\nNew Action Cards: \\\"Portable Power Saw,\\\" \\\"Conductor's Top Hat,\\\" \\\"Tepetlisaurus,\\\" \\\"Stage Tepetl,\\\" \\\"Eremite Teatime,\\\" and \\\"Saurus Crackers\\\" can be purchased from Prince at The Cat's Tail.\\nThe Forge Realm's Temper is once again available. The theme of this edition is \\\"The Forge Realm's Temper: Clever Stratagems\\\":\\n1. During The Forge Realm's Temper: Clever Stratagems, you can select the parameters for each stage. Parameters that may be set include: stage difficulty, enemy health, and the round limit for the match.\\n2. After completing the challenge, points will be obtained based on the difficulty completed for each parameter. The best score obtained for each stage will be recorded, and will allow you to claim rewards that correspond to certain scores.\\nImaginarium Theater\\nAfter the Version 5.1 update, the new season of \\\"Imaginarium Theater\\\" will be available on November 1.\\nRequired Elemental Types: Pyro, Electro, and Dendro\\nOpening Characters: Klee, Xinyan, Yae Miko, Dori, Tighnari, and Kirara\\nWhen Imaginarium Theater is open, the corresponding Opening Characters will obtain Fantastical Blessings.\\nSpecial Guest Stars: Xilonen, Chiori, Xingqiu, and Layla\\nAfter the first season of Imaginarium Theater begins, the characters Kaedehara Kazuha, Eula, Gorou, and Candace will each gain a new \\\"Thespian Trick\\\" that can be exchanged from the NPC Wolfy.\\nEnvisaged Echoes Gameplay Update:\\nAfter the version update, new challenge stages and Echo cosmetics for Zhongli and Keqing will be added.\\nSpiral Abyss\\n○ The content for the first phase (updated on October 16) is as follows:\\n\\n◆ Floor 11 Ley Line Disorder changed to:\\n• All party members gain a 75% Geo DMG Bonus.\\n\\n◆ Updated the monster lineup on Floors 11 – 12 of the Spiral Abyss.\\n\\n◆ Blessing of the Abyssal Moon:\\nRugged Moon\\nAfter a character uses an Elemental Skill, said character's DEF increases by 60% for 9s.\\n○ The content for the second phase (updated on November 16) is as follows:\\n\\n◆ Floor 11 Ley Line Disorder changed to:\\n• All party members gain a 60% Geo DMG Bonus.\\n• All party members gain a 60% Pyro DMG Bonus.\\n◆ Updated the monster lineup on Floors 11 – 12 of the Spiral Abyss.\\n◆ Blessing of the Abyssal Moon:\\nVigorous Moon\\nAfter the current active character's Charged Attack hits an opponent, said character's ATK increases by 20% for 8s. Max 4 stacks, each stack has an independent duration.\\n\\nDue to recording arrangements, some content in Version 5.1 does not have English voice-overs. We sincerely apologize for the inconvenience caused.\\n\\n〓Adjustments \u0026 Optimizations〓\\n● Enemies\\nAdjusts the damage judgment timing of the skill \\\"Rock Swings\\\" unleashed by the enemy \\\"Eroding Avatar of Lava\\\" to better match its animation.\\nAdjusts the position of the related special effects when the enemy \\\"Goldflame Qucusaur Tyrant\\\" triggers a Burning reaction.\\n\\n● Settings\\nOther than the \\\"Settings/Others\\\" interface, you can now also set whether to \\\"Allow Auto Adding of 5-Star Artifacts as Enhancement Materials\\\" in the \\\"Input Settings\\\" on the Artifact enhancement interface.\\nOther than the \\\"Settings/Others\\\" interface, you can now also set whether to \\\"Auto-Lock 4-Star Weapons\\\" in the \\\"Inventory \u003e Weapons\\\" interface.\\n\\n● Spiral Abyss\\nWhen opening the \\\"Spiral Abyss\\\" interface, if you have completed the \\\"Abyss Corridor\\\" (i.e., Floors 1–8 of the Spiral Abyss) with full stars, the \\\"Abyssal Moon Spire\\\" interface will open directly (i.e., Floors 9–12).\\nAdds the Spiral Abyss skip function. After the Spiral Abyss update on October 16:\\na. If you have completed Floor 11 in the previous Cycle of the Spiral Abyss at full stars, then after the Spiral Abyss update, you can claim the full star rewards for Floor 9 of the current Spiral Abyss.\\nb. After completing Floor 12 of the Spiral Abyss with full stars, you can claim the full star rewards for Floor 9 and Floor 10 of the current Spiral Abyss.\\n*You can claim all Chamber Bounties for the skipped floors directly via the review pop-up. However, the Primogem rewards from Star's Bounty will still need to be claimed manually.\\n\\n● Enhancement and Forging-related\\nThe \\\"Source\\\" for character ascension materials, character and weapon enhancement materials, character talent materials, and weapon ascension materials will now display the quantity that can be crafted.\\nThe \\\"Crafting\\\" interface now allows you to filter the required materials based on the character. After selecting a character, you can further filter by their skills, ascension level, and the weapons they are equipped with.\\nWhen clicking on Stardust Exchange for the \\\"Source\\\" of high-rarity character and weapon enhancement materials, if the currently available materials of the same rarity have been completely exchanged, it will automatically switch to similar materials of a lower rarity.\\nOptimizes the interactive experience in the Crafting, Forge, and Creation/Furnishings interfaces:\\na. After performing the relevant crafting operation, the icon position of the selected crafted item will no longer change.\\nb. After performing the relevant crafting operation, the refresh effect for the item list will no longer play.\\n\\n● Other Systems\\nOptimizes the layout and user experience of the pop-up interface for Character Talent Materials and Weapon Ascension Materials in the relevant bundles for \\\"Battle Pass\\\" and \\\"Bundles.\\\"\\nAdjusts the design of the \\\"Character \u003e Level Up Talent\\\" pop-up, and increases the animation speed to optimize the experience when upgrading talents.\\nAdjusts the order of \\\"Adventurer Handbook \u003e Domain \u003e Trounce Domain\\\": the \\\"Trounce Domain\\\" tab will now be arranged based on \\\"new to old\\\" and \\\"unlocked and locked\\\" status.\\nAdjusts the default page of the \\\"Adventurer Handbook\\\": if you have completed the content on the \\\"Experience\\\" tab, while the \\\"Commissions\\\" or \\\"Guide\\\" tab still has incomplete content, the first time you log in and open the \\\"Adventurer Handbook,\\\" it will open the \\\"Commissions\\\" or \\\"Guide\\\" page.\\n\\\"Character \u003e Artifact\\\" Interface Function Optimizations:\\na. Records the Artifact set filters and affixes sorting that you set for a specific character, and when entering the interface again, the Artifacts will be displayed based on the previous filter and sorting settings.\\nb. Adds a new button at the bottom of the Artifacts list in this interface to switch between set filtering and non-set filtering states.\\nc. The selected Artifact affix sorting option will now be displayed directly at the bottom of the interface.\\n\\n● Audio\\nRemoves audio resources from earlier versions. After the Version 5.1 update, the audio files will occupy less space compared to Version 5.0.\\nOptimizes the interactive sound effects of certain system interfaces and fixes issues with missing sound effects for some open world objects.\\nAdjusts the volume of music in certain areas in Natlan.\\nOptimizes the sound attenuation effect when the enemy \\\"Goldflame Qucusaur Tyrant\\\" is in flight.\\n\\n● Other\\nAdds support for opening multiple \\\"Domain Reliquaries\\\" simultaneously in batches.\\nUpdates the blocking strategy for certain spam and advertising behaviors.\\nAdjusts the appearance and position of special effects when triggering \\\"Brilliant Blessings\\\" in \\\"Imaginarium Theater\\\" battles.\\nAdjusts the effect descriptions of some \\\"Brilliant Blessings\\\" in \\\"Imaginarium Theater\\\" (the actual effect remains the same).\\nWhen selecting events in \\\"Imaginarium Theater,\\\" you can now switch to other events by clicking on either side of the screen or using the controller buttons.\\nUpdates the tutorial for \\\"Saurian Indwelling\\\" to include explanations regarding how to disengage from the \\\"indwelling\\\" state.\\nAdjusts certain dialogue text in the Commission Quest \\\"Tending to a Tepetlisaurus.\\\"\\nDue to the unclear completion status of Monetoo-related graffiti in the Sulfurous Veins area of Natlan, the special effects of this graffiti will be optimized after the version update to: the related graffiti will be removed after completing the gameplay.\\nImproves the issue whereby Mualani's attacks would miss during the preparation for the Sharky's Surging Bite due to changes in enemy positioning. The developers will continue to monitor this character's performance in battle and we welcome feedback from Travelers.\\n\\n〓Bug Fixes〓\\n● Quests\\nFixes an issue whereby there is a chance that the character would become stuck and unable to be controlled when leaving the quest area while completing the objective \\\"Collect Contending Sparks\\\" of the Archon Quest \\\"Pilgrimage of the Return of the Sacred Flame\\\" under certain circumstances.\\nFixes an issue whereby defeating the relevant enemies during the World Quest \\\"Blackcliff Woes\\\" for the objective \\\"Patrol the Chasm's perimeter\\\" would prevent subsequent objectives from being completed.\\nFixes an issue in related World Quests whereby the scarf on the Saurian companion's tail was missing animation effects.\\nFixes an issue in the the World Quest \\\"Revelations from the Past\\\" whereby scenes or special effects would be appear to be abnormal when switching to Little One's point of view (little Tepetlisaurus) or switching back to the character's point of view under certain circumstances.\\n\\n● Enemies\\nFixes an issue in Co-Op Mode whereby the enemy \\\"Goldflame Qucusaur Tyrant\\\" would appear in an abnormal position when entering combat under certain circumstances.\\nFixes an issue in Co-Op Mode whereby the enemy \\\"Goldflame Qucusaur Tyrant\\\" would abnormally disappear under certain circumstances.\\nFixes an issue whereby the character could be stuck in the Plunging Attack state for a long time if the character was pushed to the barrier at the edge of the battlefield by the enemy while challenging the opponent \\\"Goldflame Qucusaur Tyrant\\\" (After the fix, the duration of the Plunging Attack state will be greatly reduced when the character is pushed against the barrier at the edge of the battlefield by the enemy).\\nFixes an issue whereby the achievement \\\"Love and Non-Communication\\\" could not be completed when repeatedly challenging the enemy \\\"Thunder Manifestation\\\" under certain circumstances.\\nFixes an issue whereby some characters' skill effects may not appear normally or disappear when the enemy \\\"Ichcahuipilli's Aegis\\\" exiles the character to the \\\"Land of Decision.\\\"\\n\\n● Characters\\nFixes an issue whereby the special effects would flicker and shake abnormally at the edge of the camera when Furina used her Elemental Burst in Natlan.\\nFixes an issue whereby the low-altitude and high-altitude landing impact effects would both appear simultaneously when Navia performed a Plunging Attack and hits the ground.\\nFixes an issue whereby the special movement duration of Mualani or Kachina in their Nightsoul's Blessing state would be abnormal under certain circumstances.\\nFixes an issue whereby there was a chance that Mualani would abnormally take fall damage when performing Sharky's Bite in the Nightsoul's Blessing state under certain circumstances.\\nFixes an issue whereby when Kinich had less than 1 second remaining in the Nightsoul's Blessing state and used the \\\"Scalespiker Cannon,\\\" the cooldown time displayed for the Elemental Skill button would become abnormal after the Nightsoul's Blessing state ended.\\nFixes an issue whereby the relevant weather animation effect will end earlier before the skill ends when holding Kinich's Elemental Skill, \\\"Scalespiker Cannon\\\".\\nFixes an issue whereby when Kinich uses his Elemental Skill to swing in mid-air and simultaneously executes a Normal Attack, it can result in an abnormal vertical jump.\\nThe developers will continue to monitor other actions that may cause this character to perform abnormal vertical jumps. If there are any subsequent plans for adjustments and corrections, we will notify Travelers via announcements.\\n\\n● System\\nFixes an issue whereby completing Act 8 in \\\"Imaginarium Theater\\\" in Visionary Mode and finishing the finalization did not allow the corresponding Battle Pass mission to be completed.\\nFixes an issue whereby in the \\\"Forge\\\" interface, the daily crafting quantity would still be deducted even if forging weapon enhancement materials failed due to insufficient required materials under certain circumstances.\\nFixes an issue under certain circumstances whereby the challenge interface would not record the \\\"Best Score\\\" even if you had completed the \\\"Rock Hopping\\\" challenge in the Natlan region.\\nFixes an issue whereby the game would not pause when tracking enemies from the \\\"Adventurer Handbook \u003e Enemies\\\" tab or jumping to the \\\"Map\\\" from material sources in Single-Player Mode.\\nFixes an issue resulting in the food \\\"Strength Tonic\\\" not being displayed in \\\"Archive \u003e Materials/Food and Potions.\\\"\\nFixes an issue whereby the filter applied to the \\\"Food\\\" tab in the \\\"Inventory\\\" interface also took effect for the \\\"Food\\\" tab of the \\\"Parametric Transformer.\\\"\\n\\n● Audio\\nFixes an issue whereby the volume of certain movement sound effects for characters was abnormal after the Version 5.0 update.\\nFixes text and voice-over errors in Chinese and Korean regarding the \\\"Long-Necked Rhino\\\" in the Archon Quest \\\"Flowers Resplendent on the Sun-Scorched Sojourn\\\" (the Japanese and English voice-over will be fixed in subsequent versions).\\nFixes an issue whereby there were errors with the Chinese voice-overs during some quests.\\nFixes an issue whereby the relevant voice lines would not trigger correctly when obtaining Gaming for the first time through a wish.\\nFixes an issue whereby the English voice-over of Kinich and Ajaw's interaction does not synchronize with the idle animation.\\n\\n● Other\\nFixes an issue with the visual effects of the Wildlife \\\"Pyro Crystalfly\\\" and \\\"Coral Butterfly\\\" appearing abnormally.\\nFixes an issue whereby certain wildlife like the \\\"Flying Squirrel\\\" could not be captured.\\nFixes an issue on PlayStation®4 and PlayStation®5 whereby the pre-discount price of some currency for \\\"Gnostic Chorus\\\" was displayed incorrectly (the post-discount actual price and the amount deducted were not affected).\\nAdjusts the names of some \\\"shield\\\" effects to \\\"Ward\\\" in the \\\"Tutorial\\\" menu and other interfaces in languages other than Simplified Chinese (this issue was fixed for Simplified Chinese in Version 5.0).\\nFixes an issue whereby after indwelling a Koholasaur, it would not consume Phlogiston when performing a Aquadash under certain circumstances.\\nFixes an issue whereby after collecting \\\"Flamegranates\\\" while indwelling and controlling a Yumkasaur, the Yumkasaur could continuously leap upward in the air under certain circumstances.\\nFixes an issue whereby the effect \\\"Surprise: Explosive Excitement\\\" from \\\"Mystery Caches\\\" in \\\"Imaginarium Theater\\\" did not activate correctly under certain circumstances.\\nFixes an issue whereby the game would experience an abnormal black screen and become unresponsive after the character teleported to the Obsidian Totem Pole: \\\"Children of Echoes\\\" when playing on certain PC devices.\\nFixes an issue whereby the character's shadow effects would display abnormally in Natlan when playing on certain Android devices.\\nFixes an issue on certain Android devices whereby when controlling and indwelling Saurians in Natlan, there is a chance that the Saurian's model would display abnormally when the camera zoomed in on it.\\nFixes an issue whereby the treasure chest would not appear correctly after picking up the \\\"Apple\\\" and investigating the related location near a Teleport Waypoint in Natlan under certain circumstances.\\nFixes some text errors in certain languages and optimizes text. (Note: Related in-game functions have not changed. Travelers can view the changes in different languages by going to the Paimon Menu \u003e Settings \u003e Language and changing the Game Language.)\\n◆ Optimizes inconsistencies between certain voice-overs and the corresponding lines.\\n◆ Optimizes certain English translations.\\n\\n〓Genius Invokation TCG Balance Adjustment〓\\nRedesigns the Character Card \\\"Eremite Scorching Loremaster\\\" (Travelers can visit the official notice \\\"Version 5.1 Genius Invokation TCG Update Details\\\" or log into the game after the version update to see the changes).\\nAdjusts the effects of the Character Card \\\"Guardian of Apep's Oasis\\\"'s Passive Skill: The number of Awaken, My Kindred generated at the start of the match has been reduced from 6 to 5; the shield generated after summoning 4 Proliferated Organisms has been reduced from 2 points to 1 point.\\nAdjusts the effect of the Character Card \\\"Lisa\\\"'s Normal Attacks: Normal Attacks now apply Conductive to the enemy's active character (no longer requires a Charged Attack).\\nAdjusts the effect of the Character Card \\\"Lisa\\\"'s \\\"Conductive\\\" status: Now, \\\"when the character attached with Conductive takes DMG from Violet Arc or Lightning Rose,\\\" it will trigger \\\"Remove this status and DMG +1 for each stack of Conductive\\\" (previously, this effect could only be triggered by Violet Arc damage).\\n\\n\\n*This is a work of fiction and is not related to any actual people, events, groups, or organizations.\\n\\\"PlayStation\\\", \\\"PS5\\\", \\\"PS4\\\", \\\"DualSense\\\", \\\"DUALSHOCK\\\" are registered trademarks or trademarks of Sony Interactive Entertainment Inc.\\n\"}]","structured_content_rows":[],"lang":"en-us","official_type":1,"reply_forbid":{"date_type":0,"start_date":"0","cur_date":"0","level":0},"video":"","contribution_id":"0","event_start_date":"0","event_end_date":"0","classification_id":"25","is_audit":false,"is_multi_language":true,"origin_lang":"en-us","sub_type":0,"reprint_source":"","can_edit":true,"last_modify_time":0,"multi_language_info":{"langs":["th-th","ko-kr","it-it","zh-cn","de-de","pt-pt","ru-ru","vi-vn","tr-tr","id-id","fr-fr","ja-jp","zh-tw","en-us","es-es"],"future_post_id":"0","lang_subject":{"en-us":"\"The Rainbow Destined to Burn\" Version 5.1 Update Details","it-it":"Dettagli versione 5.1 \"Un arcobaleno destinato a bruciare\"","fr-fr":"Détails de mise à jour de version 5.1 « L'arc-en-ciel voué à brûler »","zh-cn":"「命定将焚的虹光」5.1版本更新说明","pt-pt":"Descrição de Atualização da Versão 5.1 \"Arco-Íris Destinado às Chamas\"","es-es":"Detalles de la versión 5.1 «El arcoíris destinado a arder»","tr-tr":"\"Yanmaya Mahkum Gökkuşağı\" 5.1 Sürümü Güncelleme Ayrıntıları","th-th":"คำอธิบายการอัปเดตเวอร์ชัน 5.1 \"แสงรุ้งที่ถูกลิขิตให้มอดไหม้\"","id-id":"Penjelasan Update Versi 5.1 \"Pelangi dalam Kobaran Takdir\"","de-de":"Erläuterungen zur Aktualisierung auf Version 5.1 „Der zum Brennen bestimmte Regenbogen“","ja-jp":"Ver.5.1「燃ゆる運命の虹光」正式リリース","vi-vn":"Giới Thiệu Cập Nhật Phiên Bản 5.1 \"Cầu Vồng Định Sẵn Sẽ Cháy\"","ru-ru":"Подробности обновления 5.1 «Радуга обречена сгореть»","ko-kr":"5.1 버전 「타오를 운명의 무지개」 업데이트 안내","zh-tw":"「命定將焚的虹光」5.1版本更新說明"},"lang_content":{},"lang_structured_content":{}},"visible_level":1,"has_cover":false,"suid":"0","desc":"Dear Traveler, Below are the details of the Version 5.1 update \"The Rainbow Destined to Burn\" and the update compensation. 〓Compensation Details〓 Maintenance Compensation: Primogems ×300 (60 Primogems per hour the servers are down) Issue Fix Compensation: Primogems ×300 (please refer to the relevant compensation mail for more details) 〓Scope of Compensation〓 Maintenance Compensation: Travelers who have reached Adventure Rank 5 or above by 2024/10/09 06:00 (UTC+8). Compensation must be claimed before the end of Version 5.1. Issue Fix Compensation: Travelers who have reached Adventure Rank 5 or above by 2024/10/09 06:00 (UTC+8). Please log in and claim your compensation before 2024/10/12 06:00 (UTC+8). Our developers will distribute compensation to Travelers via in-game mail within 5 hours after the update maintenance is finished. The mail will expire after 30 days, so don't forget to claim the attached compensation in time. 〓Update Schedule〓 Update maintenance begins 2024/10/09 06:00 (UTC+8) and is estimated to take 5 hours. 〓How to Update Game Client〓 PC: Close the game, open the Genshin Impact Launcher, and click Update. iOS: Open the App Store and tap Update. Android: Open the game and follow the directions on-screen. PS5™ and PS4™: Highlight Genshin Impact from the Home Screen, press the OPTIONS button and select \"Check for Update.\" Please do not hesitate to contact Customer Service if you encounter any issues installing the new version. We will do our very best to resolve the issue. 〓Update Details〓 I. New Character 5-Star Character \"Ardent Flames Forge the Soul\" Xilonen (Geo) ◇ Vision: Geo ◇ Weapon: Sword ◇ A Name Engraver of the Nanatzcayan, she is especially skilled at finding a good balance between the heavy responsibilities of her job and living well. ◆ Elemental Skill: Yohual's Scratch ◇ Source Samples: Xilonen has 3 Geo Samplers with her that can generate different Soundscapes based on her other party members' Elemental Types (Pyro/Hydro/Cryo/Electro). Different Soundscapes can result in Elemental Skills and Bursts to produce various effects, and decrease nearby opponents' corresponding Elemental RES while active. ◇ After unleashing her Elemental Skill, Xilonen will enter the Nightsoul's Blessing state and switch to the Blade Roller mode. While in this mode, Xilonen's Normal Attacks will allow her to perform consecutive kicks using her roller blades. She can also engage in swift movement and climbing, and activate her Geo Samplers. After unlocking the Talent \"Netotiliztli's Echoes,\" different Soundscapes will enhance Xilonen's Normal and Plunging Attacks: either by gaining Nightsoul points upon hitting enemies or by increasing the DMG dealt by Normal and Plunging Attacks. When Nightsoul points reach the maximum, all Samplers will be activated. ◆ Elemental Burst: Ocelotlicue Point! ◇ Deals AoE Geo DMG to opponents and based on different Soundscapes: Restores HP for nearby active characters or deals additional AoE Geo DMG. II. New Equipment 1. New Weapons (Examples based on Refinement Rank 1) Peak Patrol Song (5-Star Sword) Gain \"Ode to Flowers\" after Normal or Plunging Attacks hit an opponent: DEF increases by 8% and gain a 10% All Elemental DMG Bonus for 6s. Max 2 stacks. Can trigger once per 0.1s. When this effect reaches 2 stacks or the 2nd stack's duration is refreshed, increase all nearby party members' All Elemental DMG Bonus by 8% for every 1,000 DEF the equipping character has, up to a maximum of 25.6%, for 15s. ◆ During the event wish \"Epitome Invocation,\" the event-exclusive 5-star weapon Peak Patrol Song (Sword) will receive a huge drop-rate boost! Sturdy Bone (4-Star Sword) Sprint or Alternate Sprint Stamina Consumption decreased by 15%. Additionally, after using Sprint or Alternate Sprint, Normal Attack DMG is increased by 16% of ATK. This effect expires after triggering 18 times or 7s. ◆ During the event wish \"Epitome Invocation,\" the event-exclusive 4-star weapon Sturdy Bone (Sword) will receive a huge drop-rate boost! Mountain-Bracing Bolt (4-Star Polearm) Decreases Climbing Stamina Consumption by 15% and increases Elemental Skill DMG by 12%. Also, after other nearby party members use Elemental Skills, the equipping character's Elemental Skill DMG will also increase by 12% for 8s. ◆ During the event wish \"Epitome Invocation,\" the event-exclusive 4-star weapon Mountain-Bracing Bolt (Polearm) will receive a huge drop-rate boost! Fruitful Hook (4-Star Claymore) Increase Plunging Attack CRIT Rate by 16%; After a Plunging Attack hits an opponent, Normal, Charged, and Plunging Attack DMG increased by 16% for 10s. ◆ During the event wish \"Epitome Invocation,\" the event-exclusive 4-star weapon Fruitful Hook (Claymore) will receive a huge drop-rate boost! III. New Main Story 1. New Archon Quests Archon Quest Chapter V: Act III \"Beyond the Smoke and Mirrors\" Permanently available after the Version 5.1 update ◆ Quest Unlock Criteria: • Reach Adventure Rank 28 or above • Complete Archon Quest Chapter V: Act II \"Black Stone Under a White Stone\" • The \"Focused Experience Mode\" function is available for this quest. Archon Quest Chapter V: Act IV \"The Rainbow Destined to Burn\" Permanently available after the Version 5.1 update ◆ Quest Unlock Criteria: • Reach Adventure Rank 28 or above • Complete Archon Quest Chapter V: Act III \"Beyond the Smoke and Mirrors\" • The \"Focused Experience Mode\" function is available for this quest. 2. New Tribal Chronicle Quest A Prayer for Blessings, Told to Crested Peaks Act III of \"A Prayer for Blessings, Told to Crested Peaks\" will be permanently available after the Version 5.1 update ◆ Act III Quest Unlock Criteria: • Adventure Rank 28 or above • Complete \"A Fuel Named 'Fate'\" in the Archon Quest \"The Rainbow Destined to Burn\" • Complete Act I and Act II of the Tribal Chronicles Quest \"A Prayer for Blessings, Told to Crested Peaks\" You can use the \"Quick Start\" function to accept and progress through Archon Quest Chapter V: Act I \"Flowers Resplendent on the Sun-Scorched Sojourn\" while maintaining your current progress in the existing Archon Quests. After using the \"Quick Start\" function to complete Archon Quest Chapter V: Act I, you can continue to accept and complete the subsequent Acts of Chapter V until you unlock the latest Archon Quest or Tribal Chronicles introduced in the current version update. IV. New Enemies Secret Source Automaton: Configuration Device ◇ A machine with terrifying destructive capabilities. When characters enter and maintain the Nightsoul's Blessing state, the Secret Source Automaton: Configuration Device will start progressing through its Adaptive Countermeasures. Once those are complete, the Configuration Device will start preparing its Boltsphere Cannon. During this time, the Configuration Device will start up its Accretion Mechanism to dig into Solid Phlogiston and collect phlogiston. The Accretion Mechanism will generate an energy field. If you wish to destroy the Mechanism and interrupt the charging of the Boltsphere Cannon, you must first climb the Solid Phlogiston and enter the energy field. Located at Toyac Springs. Tenebrous Mimiflora ◇ An Abyssal monster that has descended to this world from the deep, dark depths of a twisted and alien world, the Tenebrous Mimiflora can mimic various phenomena. The Tenebrous Mimiflora can deploy a Void Ward in combat. Some of its attacks can cause stackable Attrition that, after a time, will cause your active character to lose HP. Use a specific number of Elemental attacks to destroy this creature's Ward. Nightsoul-aligned Elemental attacks can break through its defenses more effectively. V. Other Update Details New Recipes: ○ Cipac (Natlan NPC): BBQ Beef Heart Skewers ○ Natlan's Zakan's Street Bites: Xocoatl New Character Specialty Dish: ○ Xilonen's specialty: Fruit-Flavored Milk Candies Adds new Achievements to the \"Wonders of the World\" category. Adds Set 35 of \"Paimon's Paintings\" chat emojis. New Namecards: \"Xilonen: Cue Point\": Reward for reaching Friendship Lv. 10 with Xilonen \"Travel Notes: Sabzeruz\": Reward obtained via the BP system \"Genius Invokation TCG\" Gameplay Update: New Character Card: Chiori and her corresponding Talent card. Corresponding invitation duel and guest challenges have been added to the Player List. New Character Cards: Eremite Floral Ring-Dancer, Abyss Lector: Violet Lightning, and their corresponding Talent cards. Their Tavern Challenges have also been added. New Action Cards: \"Portable Power Saw,\" \"Conductor's Top Hat,\" \"Tepetlisaurus,\" \"Stage Tepetl,\" \"Eremite Teatime,\" and \"Saurus Crackers\" can be purchased from Prince at The Cat's Tail. The Forge Realm's Temper is once again available. The theme of this edition is \"The Forge Realm's Temper: Clever Stratagems\": 1. During The Forge Realm's Temper: Clever Stratagems, you can select the parameters for each stage. Parameters that may be set include: stage difficulty, enemy health, and the round limit for the match. 2. After completing the challenge, points will be obtained based on the difficulty completed for each parameter. The best score obtained for each stage will be recorded, and will allow you to claim rewards that correspond to certain scores. Imaginarium Theater After the Version 5.1 update, the new season of \"Imaginarium Theater\" will be available on November 1. Required Elemental Types: Pyro, Electro, and Dendro Opening Characters: Klee, Xinyan, Yae Miko, Dori, Tighnari, and Kirara When Imaginarium Theater is open, the corresponding Opening Characters will obtain Fantastical Blessings. Special Guest Stars: Xilonen, Chiori, Xingqiu, and Layla After the first season of Imaginarium Theater begins, the characters Kaedehara Kazuha, Eula, Gorou, and Candace will each gain a new \"Thespian Trick\" that can be exchanged from the NPC Wolfy. Envisaged Echoes Gameplay Update: After the version update, new challenge stages and Echo cosmetics for Zhongli and Keqing will be added. Spiral Abyss ○ The content for the first phase (updated on October 16) is as follows: ◆ Floor 11 Ley Line Disorder changed to: • All party members gain a 75% Geo DMG Bonus. ◆ Updated the monster lineup on Floors 11 – 12 of the Spiral Abyss. ◆ Blessing of the Abyssal Moon: Rugged Moon After a character uses an Elemental Skill, said character's DEF increases by 60% for 9s. ○ The content for the second phase (updated on November 16) is as follows: ◆ Floor 11 Ley Line Disorder changed to: • All party members gain a 60% Geo DMG Bonus. • All party members gain a 60% Pyro DMG Bonus. ◆ Updated the monster lineup on Floors 11 – 12 of the Spiral Abyss. ◆ Blessing of the Abyssal Moon: Vigorous Moon After the current active character's Charged Attack hits an opponent, said character's ATK increases by 20% for 8s. Max 4 stacks, each stack has an independent duration. Due to recording arrangements, some content in Version 5.1 does not have English voice-overs. We sincerely apologize for the inconvenience caused. 〓Adjustments \u0026 Optimizations〓 ● Enemies Adjusts the damage judgment timing of the skill \"Rock Swings\" unleashed by the enemy \"Eroding Avatar of Lava\" to better match its animation. Adjusts the position of the related special effects when the enemy \"Goldflame Qucusaur Tyrant\" triggers a Burning reaction. ● Settings Other than the \"Settings/Others\" interface, you can now also set whether to \"Allow Auto Adding of 5-Star Artifacts as Enhancement Materials\" in the \"Input Settings\" on the Artifact enhancement interface. Other than the \"Settings/Others\" interface, you can now also set whether to \"Auto-Lock 4-Star Weapons\" in the \"Inventory \u003e Weapons\" interface. ● Spiral Abyss When opening the \"Spiral Abyss\" interface, if you have completed the \"Abyss Corridor\" (i.e., Floors 1–8 of the Spiral Abyss) with full stars, the \"Abyssal Moon Spire\" interface will open directly (i.e., Floors 9–12). Adds the Spiral Abyss skip function. After the Spiral Abyss update on October 16: a. If you have completed Floor 11 in the previous Cycle of the Spiral Abyss at full stars, then after the Spiral Abyss update, you can claim the full star rewards for Floor 9 of the current Spiral Abyss. b. After completing Floor 12 of the Spiral Abyss with full stars, you can claim the full star rewards for Floor 9 and Floor 10 of the current Spiral Abyss. *You can claim all Chamber Bounties for the skipped floors directly via the review pop-up. However, the Primogem rewards from Star's Bounty will still need to be claimed manually. ● Enhancement and Forging-related The \"Source\" for character ascension materials, character and weapon enhancement materials, character talent materials, and weapon ascension materials will now display the quantity that can be crafted. The \"Crafting\" interface now allows you to filter the required materials based on the character. After selecting a character, you can further filter by their skills, ascension level, and the weapons they are equipped with. When clicking on Stardust Exchange for the \"Source\" of high-rarity character and weapon enhancement materials, if the currently available materials of the same rarity have been completely exchanged, it will automatically switch to similar materials of a lower rarity. Optimizes the interactive experience in the Crafting, Forge, and Creation/Furnishings interfaces: a. After performing the relevant crafting operation, the icon position of the selected crafted item will no longer change. b. After performing the relevant crafting operation, the refresh effect for the item list will no longer play. ● Other Systems Optimizes the layout and user experience of the pop-up interface for Character Talent Materials and Weapon Ascension Materials in the relevant bundles for \"Battle Pass\" and \"Bundles.\" Adjusts the design of the \"Character \u003e Level Up Talent\" pop-up, and increases the animation speed to optimize the experience when upgrading talents. Adjusts the order of \"Adventurer Handbook \u003e Domain \u003e Trounce Domain\": the \"Trounce Domain\" tab will now be arranged based on \"new to old\" and \"unlocked and locked\" status. Adjusts the default page of the \"Adventurer Handbook\": if you have completed the content on the \"Experience\" tab, while the \"Commissions\" or \"Guide\" tab still has incomplete content, the first time you log in and open the \"Adventurer Handbook,\" it will open the \"Commissions\" or \"Guide\" page. \"Character \u003e Artifact\" Interface Function Optimizations: a. Records the Artifact set filters and affixes sorting that you set for a specific character, and when entering the interface again, the Artifacts will be displayed based on the previous filter and sorting settings. b. Adds a new button at the bottom of the Artifacts list in this interface to switch between set filtering and non-set filtering states. c. The selected Artifact affix sorting option will now be displayed directly at the bottom of the interface. ● Audio Removes audio resources from earlier versions. After the Version 5.1 update, the audio files will occupy less space compared to Version 5.0. Optimizes the interactive sound effects of certain system interfaces and fixes issues with missing sound effects for some open world objects. Adjusts the volume of music in certain areas in Natlan. Optimizes the sound attenuation effect when the enemy \"Goldflame Qucusaur Tyrant\" is in flight. ● Other Adds support for opening multiple \"Domain Reliquaries\" simultaneously in batches. Updates the blocking strategy for certain spam and advertising behaviors. Adjusts the appearance and position of special effects when triggering \"Brilliant Blessings\" in \"Imaginarium Theater\" battles. Adjusts the effect descriptions of some \"Brilliant Blessings\" in \"Imaginarium Theater\" (the actual effect remains the same). When selecting events in \"Imaginarium Theater,\" you can now switch to other events by clicking on either side of the screen or using the controller buttons. Updates the tutorial for \"Saurian Indwelling\" to include explanations regarding how to disengage from the \"indwelling\" state. Adjusts certain dialogue text in the Commission Quest \"Tending to a Tepetlisaurus.\" Due to the unclear completion status of Monetoo-related graffiti in the Sulfurous Veins area of Natlan, the special effects of this graffiti will be optimized after the version update to: the related graffiti will be removed after completing the gameplay. Improves the issue whereby Mualani's attacks would miss during the preparation for the Sharky's Surging Bite due to changes in enemy positioning. The developers will continue to monitor this character's performance in battle and we welcome feedback from Travelers. 〓Bug Fixes〓 ● Quests Fixes an issue whereby there is a chance that the character would become stuck and unable to be controlled when leaving the quest area while completing the objective \"Collect Contending Sparks\" of the Archon Quest \"Pilgrimage of the Return of the Sacred Flame\" under certain circumstances. Fixes an issue whereby defeating the relevant enemies during the World Quest \"Blackcliff Woes\" for the objective \"Patrol the Chasm's perimeter\" would prevent subsequent objectives from being completed. Fixes an issue in related World Quests whereby the scarf on the Saurian companion's tail was missing animation effects. Fixes an issue in the the World Quest \"Revelations from the Past\" whereby scenes or special effects would be appear to be abnormal when switching to Little One's point of view (little Tepetlisaurus) or switching back to the character's point of view under certain circumstances. ● Enemies Fixes an issue in Co-Op Mode whereby the enemy \"Goldflame Qucusaur Tyrant\" would appear in an abnormal position when entering combat under certain circumstances. Fixes an issue in Co-Op Mode whereby the enemy \"Goldflame Qucusaur Tyrant\" would abnormally disappear under certain circumstances. Fixes an issue whereby the character could be stuck in the Plunging Attack state for a long time if the character was pushed to the barrier at the edge of the battlefield by the enemy while challenging the opponent \"Goldflame Qucusaur Tyrant\" (After the fix, the duration of the Plunging Attack state will be greatly reduced when the character is pushed against the barrier at the edge of the battlefield by the enemy). Fixes an issue whereby the achievement \"Love and Non-Communication\" could not be completed when repeatedly challenging the enemy \"Thunder Manifestation\" under certain circumstances. Fixes an issue whereby some characters' skill effects may not appear normally or disappear when the enemy \"Ichcahuipilli's Aegis\" exiles the character to the \"Land of Decision.\" ● Characters Fixes an issue whereby the special effects would flicker and shake abnormally at the edge of the camera when Furina used her Elemental Burst in Natlan. Fixes an issue whereby the low-altitude and high-altitude landing impact effects would both appear simultaneously when Navia performed a Plunging Attack and hits the ground. Fixes an issue whereby the special movement duration of Mualani or Kachina in their Nightsoul's Blessing state would be abnormal under certain circumstances. Fixes an issue whereby there was a chance that Mualani would abnormally take fall damage when performing Sharky's Bite in the Nightsoul's Blessing state under certain circumstances. Fixes an issue whereby when Kinich had less than 1 second remaining in the Nightsoul's Blessing state and used the \"Scalespiker Cannon,\" the cooldown time displayed for the Elemental Skill button would become abnormal after the Nightsoul's Blessing state ended. Fixes an issue whereby the relevant weather animation effect will end earlier before the skill ends when holding Kinich's Elemental Skill, \"Scalespiker Cannon\". Fixes an issue whereby when Kinich uses his Elemental Skill to swing in mid-air and simultaneously executes a Normal Attack, it can result in an abnormal vertical jump. The developers will continue to monitor other actions that may cause this character to perform abnormal vertical jumps. If there are any subsequent plans for adjustments and corrections, we will notify Travelers via announcements. ● System Fixes an issue whereby completing Act 8 in \"Imaginarium Theater\" in Visionary Mode and finishing the finalization did not allow the corresponding Battle Pass mission to be completed. Fixes an issue whereby in the \"Forge\" interface, the daily crafting quantity would still be deducted even if forging weapon enhancement materials failed due to insufficient required materials under certain circumstances. Fixes an issue under certain circumstances whereby the challenge interface would not record the \"Best Score\" even if you had completed the \"Rock Hopping\" challenge in the Natlan region. Fixes an issue whereby the game would not pause when tracking enemies from the \"Adventurer Handbook \u003e Enemies\" tab or jumping to the \"Map\" from material sources in Single-Player Mode. Fixes an issue resulting in the food \"Strength Tonic\" not being displayed in \"Archive \u003e Materials/Food and Potions.\" Fixes an issue whereby the filter applied to the \"Food\" tab in the \"Inventory\" interface also took effect for the \"Food\" tab of the \"Parametric Transformer.\" ● Audio Fixes an issue whereby the volume of certain movement sound effects for characters was abnormal after the Version 5.0 update. Fixes text and voice-over errors in Chinese and Korean regarding the \"Long-Necked Rhino\" in the Archon Quest \"Flowers Resplendent on the Sun-Scorched Sojourn\" (the Japanese and English voice-over will be fixed in subsequent versions). Fixes an issue whereby there were errors with the Chinese voice-overs during some quests. Fixes an issue whereby the relevant voice lines would not trigger correctly when obtaining Gaming for the first time through a wish. Fixes an issue whereby the English voice-over of Kinich and Ajaw's interaction does not synchronize with the idle animation. ● Other Fixes an issue with the visual effects of the Wildlife \"Pyro Crystalfly\" and \"Coral Butterfly\" appearing abnormally. Fixes an issue whereby certain wildlife like the \"Flying Squirrel\" could not be captured. Fixes an issue on PlayStation®4 and PlayStation®5 whereby the pre-discount price of some currency for \"Gnostic Chorus\" was displayed incorrectly (the post-discount actual price and the amount deducted were not affected). Adjusts the names of some \"shield\" effects to \"Ward\" in the \"Tutorial\" menu and other interfaces in languages other than Simplified Chinese (this issue was fixed for Simplified Chinese in Version 5.0). Fixes an issue whereby after indwelling a Koholasaur, it would not consume Phlogiston when performing a Aquadash under certain circumstances. Fixes an issue whereby after collecting \"Flamegranates\" while indwelling and controlling a Yumkasaur, the Yumkasaur could continuously leap upward in the air under certain circumstances. Fixes an issue whereby the effect \"Surprise: Explosive Excitement\" from \"Mystery Caches\" in \"Imaginarium Theater\" did not activate correctly under certain circumstances. Fixes an issue whereby the game would experience an abnormal black screen and become unresponsive after the character teleported to the Obsidian Totem Pole: \"Children of Echoes\" when playing on certain PC devices. Fixes an issue whereby the character's shadow effects would display abnormally in Natlan when playing on certain Android devices. Fixes an issue on certain Android devices whereby when controlling and indwelling Saurians in Natlan, there is a chance that the Saurian's model would display abnormally when the camera zoomed in on it. Fixes an issue whereby the treasure chest would not appear correctly after picking up the \"Apple\" and investigating the related location near a Teleport Waypoint in Natlan under certain circumstances. Fixes some text errors in certain languages and optimizes text. (Note: Related in-game functions have not changed. Travelers can view the changes in different languages by going to the Paimon Menu \u003e Settings \u003e Language and changing the Game Language.) ◆ Optimizes inconsistencies between certain voice-overs and the corresponding lines. ◆ Optimizes certain English translations. 〓Genius Invokation TCG Balance Adjustment〓 Redesigns the Character Card \"Eremite Scorching Loremaster\" (Travelers can visit the official notice \"Version 5.1 Genius Invokation TCG Update Details\" or log into the game after the version update to see the changes). Adjusts the effects of the Character Card \"Guardian of Apep's Oasis\"'s Passive Skill: The number of Awaken, My Kindred generated at the start of the match has been reduced from 6 to 5; the shield generated after summoning 4 Proliferated Organisms has been reduced from 2 points to 1 point. Adjusts the effect of the Character Card \"Lisa\"'s Normal Attacks: Normal Attacks now apply Conductive to the enemy's active character (no longer requires a Charged Attack). Adjusts the effect of the Character Card \"Lisa\"'s \"Conductive\" status: Now, \"when the character attached with Conductive takes DMG from Violet Arc or Lightning Rose,\" it will trigger \"Remove this status and DMG +1 for each stack of Conductive\" (previously, this effect could only be triggered by Violet Arc damage). *This is a work of fiction and is not related to any actual people, events, groups, or organizations. \"PlayStation\", \"PS5\", \"PS4\", \"DualSense\", \"DUALSHOCK\" are registered trademarks or trademarks of Sony Interactive Entertainment Inc."},"forum":null,"topics":[],"user":{"uid":"1015537","nickname":"Genshin Impact Official","introduce":"Grand Master of Genshin Impact Forum","avatar":"100236","gender":0,"certification":{"type":1,"icon_url":"https://hyl-static-res-prod.hoyolab.com/upload/static-resource/2022/02/23/f5a37763f0f2080c0c43cca8638af024_5295925290813405198.webp","desc":"Official Big Boss"},"level_exp":{"level":0,"exp":0},"is_following":false,"is_followed":false,"avatar_url":"https://fastcdn.hoyoverse.com/static-resource-v2/2024/04/10/71a62b9a993534f3db7896fc6f725ff8_4436020059642725994.webp","auth":null,"is_logoff":false,"pendant":"","was_following":false,"post_num":3049,"suid":"0","black_relation":{"is_blacking":false,"is_blacked":false},"badge":null,"lantern":null,"otaku_devotion_title":{"icon":"","name":"","desc":"","otaku_identity":"OtakuIdentityNone","accompany_title":"AccompanyTitleUnknown","role_id":"0"}},"self_operation":{"attitude":0,"is_collected":false},"stat":{"view_num":127989,"reply_num":422,"like_num":3126,"bookmark_num":311,"share_num":85,"view_num_unit":"","reply_num_unit":"","like_num_unit":"","bookmark_num_unit":"","share_num_unit":"","true_view_num":0,"click_view_num":0,"summary_for_creator":null,"multi_upvote_stats":[{"upvote_id":"1","upvote_num":3014},{"upvote_id":"4","upvote_num":40},{"upvote_id":"2","upvote_num":27},{"upvote_id":"3","upvote_num":25},{"upvote_id":"8","upvote_num":7},{"upvote_id":"7","upvote_num":5},{"upvote_id":"9","upvote_num":4},{"upvote_id":"10","upvote_num":2},{"upvote_id":"5","upvote_num":1},{"upvote_id":"6","upvote_num":1}],"self_operation":null},"help_sys":null,"cover":null,"image_list":[{"url":"https://upload-os-bbs.hoyolab.com/upload/2024/10/08/0/20e288502dee30ce1a0210347a6c4102_3269712289995868092.jpeg","height":390,"width":1080,"format":"JPEG","size":"87271","spoiler":false,"cuts":[{"ratio":2,"lt_point":{"x":11,"y":7},"rb_point":{"x":485,"y":363}},{"ratio":3,"lt_point":{"x":53,"y":0},"rb_point":{"x":443,"y":389}},{"ratio":4,"lt_point":{"x":11,"y":7},"rb_point":{"x":485,"y":274}},{"ratio":1,"lt_point":{"x":102,"y":0},"rb_point":{"x":394,"y":389}}],"tag_info":{"is_long_picture":false},"template_info":null,"image_id":"92657214"}],"is_official_master":false,"is_user_master":false,"hot_reply_exist":true,"vote_count":0,"last_modify_time":0,"contribution":null,"classification":{"id":"25","name":"Game News \u0026 suggestions","icon":""},"video":null,"game":{"game_id":2,"game_name":"Genshin Impact","color":"#7D6631","background_color":"#F3E9C8","icon":""},"data_box":"","is_top_icon":false,"tags":{"is_user_top":false,"is_qualified_post":true,"is_hot_entry_post":false,"hot_topic_idx":0},"hot_reply":null,"collection":null,"is_rich_text":false,"catalog_style_hint":0,"cover_list":[{"url":"https://upload-os-bbs.hoyolab.com/upload/2024/10/08/0/20e288502dee30ce1a0210347a6c4102_3269712289995868092.jpeg","height":390,"width":1080,"format":"JPEG","size":"87271","spoiler":false,"cuts":[{"ratio":2,"lt_point":{"x":11,"y":7},"rb_point":{"x":485,"y":363}},{"ratio":3,"lt_point":{"x":53,"y":0},"rb_point":{"x":443,"y":389}},{"ratio":4,"lt_point":{"x":11,"y":7},"rb_point":{"x":485,"y":274}},{"ratio":1,"lt_point":{"x":102,"y":0},"rb_point":{"x":394,"y":389}}],"tag_info":{"is_long_picture":false},"template_info":null,"image_id":"92657214"}],"cut_type":1,"shows_game_classification":false,"vote":null,"hot_reply_v2":null,"feedback":null,"reply_quick_source":[],"trans_source":"AWSTranslate"}}}