{
  "Prime Minister's statement on the death of Her Majesty Queen Elizabeth II": {
    "name": "Prime Minister's statement on the death of Her Majesty Queen Elizabeth II",
    "date": "2022-09-08 19:05:00 +0100",
    "info": "We are all devastated by the news we have just heard from Balmoral.\n\nThe death of Her Majesty The Queen is a huge shock to the nation and to the world.\n\nQueen Elizabeth II was the rock on which modern Britain was built.\n\nOur country has grown and flourished under her reign.\n\nBritain is the great country it is today because of her.\n\nShe ascended the throne just after the Second World War.\n\nShe championed the development of the Commonwealth - from a small group of seven countries to a family of 56 nations spanning every continent of the world.\n\nWe are now a modern, thriving, dynamic nation.\n\nThrough thick and thin, Queen Elizabeth II provided us with the stability and the strength that we needed.\n\nShe was the very spirit of Great Britain – and that spirit will endure.\n\nShe has been our longest-ever reigning monarch.\n\nIt is an extraordinary achievement to have presided with such dignity and grace for 70 years.\n\nHer life of service stretched beyond most of our living memories.\n\nIn return, she was loved and admired by the people in the United Kingdom and all around the world.\n\nShe has been a personal inspiration to me and to many Britons. Her devotion to duty is an example to us all.\n\nEarlier this week, at 96, she remained determined to carry out her duties as she appointed me as her 15th Prime Minister.\n\nThroughout her life she has visited more than 100 countries and she has touched the lives of millions around the world.\n\nIn the difficult days ahead, we will come together with our friends…\n\n….across the United Kingdom, the Commonwealth and the world…\n\n…to celebrate her extraordinary lifetime of service.\n\nIt is a day of great loss, but Queen Elizabeth II leaves a great legacy.\n\nToday the Crown passes - as it is has done for more than a thousand years - to our new monarch, our new head of state:\n\nHis Majesty King Charles III.\n\nWith the King’s family, we mourn the loss of his mother.\n\nAnd as we mourn, we must come together as a people to support him.\n\nTo help him bear the awesome responsibility that he now carries for us all.\n\nWe offer him our loyalty and devotion just as his mother devoted so much to so many for so long.\n\nAnd with the passing of the second Elizabethan age, we usher in a new era in the magnificent history of our great country,\n\n– exactly as Her Majesty would have wished –\n\nby saying the words…\n\nGod save the King.",
    "url": "https://www.gov.uk/government/speeches/prime-ministers-statement-on-the-death-of-her-majesty-queen-elizabeth-ii",
    "tag": ["history", "speech"]
  },
  "The Queen’s death": {
    "name": "The Queen’s death",
    "date": "2022-09-08 18:30:00 +0100",
    "tag": ["history"]
  },
  "The Queen’s born": {
    "name": "The Queen’s born",
    "date": "1926-04-21 01:03:00 +0100",
    "tag": ["history"]
  },
  "King Charles III Addresses the Nation for the Very First Time": {
    "name": "King Charles III Addresses the Nation for the Very First Time",
    "date": "2022-09-09 18:22:00 +0100",
    "info": "I speak to you today with feelings of profound sorrow. Throughout her life, Her Majesty The Queen -- my beloved Mother -- was an inspiration and example to me and to all my family, and we owe her the most heartfelt debt any family can owe to their mother; for her love, affection, guidance, understanding and example.\nQueen Elizabeth was a life well lived; a promise with destiny kept and she is mourned most deeply in her passing. That promise of lifelong service I renew to you all today.\nAlongside the personal grief that all my family are feeling, we also share with so many of you in the United Kingdom, in all the countries where The Queen was Head of State, in the Commonwealth and across the world, a deep sense of gratitude for the more than 70 years in which my Mother, as Queen, served the people of so many nations.\nIn 1947, on her 21st birthday, she pledged in a broadcast from Cape Town to the Commonwealth to devote her life, whether it be short or long, to the service of her peoples.\nThat was more than a promise: it was a profound personal commitment which defined her whole life. She made sacrifices for duty.\nHer dedication and devotion as Sovereign never waivered, through times of change and progress, through times of joy and celebration, and through times of sadness and loss.\nIn her life of service we saw that abiding love of tradition, together with that fearless embrace of progress, which make us great as Nations. The affection, admiration and respect she inspired became the hallmark of her reign.\nAnd, as every member of my family can testify, she combined these qualities with warmth, humour and an unerring ability always to see the best in people.\nI pay tribute to my Mother's memory and I honour her life of service. I know that her death brings great sadness to so many of you and I share that sense of loss, beyond measure, with you all.\nWhen The Queen came to the throne, Britain and the world were still coping with the privations and aftermath of the Second World War, and still living by the conventions of earlier times.\nIn the course of the last 70 years we have seen our society become one of many cultures and many faiths.\nThe institutions of the State have changed in turn. But, through all changes and challenges, our nation and the wider family of Realms -- of whose talents, traditions and achievements I am so inexpressibly proud -- have prospered and flourished. Our values have remained, and must remain, constant.\nThe role and the duties of Monarchy also remain, as does the Sovereign's particular relationship and responsibility towards the Church of England -- the Church in which my own faith is so deeply rooted.\nIn that faith, and the values it inspires, I have been brought up to cherish a sense of duty to others, and to hold in the greatest respect the precious traditions, freedoms and responsibilities of our unique history and our system of parliamentary government.\nAs The Queen herself did with such unswerving devotion, I too now solemnly pledge myself, throughout the remaining time God grants me, to uphold the Constitutional principles at the heart of our nation.\nAnd wherever you may live in the United Kingdom, or in the Realms and territories across the world, and whatever may be your background or beliefs, I shall endeavour to serve you with loyalty, respect and love, as I have throughout my life.\nMy life will of course change as I take up my new responsibilities.\nIt will no longer be possible for me to give so much of my time and energies to the charities and issues for which I care so deeply. But I know this important work will go on in the trusted hands of others.\nThis is also a time of change for my family. I count on the loving help of my darling wife, Camilla.\nIn recognition of her own loyal public service since our marriage 17 years ago, she becomes my Queen Consort.\nI know she will bring to the demands of her new role the steadfast devotion to duty on which I have come to rely so much.\nAs my Heir, William now assumes the Scottish titles which have meant so much to me.\nHe succeeds me as Duke of Cornwall and takes on the responsibilities for the Duchy of Cornwall which I have undertaken for more than five decades.\nToday, I am proud to create him Prince of Wales, Tywysog Cymru, the country whose title I have been so greatly privileged to bear during so much of my life and duty.\nWith Catherine beside him, our new Prince and Princess of Wales will, I know, continue to inspire and lead our national conversations, helping to bring the marginal to the centre ground where vital help can be given.\nI want also to express my love for Harry and Meghan as they continue to build their lives overseas.\nIn a little over a week's time we will come together as a nation, as a Commonwealth and indeed a global community, to lay my beloved mother to rest.\nIn our sorrow, let us remember and draw strength from the light of her example.\nOn behalf of all my family, I can only offer the most sincere and heartfelt thanks for your condolences and support.\nThey mean more to me than I can ever possibly express.\nAnd to my darling Mama, as you begin your last great journey to join my dear late Papa, I want simply to say this: thank you.\nThank you for your love and devotion to our family and to the family of nations you have served so diligently all these years.\nMay 'flights of Angels sing thee to thy rest'.",
    "tag": ["history", "speech"]
  }
}
