import { AirportBankRights } from "../../type";

export const AirportBankVIP: AirportBankRights[] = [
    {
        bank: "工商银行",
        card: "大白金(含特殊年费)",
        rules: "不限次"
    }, {
        bank: "农业银行",
        card: ["私人信用卡绿钻版、昀钻版", "典藏白、精粹白、银联/万事达尊然白", "航司白银联版"],
        rules: ["不限次", "不限次", "不限次"]
    }, {
        bank: "交通银行",
        card: ["世界之极、钻石卡", "白麒麟、怡然白", "航司白"],
        rules: ["6次/卡/年", "6次/卡/年", "6次/卡/年"]
    }, {
        bank: "招商银行",
        card: ["百夫长黑/无限卡", "银联钻/百夫长白/万事达世界卡", "经典白"],
        rules: ["不限次1+3", "60次/年，每次限携伴1人，主卡和携伴均扣次", "6次/年，每次限携伴1人，主卡和携伴均扣次"]
    }, {
        bank: "民生银行",
        card: ["百夫长黑金卡、钻石卡、无限卡、世界之极卡", "百夫长白、豪华白"],
        rules: ["扣积点，300-1000", "扣积点，300-1000"]
    }, {
        bank: "广发银行",
        card: ["2500刚性年费及以上高端白，推荐奕驾黑、商旅白", "刚性年费类臻享白等高端白"],
        rules: ["无限次，可进北广(标准白除外),奕驾黑可1+1", "无限次，其中北广不可进楼"]
    }, {
        bank: "兴业银行",
        card: ["行卡标白", "行卡悠白"],
        rules: ["无限次，免费随行4人次/年", "12次/年，免费随行2人次/年"]
    },
]



